{"company": {"id": 3, "name": "Amazon", "aliases": []}, "stats": {"POSITIVE": 2, "NEGATIVE": 5, "NEUTRAL": 3, "TOTAL": 10, "AVG_SCORE": -0.17999999999999997}, "mentions": [{"id": 23, "title": "All about Blue Origin: How Jeff Bezos launched a rocket company that's competing with SpaceX", "content": "Blue Origin: Jeff Bezos' Space Company's History, Rockets, Launches - Business Insider Science All about Blue Origin: How Jeff Bezos launched a rocket company that's competing with SpaceX By Morgan McFall-Johnsen Jeff Bezos founded Blue Origin and flew on its first rocket launch with passengers. Joe Raedle/Getty Images 2025-04-12T10:08:01Z Share Facebook Email X LinkedIn Copy link Save Saved Read in app This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in . Jeff Bezos founded Blue Origin in 2000 and has been competing with SpaceX. Blue Origin has two rockets and is developing a moon lander and multifunctional spacecraft. Here's the rocket company's history, mission, customers, and biggest rocket launches. Blue Origin's rockets are making a name for themselves in the private space race. Jeff Bezos founded the aerospace company in 2000 with the idea of moving heavy, polluting industries off our planet and into space, where millions of people would live and work. The company's name, Blue Origin, refers to Earth. Bezos called Blue Origin his \"most important work,\" in a 2018 interview with Axel Springer . Blue Origin's mission is to \"build a road to space\" by developing reliable, cost-effective rockets. Blue Origin is vying for space industry dominance as spaceflight companies aim for the moon and Mars. The company's New Shepard rockets regularly fly tourists on short flights to the edge of space. Its New Glenn rocket is designed to carry heavy missions into orbit or to the moon. Blue Origin engineers are also developing a moon lander, called Blue Moon, for future NASA use. Blue Origin's ambitions have been a source of rivalry between Bezos and Elon Musk , whose company SpaceX remains the world's leading rocket-launch provider. History and founding Bezos has said he founded Blue Origin with the vision of giant space stations hosting entire mega-cities of people, based on concepts proposed by the physicist Gerard K. O'Neill in 1976. Bezos told Lex Fridman in 2023 that he wants to support one trillion humans living throughout the solar system. He added that would result in 1,000 Mozarts and 1,000 Einsteins at any given time. \"We could easily support a civilization that large with all the resources in the solar system,\" he added. Still, Bezos says in a video on Blue Origin's website that \"Earth is the best planet.\" Blue Origin did not initially seem to improve Jeff Bezos' net worth , though. Bezos later revealed, in 2017, that he was selling Amazon stock to finance the rocket company. The company kept a very low profile for its first two decades. Blue Origin's first rocket launch was in 2015. That was an uncrewed test flight of the suborbital New Shepard rocket. Bezos himself flew on New Shepard's first passenger flight in July 2021, making history as the first billionaire to reach the Kármán line, which is a somewhat arbitrary but internationally recognized boundary at 100 kilometers (62 miles) altitude. It's sometimes referred to as the beginning of outer space. Bezos stepped down as Amazon CEO that same year, saying he wanted to focus on Blue Origin. In May 2023, Blue Origin won a NASA contract to land astronauts on the moon, after suing the agency for awarding its first moon-landing contract to only SpaceX . The company lost the lawsuit. Blue Origin's super-sized orbital rocket, New Glenn , launched for the first time in January 2025. In April 2025, the company clinched its first Pentagon launch contracts. Blue Origin's CEO is Dave Limp. The company is headquartered in Kent, Washington, and has rocket launch facilities in West Texas. It has also used a launchpad at Cape Canaveral Space Force Station in Florida. Blue Origin rockets Blue Origin has one suborbital rocket and one orbital rocket. It's also developing a moon lander and a moon-orbiting spacecraft. Related stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know New Glenn Blue Origin's New Glenn rocket is designed to launch missions into Earth's orbit and to the moon, with a reusable booster to reduce launch costs. Blue Origin's New Glenn heavy-lift rocket prepares for launch. Blue Origin New Glenn is named after the first American to reach orbit, John Glenn . Seven BE-4 engines on the booster give it enough power to carry up to 45 metric tons into space. New Glenn belongs to a new generation of the largest, most powerful rockets ever built, next to SpaceX's Starship and NASA's new moon rocket, the Space Launch System. Blue Origin had begun developing an orbital launch system by 2013, and New Glenn finally made its inaugural flight in January 2025. New Glenn's first launch was a major leap forward for Blue Origin. It was the first time a rocket company successfully reached orbit on its first-ever attempt. Here's how the rocket's launch works: As New Glenn screams through the skies, the booster does most of the heavy lifting. Once its fuel is spent and the rocket is on a strong trajectory toward space, the booster separates from the rocket's second stage, which continues onward using BE-3U engines. Blue Origin aims to land the booster on a platform in the ocean, but on New Glenn's first flight, the booster was lost as it fell back to Earth. Eventually, the company wants to reuse boosters up to 25 times. According to Blue Origin, the company is already working with customers for New Glenn missions, including AST SpaceMobile, telecommunications companies, and the US Space Force. New Shepard Blue Origin's New Shepard rocket is designed for suborbital flights which skim the edge of space. It has been flying tourist crews of up to six passengers since 2021. Blue Origin's New Shepard suborbital rocket launches. Blue Origin Bezos himself flew on New Shepard's first flight, then took the Star Trek actor William Shatner on the rocket's second flight later that year. Upon landing, Shatner said seeing the blackness of space was like looking at death, and added, \"I hope I never recover from this.\" Jeff Bezos pinned astronaut wings on William Shatner after their flight together aboard Blue Origin's New Shepard rocket. Blue Origin Blue Origin plans to fly its first all-female passenger crew aboard New Shepard on April 14, including Gayle King, Katy Perry, and Bezos's fiancée, Lauren Sánchez . Flights on New Shepard last about 11 minutes. Passengers get about three minutes of microgravity, where they can unbuckle from their seats, drift around the spaceship's cabin, and peer out the windows at Earth, before strapping back in for the plummet home. Because it doesn't need to push itself all the way into orbit, New Shepard is a tiny rocket at just 61 feet tall. BE-3PM engines launch the rocket, then re-fire to softly land it back on the ground. New Shepard is completely reusable. New Shepard's development involved nine years of testing, which included 16 test flights and three tests of the capsule's emergency escape system. The vehicle is named after astronaut Alan Shepard, who was the first American to travel to space. Unlike Glenn's orbital flight, Shepard's flight was suborbital. Blue Moon Blue Origin is developing the Blue Moon vehicle to land missions on the surface of the moon, launched by the New Glenn rocket. An artist's rendering of Blue Origin's Blue Moon lander. Blue Origin The company is developing variations of the spacecraft for cargo — up to three metric tons of it — and human crews. Blue Origin is building BE-7 engines for the lander. The engines are designed to operate in the vacuum of space with enough power to land heavy missions on the moon. Blue Origin is developing the lander under a $3.4 billion NASA contract. The contract calls for Blue Origin to conduct an uncrewed test mission to the lunar surface before carrying two astronauts there in 2029. For NASA astronaut missions, Blue Moon must be able to dock to the Lunar Gateway space station the agency is planning to build in lunar orbit. Blue Ring In 2023 Blue Origin announced it was working on a highly maneuverable spacecraft called Blue Ring. The company plans to sell Blue Ring missions to other companies, which can put more than 3,000 kilograms (about 6,600 pounds) of hardware on board. Blue Origin says the vehicle can enter a variety of orbits between Earth and the moon. \"Blue Ring addresses two of the most difficult challenges in spaceflight today: growing space infrastructure and increasing mobility on-orbit,\" Paul Ebertz, the senior vice president of Blue Origin's in-space systems, said in a statement. The first New Glenn launch carried a prototype of Blue Ring. Blue Origin vs. SpaceX Blue Origin and SpaceX have competed for NASA contracts and clout. SpaceX frequently wins the competition. Elon Musk and Jeff Bezos are competing in the commercial space race. Chris Unger/Zuffa LLC; Eugene Gologursky/Getty Images for The New York Times SpaceX was founded two years later than Blue Origin, but it was launching rockets to orbit by 2008. Its highly influential orbital Falcon 9 rocket first began flying in 2010. Blue Origin didn't launch its first orbital rocket until 2025. Some of Bezos' space projects mirror Musk's. For example, like SpaceX's Starship, Blue Origin's New Glenn is designed to be a reusable super-heavy-lift mega-rocket. While SpaceX launches thousands of Starlink internet satellites into orbit, Bezos's counterpart — Amazon's Kuiper satellites — have been building to their first launch. At the New York Times DealBook Summit in December 2024, Bezos said that Blue Origin \"is not a very good business, yet.\" Still, he added, \"It's going to be the best business that I've ever been involved in.\" Recommended video Blue Origin Jeff Bezos Read next Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know HOME Subscribe This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in . Jump to Main content Search Account", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.businessinsider.com/blue-origin", "source": "Business Insider", "published_at": "2025-04-12T10:08:01"}, {"id": 24, "title": "Save a thousand bucks on Lenovo's ThinkPad E16 beast of a laptop at Amazon", "content": "Save a thousand bucks on Lenovo's ThinkPad E16 beast of a laptop at Amazon - PhoneArena Home News You are here Save a thousand bucks on Lenovo's ThinkPad E16 beast of a laptop at Amazon By Iskren Gaidarov Published: Apr 12, 2025, 5:07 AM 0 comments Follow us on Google News Deals Laptops We may earn a commission if you make a purchase from the links on this page. Lenovo is one of the best brands when it comes to Windows-powered laptops. With its ThinkPad and Yoga series, it has established itself as a reliable and persistent competitor to major laptop players like Apple, Asus, and Microsoft. Check out our list of the best laptop deals of the week Right now there’s a deal that saves you a thousand bucks on a new ThinkPad E16. You heard that right, you can snatch an Intel Core Ultra 7-powered beast at $1,000 off on Amazon right now. But you need to hurry, as stock is limited. Lenovo ThinkPad E16 with Core Ultra 7 now $1,000 off at Amazon $1000 off (43%) The 64GB of RAM, 2TB of PCIe SSD of storage version of Lenovo's beast of a laptop is now almost half its regular price. This 16-inch ThinkPad beauty is the perfect work-companion, but you should hurry as stock is limited. Buy at Amazon Lenovo ThinkPad E16 with Core Ultra 7 now $850 off at Amazon $850 off (43%) If you don't need all that storage and want to save some money on your purchase, the 32GB of RAM, 1TB of PCIe SSD of storage version of the laptop is also having a major drop in price. Buy at Amazon This tempting deal is for the 16-inch Gen 2 ThinkPad E16 combined with 64GB of DDR5 RAM and a fast, yet large 2TB PCIe SSD storage disk. You can also opt for half of this storage and memory if you don't need this much and grab the laptop at an even more affordable price. The ThinkPad E16 features a classic but lightweight design in black with a clever notch for the HD camera, as the display bezels of the device are pretty tiny, making it more compact. Under the hood, as mentioned earlier this version of the laptop is a true beast. This is thanks to the 16-core Intel Core Ultra 7-155H processor that powers it, which can reach up to 4.8GHz of processing speed. Combined with its very large RAM and fast storage, you should be fine in terms of smoothness and performance for many years to come. Receive the latest phone deals Subscribe By subscribing you agree to our terms and conditions and privacy policy . Lenovo ThinkPad E16’s display can hit up to 300 nits of brightness, which means it is more suitable for the office, rather than traveling. The display itself is an LCD panel with 1080p resolution and Anti-glare coating. The keyboard is backlit, which is a must-have among modern laptops. FYI, it isn’t a touchscreen. The battery life should last more than a full day of work. One of the most important things a work laptop should have is ports. The ThinkPad E16 comes with plenty, including two USB-C and two USB-A ports, a headphone jack, and an HDMI 2.1 port. This version of the Lenovo laptop runs Windows 11 Pro out of the box and has modern features like a fingerprint scanner and Wi-Fi 6E. Did you enjoy reading this article? There's more to explore with a FREE members account. Access members-only articles Join community discussions Share your own device reviews Manage your newsletter choices Register For Free Already a member? Sign in Iskren Gaidarov Affiliate Content Lead View Full Bio Iskren, a tech journalist at PhoneArena, has been passionate about technology since his childhood, sparked by his early experiences with phones like the Ericsson T28 and Sony Ericsson P910i. After earning a bachelor's degree in Media and Journalism, he turned his fascination with smartphones into a career, with a particular interest in Apple and Motorola. Outside of his tech pursuits, Iskren enjoys watching TV series, movies, driving, and has a deep passion for cars and Formula 1. He looks forward to the future of mobile tech, particularly the potential of rollable smartphones. Read the latest from Iskren Gaidarov These are the best budget deals of the week under $50 at Amazon Motorola: we offer the RAZR and Apple doesn't Loading Comments... COMMENT Sort: Newest first Oldest first Most popular All comments need to comply with our Community Guidelines Phonearena comments rules A discussion is a place, where people can voice their opinion, no matter if it is positive, neutral or negative. However, when posting, one must stay true to the topic, and not just share some random thoughts, which are not directly related to the matter. Things that are NOT allowed: Off-topic talk - you must stick to the subject of discussion Trolling - see a description Flame wars Offensive, hate speech - if you want to say something, say it politely Spam/Advertisements - these posts are deleted Multiple accounts - one person can have only one account Impersonations and offensive nicknames - these accounts get banned Moderation is done by humans. We try to be as objective as possible and moderate with zero bias. If you think a post should be moderated - please, report it. Have a question about the rules or why you have been moderated/limited/banned? Please, contact us . Join the discussion... Popular stories I just ditched my grandfathered T-Mobile Magenta plan — and I’m not sorry T-Mobile is raising prices yet again with the oldest and dirtiest trick in the book T-Mobile's free line offer is giving some customers a very expensive surprise This is the coolest flip phone this year and it’s not the Galaxy Z Flip 7 Some Google Pixel phones are getting a mid-cycle single-feature drop that supercharges Gemini Verizon gets a green light to get rid of yet another dead zone Latest News At 41% off, the transparent Beats Studio Buds+ are the top-tier earbuds you should get Snapdragon 8 Elite 2 AP set to deliver substantial performance gains for flagship Android phones Florida's social media bill for minors asks these platforms to do the impossible Budget-friendly 256GB iPad 10 drops to its lowest price on Amazon, making it smashing good deal How to get a free Google Pixel 9a (and earbuds) without leaving your current T-Mobile plan Trump's latest stunner takes Apple off the hook as phones, other electronics get a tariff exemption FCC OKs Cingular\\'s purchase of AT&T Wireless", "sentiment": "POSITIVE", "sentiment_score": 0.9, "url": "https://www.phonearena.com/news/lenovo-thinkpad-e16-beast-save-thousand-bucks-deal-amazon_id169399", "source": "PhoneArena", "published_at": "2025-04-12T10:07:30"}, {"id": 25, "title": "Weekend reading: Great ratings, shame about the global economy", "content": "Weekend reading: Great ratings, shame about the global economy - Monevator Sign in Membership • Subscribe • Shop • Tools • Contact • Archives • About • ≡ Menu Home Earning Investing Passive investing Deaccumulation Monevation Property Compare brokers FOLLOW: Weekend reading: Great ratings, shame about the global economy by The Investor on April 12, 2025 What caught my eye this week. I read a short story when I was a teenager that unsettles me to this day. It featured an everyday American town, only everyone there was beholden to this one particular kid. Even the adults would watch what they said and did around him. To spoil the twist, it turned out the kid was born with godlike powers. The town, and the chunk of the planet it sat on, was adrift in space somewhere after he’d dislocated it from the planet. The lives of the survivors living in this bubble now revolved around the child, although they tried desperately to pretend that life was normal. Obviously the worst of it was their deity was a three-year old child, not a wise all-seeing superpower. The kid-god was insecure, arbitrary, unpredictable, spiteful, prone to deadly tantrums, and generally mentally ill-equipped for the job. I’m sure you can see where I’m going with this. Trump TV Look at a chart of the S&P 500 this week and you’ll find that US shares closed much higher. Perhaps some Panglossian observers see a good week for the markets, like the town folk in that story pretended they were living a good life . Passive purists will see more evidence to ignore the noise and keep buying . But experienced, the week was a rollercoaster ride driven by the kind of crazy plot lines and reversals you’d expect to find – not coincidentally – in a season of WWE Wrestling . We’re all degenerate meme traders now I won’t run through the ups and downs. If you care about market drama, you saw them unfold. Ditto Trump’s tariffs. If you haven’t read enough of the millions of words written by now to convince you of their sheer stupidity, this post won’t tip the balance. But for two weeks the market has given us real-time pricing on just how damaging this plank of Trump’s agenda would be. The Nasdaq and very nearly the S&P 500 plunged into a bear market, before rallying on Trump declaring a 90-day pause for most of them. Below is a daily price chart of that reaction. Remember these are multi-trillion cap indices – not illiquid meme coins – rising as much as 12% in a day: What a killer run for Trump TV , watched around the world! Personally I found it even more exciting than the one where his supporters invaded the US capital a few seasons ago. It’s much more thrilling when you’ve skin in the game. And the subplots! The pseudonymous ‘Walter Bloomberg’ X account that promoted the ‘fake’ story the tariffs would be paused for 90-days, whipsawing markets by $2.5 trillion in half an hour as it was believed and then denied! The arch-villain China slapping back with even more tariffs of its own! Then Trump apparently being inspired by Walter’s fake ‘pause’ and actually implementing a 90-day delay. Possibly only after he watched a bank boss fretting on Fox TV! This isn’t even to get into how these enormously consequential announcements are being made via Trump’s Truth Social account. Rather than, you know, the White House. Or even accusations for potential nation-scale insider trading based on Trump telling his supporters it was a good time to buy stocks, shortly before the market ripped 10% on his latest not-Tweet. Personally, I don’t think it can be insider trading when it’s done in public. But also, what a quaint thing to worry about these days… Do you even lift, bro? Perhaps my favourite bit involved all the NPCs / billionaire tech and finance bros battling on social media. Especially Trump supporter and hedge fund manager Bill Ackman, who went from warning the tariffs would cause an ‘economic nuclear winter’ one day, to praising Trump for a textbook ‘art of the deal’ later. I’m with AQR founder Cliff Asness who replied that: “For me, one of the main benefits of making some money is not having to wear a gimp suit for anybody.” But I suppose Ackman is in too deep to recant. Black Mirror Monday At the risk of sounding exactly like someone who complains that WWE Wrestling is not a real sport – and thus who piously reveals that they don’t get the joke – it’s a bit sickening to me that this entire charade has become normalised in just a few short months. Well I’m having none of it. This is not normal, and it’s not a brilliant way to shape US economic policy, let alone re-route the world. It’s mindlessly stupid. The tariffs would plunge us into a depression if implemented, whereas they only have us flirting with recession when teased and (partly) retracted. Listen, if the US wants to turn itself into an autarky run by an autocrat, go for it. I don’t believe the US public voted for that – and it would impoverish most people there, especially the poor – but that’s its (bad) business. But let’s not pretend the case for free trade wasn’t made 200 years ago. And not just in theory – the world, and especially the US, has mostly grown crazy rich on the benefits. You might as well declare you’ve doubts about the theory of steam engines. Then again, 10% of the US electorate believes the Earth is flat, so perhaps they would. In most cases for most countries at most times tariffs are bad. Trump’s sky-high tariffs for the US are idiotic, and even as a threat they will have consequences. No serious CEO will have begun to move factories to the US last weekend based on Trump’s earnest declarations that tariffs were ‘beautiful’ and here to stay and set to reinvigorate US manufacturing and all the rest. Yet the unfolding farce will still be affecting millions of decisions up and down the supply chain. To give one tiny example, the UK’s Character Group – the maker of Peppa Pig plushies – withdrew market guidance this week. As This Is Money reports: Character, which manufactures Teletubbies toys and the largest range of Peppa Pig products, told investors on Friday its ‘ability to assess the financial implications’ of tariffs has been ‘considerably obscured’ by escalating retaliatory measures. The New Malden-based group predominantly counts the UK and Scandinavia as its key markets, but US sales made up about 20% of turnover last year. The UK will face so-called ‘baseline’ tariffs of 10%, but much of Character’s manufacturing comes from China where exporters to the US now face levies of 145%. Character Group is set-up just like millions of other companies around the world that took advantage of global trade to improve production and lower prices. So we can only imagine all the similar decisions being made globally to pause output, and to suspend investment and expansion. It sums up why markets hate uncertainty. It’s not because traders are lily-livered. It’s because the economic damage is real, and just as bad un-priceable. Ah, Mr Bond Vigilantes, we’ve been expecting you There’s not point re-litigating the brutal inanity of US policy every Saturday morning. This is going to go on for years, and attention is all Trump wants anyway. But on that note perhaps the one good development this week was the potential re-emergence of the so-called bond vigilantes: We all know former real estate bankruptcy Donald Trump loves cheap debt. So maybe rising bond yields did force his hand towards a pause, rather than, say, Ackman’s whining. Of course, as Cullen Roche notes there’s a lot going on with US bonds: The 10-year interest rate ripped from 3.9% up to 4.5% in four trading sessions. As I write it’s now back to where it was nine trading sessions ago at 4.3%. So, we whipped way lower and then went way higher. Again, it’s all uncertainty. No one knows where inflation and the economy is going. If inflation rips higher then bond yields will follow. If the economy rips lower then bond yields will follow. But we’re in totally uncharted territory because we’ve never had the entire global economy at the mercy of a single unpredictable person writing Tweets sporadically. I talked to some of the largest bond traders in the world in recent days and they’re all so perplexed about it. They described it as “chaos”, “uncertainty”, “madness”. There are theories floating around about carry trade unwinds, funds imploding, China selling and just bidless markets. I suspect it’s a lot of all of these things. But the uncertainty of it all is the main issue. No one knows where any of this is headed and if you’re someone trying to lend money or set prices in the coming months then good luck guessing where you should be. Trump’s supporters don’t care less that China ultimately buying a lot less US stuff would mean it would have far less need to hold shedloads of US treasuries. Nor that unwinding China’s US debt stockpile would see US rates soar, crippling US households. Remember, this is television! Don’t get hung up on reality. The Mad King Indeed as it’s presently unfolding, US exceptionalism is getting downgraded at a speed that would embarrass a B-Movie scriptwriter. The only thing that’s different about the tariffs mayhem compared to the rest of the MAGA/Trump agenda, is it comes with real-time pricing. The damage is marked-to-market. As blogger ermine puts it , the US is rapidly transitioning from having a POTUS to having a KOTUS, at least in practice. A man whose daily utterances moves trillions in the markets. And who is checked mostly not by conventional counterbalances, but by the japes of sanctioned court jesters. Fun and games So in the spirt of the times – and since it’s all a game nowadays anyway – I asked ChatGPT for an appropriate toy: I can’t wait to play with him next time. Historians may someday look back and find something good to say about this entire episode. They turned the murderous Genghis Khan into a nation-builder, after all. Perhaps in some needlessly damaging way, this week really will eventually be seen as an idiotically-implemented check in the very-definitely authoritarian China’s rise to power, for instance. Even forest fires do some good in the long-run. It’s just your bad luck to find yourself in the middle of one. Have a great weekend. From Monevator The Slow & Steady Passive Portfolio update: Q1 2025 – Monevator Inheritance tax hacks – Monevator From the archive-ator: Volatility, inflation, and asset class returns – Monevator News Note: Some links are Google search results – in PC/desktop view click through to read the article. Try privacy/incognito mode to avoid cookies. Consider subscribing to sites you visit a lot. UK equity funds suffer worst quarter for outflows ever as clients pull billions – CityAM The homebuyers who lost thousands when their off-plan dream turned sour – BBC ‘Dire’ UK productivity falls far behind the US… – Yahoo Finance …but at least GDP surprised with a 0.5% expansion in February – CNBC Pandemic-fuelled shift to coast and country has gone into reverse – Guardian Where living standards are rising fastest in Europe [Infographic] – Visual Capitalist Increased state pension will arrive in accounts from next week – This Is Money US Justice Department scaling back crypto investigations – Washington Post via MSN The US is down but not out – Known Unknowns Products and services Cash ISA picks for 2024/2025 – Be Clever With You Cash Six things we’ve learned from a decade of pension freedoms – Which You can get up to £250 cashback when you open a SIPP with Interactive Investor . Terms and fees apply. – Interactive Investor Mortgage rates set to drop after tariff turmoil… – BBC …and more cuts could be on the way… – Which …with the gap between two- and five-year fixes now tiny – This Is Money Get up to £4,000 when you transfer your ISA to InvestEngine our link . (Minimum deposit of £100, other T&Cs apply. Capital at risk) – InvestEngine The best ways to earn and use Tesco Clubcard points – Be Clever With Your Cash Five things your estate agent is too afraid to tell you – Standard Get up to £1,500 cashback when you transfer your cash and/or investments through this link . Terms apply – Charles Stanley Should you ditch the TV licence? – Be Clever With Your Cash Skinny but spacious homes for sale, in pictures – Guardian Market movements mini-special Off the charts volatility is a sign we’re living in financial history – Sherwood Welcome to the grasslands – Fortunes & Frictions What do the market declines imply about corporate earnings? – KOI How long does it take for the market to recover? – Of Dollars and Data This is what real uncertainty looks like – Morningstar How to survive chaotic markets – A Wealth of Common Sense Comment and opinion Are equities ‘always’ better in the long run? [Search result] – FT Let them trade stocks – Best Interest Does financial literacy decrease with age? – Wharton Bear markets and bad decisions – Behavioural Investment Trump’s tariffs are a reminder to investors to diversify – UK Dividend Stocks FIRE vs meaningful retirement: choose wisely – CFA Institute What to think about when leaving a legacy to kids – Humble Dollar The four phases of retirement [Podcast] – Humans vs Retirement Rebalancing frequency mini-special Portfolio rebalancing: empty calories or free lunch? – Elm Funds How well do you understand rebalancing? – Robert’s Substack Naughty corner: Active antics The Mag 7 account for 40-50% of S&P 500 volatility – Verdad Best international stocks to own – Morningstar Venture needs to get past its ‘IPO or bust’ mentality – Institutional Investor Kindle book bargains A Man for All Markets by Edward O. Thorp – £0.99 on Kindle Million Dollar Weekend by Noah Kagan – £0.99 on Kindle Great Britain? by Torsten Bell – £1.99 on Kindle The Moneyless Man by Mark Boyle – £0.99 on Kindle Or pick up one of the all-time great investing classics – Monevator store Environmental factors Government may extent domestic energy grants to heat batteries – Guardian ‘Greenhushing’: companies hiding their environmental concerns – Grist China can win an energy war with the US – Semafor UK planning bill throws protections to wind, say nature chiefs – Guardian Experts dispute claim that dire wolf has been brought back from extinction – BBC Many US EV and battery factories are being cancelled under Trump – MSN Is legal action the only way to save the planet? – Guardian ‘Dark diversity’: the invisible threat to nature – Science Alert Robot overlord roundup Shopify looking to AI to keep its workforce lean – Sherwood Algorithms locking up US prisoners for life – Pro Publica The colours of her coat – Astral Codex Ten AI model passes Turing Test ‘better than a human’ – Independent Tariffs are kryptonite to the AI business – Axios AI-human teams and the future of work [Research] – Fork Lightning Not at the dinner table What it feels like right now – Terrible Minds All the arguments for Trump’s tariffs are wrong and bad – Noahpinion The market check – Roger Lowenstein The Trussing of Donald Trump – Drezner’s World Decision making under uncertainty – The Pursuit of Happiness I should have seen this coming – Atlantic [h/t Abnormal Returns ] Trump may have just ended globalisation as we know it – Washington Post via MSN The new right’s cult of domesticity – Emily Amick Off our beat Good example of how PR campaigns delude the online masses – Guardian The long history of Korea explained – Unchartered Territories Happy, joyous, and free – We’re Gonna Get Those Bastards The West is bored to death – The New Statesman Translated fiction is so on-trend – GQ The English neighbourhood that claims to hold the key to fixing the NHS – BBC Doing more is often easier – Raptitude Seth Godin on thinking long-term – Big Think 20 dogs sitting in a row with their leashes on the ground next to them – Zoe Mendelson US tourist takes wrong boat, ends up a Southend fan – BBC And finally… “As long as the odds are in our favor and we’re not risking the whole company on one throw of the dice or anything close to it, we don’t mind volatility in results. What we want are the favorable odds. We figure the volatility over time will take care of itself.” – Charlie Munger, Damn Right! Like these links? Subscribe to get them every Saturday. Note this article includes affiliate links, such as from Amazon and Interactive Investor . Thanks for reading! Monevator is a spiffing blog about making, saving, and investing money. Please do sign-up to get our latest posts by email for free. Find us on Twitter and Facebook . Or peruse a few of our best articles . Tweet You might also like The cautionary tale Minimum pension age increase: who’s caught out and who’s protected Financial independence – adrift in the vastness Macquarie banker caught admiring Miranda Kerr on live TV { 36 comments… add one } Maven 1 Trufflehunt April 12, 2025, 11:29 am If globalisation is over, I wonder what next for global trackers.. ? Maven 2 Azamino April 12, 2025, 11:42 am It’s an ill-wind that blows no good…. Fingers crossed that the tariffs mean less landfill fated tat being shipped around the world from China! More seriously, I’m hoping that my automated purchases (SIPP and ISA) bought some bargains at the end of last week but Christ only knows. 3 xeny April 12, 2025, 11:48 am This is related to what is going through my mind. US valuation multiples are extended, and the dollar would presumably devalue further if the US lost its global reserve status. A reduction in the dollar’s value combined with normalisation of equity valuation multiples and a fall in earnings due to a US recession would result in a very significant cumulative impact on a large fraction of a global tracker. Mogul 4 ermine April 12, 2025, 11:56 am > on a large fraction of a global tracker 64% of VWRL at last count. Wonder how often they rebalance 😉 5 xxd09 April 12, 2025, 12:08 pm Having done my homework including financial-set my Asset Allocation-am sitting tight -“enjoying “ if that’s the word -probably not!-the global reset The reckoning for Europe (incl U.K.) has been in the works for a while -our politicians/leaders didn’t seem to have been reading the runes One would have thought Scottish Independence,Brexit and a brutal Russian invasion of Ukraine etc etc would have been enough signalling that this time things were different The Americans refusing to pick up an open ended NATO defence bill is just another sign of the “times they are a changing Human generated resets of course always go to far in the opposite direction but perhaps our leaders will now up their game -recalling Parliament is a good start Probably going to to be an unsettled few months Investors should expect these ups and downs and with luck will have been well prepared xxd09 Mogul 6 ermine April 12, 2025, 12:16 pm > how often they rebalance Twice a year it would seem . The bad news is they’re only just done it in March before all this kicked off. So you’re stuck with that US overweight in your VWRL tracker. OTOH there are lots of great companies in there which are having seven bells knocked out of their over-heady valuations if you are buying VWRL, either they will roar back by September so nothing to see here, move on and you’ll get the lift. If they don’t, well you’ll lose out as this deadweight gets sold to buy less beaten up stuff in September. I’m not quite ready to sound the requiem for American business even if KOTUS has lost his marbles. If the Americans ever get a functioning democracy and government back, can they add another amendment to what remains of their Constitution that nobody over their retirement age (67 for social security) can stand for President. 7 Curlew April 12, 2025, 12:42 pm @ermine It’s not clear to me what such a rebalance would entail. Aren’t they automatically rebalanced by virtue of the change in values of the constituent companies relative to each other? So, if the collective US companies’ market capitalisation in VWRL falls 10% whilst the rest of the world only fall by, say 5% then isn’t that the rebalance (US 64% would decline to about 62.7%)? Looking at the link you provided, it says they “review” it, which I take to mean that their screening may bring new companies in and existing ones out of the index. 8 Ben Ber April 12, 2025, 12:51 pm @Curlew You are exactly right. The beauty of a world tracker is that you do not need to rebalance, except for when the smallest companies grow to become included at the very bottom of the market capitalisation. (And vice-versa of course.) 9 Paul April 12, 2025, 12:52 pm Was the story “It’s a Good Life” by Jerome Bixby? I was lucky enough to buy a pile of very old magazines from a flea market, and in it were several copies of Star Science Fiction magazine, this one being from 1953 I think. Absolute classic of the genre. 10 Hugh Tinsley April 12, 2025, 12:52 pm I remember that sci-fi short story from about 50 years ago‍. Still chilling and disturbingly apposite. Many thanks for your insights 11 ZXSpectrum48k April 12, 2025, 1:08 pm @TI. “Then again, 10% of the US electorate believes the Earth is flat, so perhaps they would.” Well, as of 2024, 37% still believe in strict creationism i.e. God created human beings in their present form at one time within the last 10,000 years or so! It think it was fairly clear it was the bond market that caused Trump to somewhat reverse course. They seemed fine with the stock market falls as long as US yields fell. Once they started to go up the shadow of Truss caused them to bottle it. The bond market was getting somewhat dysfunctional (and still is). What beggars belief, is that they think don’t seem to connect the dots. It’s like being in the orbit of the Trumpster causes any remaining logic to seep out of their ears. The balance of payments is a conservation law, an accounting identity. If you reduce a trade deficit, you increase the current account, which decreases the capital account i.e. people sell US assets. Market anticipates that. So every asset with “made in USA” sticker on gets sold. US equities, bonds, the USD etc. What did they expect? As an emerging market trader, it’s interesting to see the US trading like an EM market. It’s being run like an EM autocracy. Insane economic decisions. No rule of law. State capture and corruption. So why shouldn’t it trade like one? Mogul 12 ermine April 12, 2025, 1:17 pm @Curlew #7 I struggled to imagine the process, but I am not so sure that it’s that automatic. Let us consider the top of the current index, which has a weight of x shares of AAPL, y shares of META and so on all the way. It is reasonable to imagine tariffs have more effect on AAPL than say META, because the former deals in Stuff, to the extent of flying 600 tones of iPhones into the US from India Philosophically, what you are saying is that x and y stay the same. Apple’s extra costs will dent their profitability and share price, which will logically reduce the value of the AAPL slice. I can’t argue with that. But it does beg the question of how are x and y determined, and are these invariant with time across all 4228 elements, leaving the share price to to all the tracking? Maven 13 Ducknald Don April 12, 2025, 1:42 pm Presumably they adjust purchases and sales as people invest or draw from the fund. I don’t know if that would be enough though. 14 Curlew April 12, 2025, 2:01 pm @ermine I think it depends what you mean by “ weight of x shares… “. VWRL is market-cap weighted, so must relate to the value of the shares (assuming that there are no significant new share issues or redemptions). VWRL weights AAPL at 4.25%, META at 1.80% at 28 Feb 2025. Let’s assume it’s that at close of business yesterday (it won’t be, of course). Then, if today the share price of AAPL falls 10% for the reasons you cite, and META only falls 2%, then if all other companies remained the same price (they won’t, of course), then the index would recalibrate, leaving AAPL at 3.84% and META at 1.77%. And the VWRL share price would have fallen by 0.46%. Assuming I’ve got the maths right. 🙂 @Ducknald Don Yes, I think the market makers can create/destroy ETFs units and I assume the open-ended fund managers the number of units in existence to keep the market price in line with the NAV/market cap. Investment trusts are closed so the number of units remains the same (usually), hence why they have premium and discounts, if I’ve understood correctly. Presumably with ITs, the premium could be eradicated by issuing new shares, or a discount eroded by share buyback (and destruction). 15 Lawkon April 12, 2025, 2:13 pm I came across a very good article recently. Written by an ex- OpenAI employee, a blogger and some super forecasters to estimate what 2027 would look like http://ai-2027.com/ . Their article they wrote in 2021 to predict the next 5 years of ai developments was very accurate. This newest one is genuinely very concerning. 16 Hospitaller April 12, 2025, 2:29 pm So far, while not happy, I am okay with the effect on my portfolio to date. I popped some of my dry powder into equities after the second bad day but have kept a chunk back in case of further declines. The latter are quite likely in my view judging from history; savage declines followed by a dead cat bounce – followed over the coming weeks by further equities declines? What I am uncertain about is whether the world as we knew it has changed for ever. Serious diversification seems the only remedy and even that may only provide limited relief. The way US treasuries have behaved is rather alarming, going the opposite way eventually to what would usually be expected. I am glad I set a cap on my US equities exposure years ago. The American approach to equities buying seems more like betting than investing; the outsized bounce after Trump delayed tariffs was all too predictable. They seem a very odd nation. Mogul 17 Tom-Baker Dr Who April 12, 2025, 2:38 pm As I wrote last weekend, the odd lack of US Dollar appreciation when the stock market was tanking really caught my eye, and I was really concerned about the US treasury bond market. I’m relieved that I got out right away then, well before the sell off that forced the 90-day pause in the mad tariffs. I sold all my 1-3y treasury etf units when they were still in profit and bought an ultrashort sterling investment grade bond etf with a much higher yield and shorter maturity. We’re on holiday in New York City now and have the impression that his popularity here is tanking really fast. 18 Onedrew April 12, 2025, 2:40 pm @Tom Baker: Which ultrashort sterling investment grade bond etf did you use? Mogul 19 Tom-Baker Dr Who April 12, 2025, 2:52 pm @Onedrew- the iShares one: ERNS 20 Onedrew April 12, 2025, 3:05 pm @Tom Baker: thanks. I have been hoping for an ultra-short gilts etf and my hopes were momentarily raised. I am chary about bonds in businesses however triple-A although I keep some dry powder in swaps-based CSH2 despite the fact that its top ten holdings for collateral match the summit of the Nasdaq 100. Mogul 21 Algernond April 12, 2025, 3:07 pm “….after he watched a bank boss fretting on Fox TV!” Jamie Dimon isn’t your average bank boss is he…. Mogul 22 Algernond April 12, 2025, 3:18 pm @Onedrew – Oh dear. I have a lot of CSH2. But also ERNS – maybe that is ‘safer’ because it actually does consist of ultra short-term bonds.. ? 23 Rob April 12, 2025, 3:21 pm Feels pretty early days in all this activity. Feels Trump is probably right on the symptoms but very very wrong on the cure. Likelihood is that US budget deficits now balloon with tariffs adding fuel rather than water. All while the lack of stability in the dollar has been blowing up trading books. But the debt position (symptoms) looks bad and the tariffs move ultimately feels a badly thought through attempt to fix this. DOGE savings are also somewhat less than Elon promised (he does tend to overestimate by a few orders of magnitude). Overall the US feels toxic but realistically is still priced as a stable exceptional best of class market and still up over 12 months. Europe does feel better and UK is moving towards 4% dividends plus large buybacks but is down over 12 months and has shed all its gains. It’s been a blowout across all assets but it’s hard to say tariffs are priced in correctly comparing moves, more a straight dump. Individual stocks might even bounce up on news of tariff exemptions despite a bad backdrop. So feels early days, but the world index allocation feels a higher risk position after price movements. Probably more big moves to come but there are definitely high yielding assets at the moment without the same exposures as US. Overall the entire financial world seems to have become broken in terms of an ability to value assets and damaged by FOMO and meme trading. The dollar probably does need to weaken really to help support the debt burden but this was probably the time when an experienced hand at the tiller was needed in the US not a clown . 24 Brod April 12, 2025, 3:52 pm Well, like a good passivista I did nothing. I luxuriated in my inability to predict markets. I was serene in accepting what the market was giving me. And I definitely wasn’t wearing out my F5 key in real time… Anyway, I’m less than 25% global equities so say 10% drop of 60% of 25% is manageable. Isn’t it? And I didn’t have a clue what to do anyways. Yeah my income producing ISA has taken a hit too. But I think the dividends will be unaffected which is what I’m interested in. Gold up, lots of cash. BHMG, my insurance, seemed to move positively but was that cause or correlation? I dunno. 25 xeny April 12, 2025, 4:16 pm @ermine >Wonder how often they rebalance I’m not so much thinking about them rebalancing as if it is smart to preemptively move from holding vwrl to holding a set of assets that resembles vwrl after the value of the US component has fallen by say 50% (cumulative effect of a 20% fall in each of earnings, earning multiplier and value of dollar, all of which seem very plausible, is 0.8^3 ~=0.5). Previously when the US market fell, the impact for international investors was attenuated by an opposing increase in the value of the dollar. If it starts being amplified by the dollar weakening, it will be more noticeable. 26 Onedrew April 12, 2025, 4:22 pm @Algernond: I hold CSH2 purely for quick conversion to cash to buy on the dips, which has been useful this week. The rest of the cash is shared between the Fidelity, Vanguard and Royal London money market funds. RL is marginally the best performer of the lot. I will of course dump them if a better alternative for my next-few-years hoard should appear. Maven 27 Ducknald Don April 12, 2025, 4:51 pm It seems exemptions are coming now, they include smartphones, PCs, servers, and other technology goods. Mogul 28 ermine April 12, 2025, 6:20 pm > they include smartphones, PCs, servers, and other technology goods Some of those tech bros must’ve whispered in Tariff Trump’s shell-like that all the computing iron is made in China including the stuff for the AI singularity wet dreams perhaps 😉 As for the iPhones, panem et circenses So it’ll all be back to normal on Monday, eh? Mogul 29 Delta Hedge April 12, 2025, 6:31 pm *If* Administration tariff policies of 2nd-9th April are fully implemented (post pause): High confidence: Volatility >>> Med con: Long UST term premium >> (and price <) & USD < (against basket); Uncertain: RoW Equities & Bonds / rates, Gold, Commodo, Crypto, REITs & Infra My take's therefore: Long vol. And here's DS' take: https://open.substack.com/pub/davidstevenson/p/time-to-dig-out-those-tin-hats-4f1 30 ZXSpectrum48k April 12, 2025, 9:26 pm Functionally, the US and China now have a trade embargo. The tariffs are so large that nothing really can be traded. That is not a major problem right now, since US corps did inventory accumulation into “Liberation Day”. Nonetheless, 60-90 days from now, many of those inventories will be depleted. The Trumpster administration are so dumb, they are only just realizing the disaster this would be. There is simply no way to replace those supply chains in any sensible time period. So expect many more exemptions as they start to uncover the impact of the embargo. The US is going to find itself back in the Prohibition period. Want a new item? Pay $1,500 in the US, or skip over the border to Canada and get it for $750. The amount of smuggling will be insane. Plenty more room for corruption. I think the real question is who is the fall guy for this mess. The Trumpster never takes the blame and his MAGA fanbase, who are as dumb as rocks, will believe whoever he blames. My money is that he’s going to try to pin this on Powell, the Fed Chair. In most EM autocracies, an independent central bank cannot be tolerated by the autocrat. If he fires Powell (and he’s lining up the courts to allow him to do this) and puts in his own stooge in to cut rates, then the US has gone full EM banana republic. The markets will make the last two weeks look like a minor blip. Mogul 31 Delta Hedge April 12, 2025, 11:15 pm Shareholders in the firms of Trump’s technogarchy /industrial enablers are viscerally discovering a realisation Greenspan had in 2008: “I made a mistake in presuming..the self-interest of organisations..were such that they were best capable of protecting their own shareholders and their equity in the firms.” ‘PayPal mafia’ of Musk and Thiel thought they were acting in their shareholders’ rational self interest in backing Trump 2.0. Germany’s industrialists made a similar mistake in the 30s. Autocracy rarely ends well, for anyone. @ZX #30: if (big if) it looks as though Trump is going to go full on Peron, and sacks Powell, then I guess those with access to HFs turn to likes of Universa / Spitznagel (or otherwise to IVOL, VIXY or VXX). For UCITS constrained mortals like myself – unable to access either HFs or (FAPP) US ETFs – maybe it would mean loading up on SGLN and/or GDX and Winton and/or BHMG. 32 dearieme April 13, 2025, 1:23 am Typo: Cash ISA picks for 2025/26 Maven 33 Prospector April 13, 2025, 7:29 am @ermine/@Curlew/@Ben Ber (#6,#7#8) For market cap weighted index trackers the “obvious” rebalances are when index constituents change . Eg following merger, company going private or new IPO. And at very bottom end (in terms of weights) when something gets too small to be in the index and gets ejected or vice versa. The less obvious need for rebalances comes because the indices being tracked are price return and there will be dividends that will need to be reinvested. I was also wondering if rebalances are needed if the exchange rates change. Eg if index has 4% AAPL and 1% NESN what happens if dollar loses 25%. My initial reaction was portfolio now needs a greater weight of NESN. But I think as long as the index is defined in equivalent currency terms then the weights will shift accordingly. Except at the margins eg more US companies end up “too small” and some other non-USD names will leap frog them in. On the subject of rebalancing interesting the two pieces on rebalancing portfolio weights focused on accumulation. I’d be interested whether rebalances make more difference in deaccumulation when considered alongside sequence of return risk. Feels like an area worthy of research. Mogul 34 Hariseldon April 13, 2025, 8:21 am Long inflation index linked bonds continue to get cheaper , interesting when the possibility of stagflation is mooted ? 2 ¾ % plus inflation in US and 2 ⅛ % plus inflation on uk linkers at the very long end. Volatile prices comes with the duration but certainly interesting … 35 Brod April 13, 2025, 8:42 am Well, like a good passivista I did nothing. I luxuriated in my inability to predict markets. I was serene in accepting what the market was giving me. And I definitely, absolutely wasn’t wearing out my F5 key in real time… Anyway, I’m less than 25% global equities so say 10% drop of 60% of 25% is manageable. Isn’t it? And I didn’t have a clue what to do anyways. Yeah my income producing ISA has taken a hit too. But I think the dividends will be unaffected which is what I’m interested in. Gold up, lots of cash. BHMG, my insurance, seemed to move positively but was that cause or correlation? I dunno. Fingers crossed Mogul 36 Nearly There April 13, 2025, 8:53 am @ermine#6 This is a guess, but for the broader indexes, funds normally hold only a *sample* of the index they aim to track. That will lead to sampling errors, which may need to be addressed. Imagine the absurd case where the US portion of the fund was represented by a random sample of only 7 stocks that just happened to be the Magnificent 7. That sample isn’t a great representation of the whole of the US market, so the value of the sample would drift away from the thing it is meant to represent. Rebalancing would correct that drift. Of course, the sample sizes are likely to be far larger for the more significant parts of the index. That gives a greater chance of the under-performers and over-performers that are over- and under-represented in the sample to roughly balance out, making the sample more representative in the places where it matters most. And the Heard and McDonald Islands probably aren’t in the sample at all. The sample *will* drift if over-represents or under-represents, say, a 100-bagger. The only times it won’t drift at all is: – if everything is held in precisely the right proportion: sample size is 100% so it isn’t sampling, or – if the errors miraculously completely cancel eachother out every day for eternity, or – it tweaks the sample ratios to correct the drift (rebalancing). Presumably the frequency of rebalancing is chosen to minimise costs whilst maintaining a sufficiently small drift from the objective. LifeStrategy funds rebalance daily to keep the equity:bond ratio tightly controlled. Cancel reply Leave a Comment Name * Email * Website Comment Notify me of followup comments via e-mail. You can also subscribe without commenting. Δ Previous post: Inheritance tax hacks Search for: Search Button The Latest Articles Weekend reading: Great ratings, shame about the global economy Inheritance tax hacks The Slow and Steady passive portfolio update: Q1 2025 Essential Reading Bear markets: how long they last and how to invest during one Investing for beginners: Why do we invest? How did Warren Buffett get rich? Better Investing The seven habits of highly successful private investors How to create a simple retirement plan How to create your own cheap, simple and secure Guaranteed Equity Bond Property Posts FIRE in the hole [Members] The decline and fall of a buy-to-let empire What is a mortgage but money rented from a bank? Get Money Motivated The really obvious thing we all forget when borrowing money If you want to make easy money, do something hard How to check your credit score for free in the UK Monevator is a place for my thoughts on money and investing. Read our disclaimer . Subscribe to get all our free posts via email . Follow us on Twitter , Facebook , or via RSS . You can also send us a message . Copyright © 2007-2025 Monevator . All rights reserved. Disclaimer: All content is for informational purposes only. I make no representations as to the accuracy, completeness, suitability or validity of any information on this site and will not be liable for any errors or omissions or any damages arising from its display or use. Full disclaimer and privacy policy . This site uses cookies and features affiliate links.", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://monevator.com/weekend-reading-great-ratings-shame-about-the-global-economy/", "source": "Monevator.com", "published_at": "2025-04-12T10:06:01"}, {"id": 26, "title": "50-Oz Stanley Ice Flow Aerolight 50-Ounce Transit Bottle (Orange or Light Green) $24 & More at Nordstrom Rack + Free Shipping on $89+ (0 replies)", "content": "50-Oz Stanley Ice Flow Aerolight 50-Ounce Transit Bottle (Orange or Light Green) $24 & More at Nordstrom Rack + Free Shipping on $89+ 50-Oz Stanley Ice Flow Aerolight 50-Ounce Transit Bottle (Orange or Light Green) $24 & More at Nordstrom Rack + Free Shipping on $89+ $24 $55 56% off Help the community know if this is a good deal. 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Nordstrom Rack Slickdeals Forums Hot Deals forum thread Posted by Rokket | Staff • Yesterday Apr 12, 2025 10:04 AM Item 1 of 3 Item 1 of 3 forum thread Posted by Rokket | Staff • Yesterday Apr 12, 2025 10:04 AM 50-Oz Stanley Ice Flow Aerolight 50-Ounce Transit Bottle (Orange or Light Green) $24 & More at Nordstrom Rack + Free Shipping on $89+ $24 $55 56% off Nordstrom Rack 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 Comments 2,150 Views Get Deal at Nordstrom Rack Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Save Share Deal Details Nordstrom Rack [ nordstromrack.com ] has the 50-Oz Stanley Ice Flow Aerolight 50-Ounce Transit Bottle (Orange or Light Green) on sale for $23.98 . Shipping is free on $89+ orders. Compare to Amazon [ amazon.com ] at $55 . More Stanley on sale: Classic Camp Mug Gift Box [ nordstromrack.com ] $20.98 36-Oz Ice Flow Aerolight Transit Bottle [ nordstromrack.com ] (Green or Light Green) $20.98 Product Info Product Description: Details & care Double-wall vacuum insulation keeps drinks cold for hours in this BPA-free recycled stainless steel bottle that holds a full 50 ounces for fewer refills. What it does: A steel-lined insulated lid locks to create a leakproof design. An easy-pour mouth allows for quick filling, sharing, and cleaning. Additional features: The comfort grip handle makes carrying a breeze, and a flat base means extra stability. Sizing information: Holds 50 oz. Holds 50 oz. Recycled 18/8 stainless steel BPA-free Dishwasher safe Imported Item #10527942 Product SKU: nordstromrack_8024305 Community Notes This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make informed decisions. Add Entry About the Poster Rokket | Staff Joined in Jun 2011 Follow Give Rep Message 18,362 Deal Posts 39,143 Comments Posts 135,251 Reputation Points 20,571 Votes Submitted Deal Details Product Info Community Notes About the Poster Nordstrom Rack [ nordstromrack.com ] has the 50-Oz Stanley Ice Flow Aerolight 50-Ounce Transit Bottle (Orange or Light Green) on sale for $23.98 . Shipping is free on $89+ orders. Compare to Amazon [ amazon.com ] at $55 . More Stanley on sale: Classic Camp Mug Gift Box [ nordstromrack.com ] $20.98 36-Oz Ice Flow Aerolight Transit Bottle [ nordstromrack.com ] (Green or Light Green) $20.98 Deal Score +5 Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Nordstrom Rack Leave a Comment To participate in the comments, please log in. Log In Sign Up 0 Comments Oldest Be the first to comment. Related Searches Sporting Goods Water Bottles Stanley Amazon Nordstrom Rack $7.99 $13 38% off Fiskars Ergonomic Cast-Aluminum Garden Weeder Tool w/ SoftGrip & Hang Hole $7.99 + Free Shipping w/ Prime or on $35+ 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $75 $125 40% off Greenworks 40V 12\" String Trimmer w/ 2.0 Ah Battery & Charger $75.18 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $59 $129 54% off RYOBI ONE+ 18V Cordless 1/4 Sheet Sander with FREE ONE+ 18V 2.0 Ah Lithium-Ion Battery $59 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $2.24 $4.48 50% off 1-Cu Ft Sta-Green In-Ground Vegetable & Flower Garden Soil $2.24 + Free Store Pickup at Lowes 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $15 $20 25% off $14.99: Carhartt Women's Loose Fit Heavyweight Short-Sleeve Pocket T-Shirt at Amazon 8 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $1,350 CyberPowerPC Gamer Supreme Gaming Desktop – Intel Core Ultra 7 265F - Arc B580 – Windows 11 - $1349.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 8 $2.17 $2.99 27% off $2.17: 12-Oz MoonPie Marshmallow Sandwich Minis Chocolate at Amazon 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $270 $300 10% off $269.99: 128GB Meta Quest 3S VR Headset + Batman: Arkham Shadow + 3-Month Trial of Meta Quest+ at Amazon 3 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $200 $300 33% off Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black $199.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 7 $1,999 $2,799 28% off Gibson Les Paul Standard 50' and '60s Figured Top - '60s Cherry ($1999) 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 6 Feedback", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slickdeals.net/f/18246286-50-oz-stanley-ice-flow-aerolight-50-ounce-transit-bottle-orange-or-light-green-24-more-at-nordstrom-rack-free-shipping-on-89", "source": "Slickdeals.net", "published_at": "2025-04-12T10:04:36"}, {"id": 27, "title": "T-fal Easy Fry XXL 5.9Qt. Air Fryer & Grill Combo + Free Shipping w/ Prime $27.99 (0 replies)", "content": "T-fal Easy Fry XXL 5.9Qt. Air Fryer & Grill Combo + Free Shipping w/ Prime $27.99 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo $28 $150 81% off Help the community know if this is a good deal. 19 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Woot! Slickdeals Forums Hot Deals frontpage Posted by BabyBubba • Yesterday Apr 12, 2025 10:02 AM Item 1 of 2 Item 1 of 2 frontpage Posted by BabyBubba • Yesterday Apr 12, 2025 10:02 AM 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo + Free S/H for Prime Members $28 $150 81% off Woot! 19 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 12 Comments 10,462 Views Get Deal at Woot! Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Save Share Deal Details Woot has 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo on sale for $27.99 . Shipping is free for Amazon Prime Members (must login with your Amazon account and select a shipping address in order for Woot to apply free shipping) or is otherwise $6 per order. Thanks Community Member BabyBubba for sharing this deal Features : Excess fat & grease collects beneath the cooking plate for easy separation & cleanup. Just pop in your food, select the time & temperature and walk away. Easily select programs designed for fries, chops, shrimp, pizza, grilled burgers, fish, chicken, and cake. Air fry up to 3 lbs of fresh-cut fries, grill 4 quarter-pound patties, or roast up to a 5-lb chicken. Editor's Notes Written by oceanlake | Staff About this Offer : Our research indicates that this deal is $64.04 less ( 69.58 % savings ) than the next best available price from a reputable merchant with prices starting from $92 at the time of this posting. Reviews : This Air Fryer receives 4.5 Stars out of 5 Stars based on over 600 Customer Reviews. Warranty : Includes 90 Day Woot Limited Warranty Refer to Woot Return Policy About Amazon Prime : Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Original Post Written by BabyBubba Community Notes This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make informed decisions. Add Entry About the Poster BabyBubba Joined in Apr 2021 Follow Give Rep Message 872 Deal Posts 3,564 Comments Posts 5,937 Reputation Points 196 Votes Submitted Deal Details Community Notes About the Poster Woot has 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo on sale for $27.99 . Shipping is free for Amazon Prime Members (must login with your Amazon account and select a shipping address in order for Woot to apply free shipping) or is otherwise $6 per order. Thanks Community Member BabyBubba for sharing this deal Features : Excess fat & grease collects beneath the cooking plate for easy separation & cleanup. Just pop in your food, select the time & temperature and walk away. Easily select programs designed for fries, chops, shrimp, pizza, grilled burgers, fish, chicken, and cake. Air fry up to 3 lbs of fresh-cut fries, grill 4 quarter-pound patties, or roast up to a 5-lb chicken. Editor's Notes Written by oceanlake | Staff About this Offer : Our research indicates that this deal is $64.04 less ( 69.58 % savings ) than the next best available price from a reputable merchant with prices starting from $92 at the time of this posting. Reviews : This Air Fryer receives 4.5 Stars out of 5 Stars based on over 600 Customer Reviews. Warranty : Includes 90 Day Woot Limited Warranty Refer to Woot Return Policy About Amazon Prime : Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Original Post Written by BabyBubba Deal Score +19 Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Woot! Leave a Comment To participate in the comments, please log in. Log In Sign Up 12 Comments Oldest Sign up for a Slickdeals account to remove this ad. Cinnamon_Wilson Yesterday Apr 12, 2025 5:20 PM 205 Posts Joined Jan 2017 Yesterday Apr 12, 2025 5:20 PM Cinnamon_Wilson Yesterday Apr 12, 2025 5:20 PM 205 Posts I just repaired my Cuisinart TOA-60 mode selector switch last month but if I hadn't I'd jump on one of these. Good gift idea for a young person starting out too. Good post. Repped. 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link AmusedDime497 Yesterday Apr 12, 2025 6:09 PM 4,828 Posts Joined May 2022 This comment has been rated as unhelpful by Slickdeals users. Show Comment AmusedDime497 Yesterday Apr 12, 2025 6:11 PM 4,828 Posts Joined May 2022 Yesterday Apr 12, 2025 6:11 PM AmusedDime497 Yesterday Apr 12, 2025 6:11 PM 4,828 Posts I like this bullet point : \"Cooking of 1.2 kg of fresh fries at 55% weight loss with 15 ml of oil vs traditional deep fryer with 2L\" 😄😄 What??? let me do the math for you : using 3 POUNDS of potatoes and ONE tablespoon of oil will help you lose 55% 2 2 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply BabyBubba Original Poster Pro Yesterday Apr 12, 2025 6:57 PM 3,564 Posts Joined Apr 2021 Yesterday Apr 12, 2025 6:57 PM BabyBubba Original Poster Pro Yesterday Apr 12, 2025 6:57 PM 3,564 Posts Quote from AmusedDime497 : I like this bullet point :\"Cooking of 1.2 kg of fresh fries at 55% weight loss with 15 ml of oil vs traditional deep fryer with 2L\"😄😄 What???let me do the math for you :using 3 POUNDS of potatoes and ONE tablespoon of oil will help you lose 55% T-fal probably should have just left that part out about the oil; I can see it being very confusing to a new user. My air fryer often renders oil from what I cook, but I've never used cooking oil with it. Frozen seasoned fries go in frozen and 12 minutes later they're delicious. An air fryer would be more accurately named a convection roaster. I'm super pleased with the way it cooks and the results with lots of different foods. The \"set it and forget it\" is an especially convenient feature. It's even replaced my microwave oven as my most used small kitchen appliance. Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply ArseneWenger Yesterday Apr 12, 2025 8:48 PM 2,943 Posts Joined Feb 2011 Yesterday Apr 12, 2025 8:48 PM ArseneWenger Yesterday Apr 12, 2025 8:48 PM 2,943 Posts I read all the reviews where people \"came back\" to update after their initial review. This seems to last between 1-2 years. It's a good price and honestly even my Ninja only really lasted 2 years but keep that in mind if you like things that last. 4 Like Like Helpful Funny Not helpful Reply Copy Comment Link rh71 Yesterday Apr 12, 2025 9:05 PM 428 Posts Joined Jun 2014 Yesterday Apr 12, 2025 9:05 PM rh71 Yesterday Apr 12, 2025 9:05 PM 428 Posts Quote from BabyBubba : T-fal probably should have just left that part out about the oil; I can see it being very confusing to a new user. My air fryer often renders oil from what I cook, but I've never used cooking oil with it. Frozen seasoned fries go in frozen and 12 minutes later they're delicious. An air fryer would be more accurately named a convection roaster. I'm super pleased with the way it cooks and the results with lots of different foods. The \"set it and forget it\" is an especially convenient feature. It's even replaced my microwave oven as my most used small kitchen appliance. We have had a tabletop convection oven for years and now wondering if there's any benefit to an air fryer over that. Coincidentally did frozen fries last night and 20 minutes later they came out great. Is it just a time thing? Like Like Helpful Funny Not helpful Reply Copy Comment Link 2 Replies whoopdaddy Yesterday Apr 12, 2025 9:22 PM 822 Posts Joined Dec 2009 Yesterday Apr 12, 2025 9:22 PM whoopdaddy Yesterday Apr 12, 2025 9:22 PM 822 Posts Many reviews like this one(dies after 1 year): \"We got this as a gift from my sister Christmas of 2022. It was very impressive and useful. We haven't enjoyed our airfryer this much especially that this has the largest capacity/volume of them all. I can even cook an entire chicken or reheat a rotisserie chicken. The controls are moody but the most frequently used ones work just fine. It was easy to clean. Then just yesterday, February 26, 2024, it just plummeted from appearing not able to warm up our food enough when it usually did before and then afterwards, it just died suddenly while I was reheating food. No power and even the power button that lights up when you plug the cord was gone. Tried to move to other outlets that work and nope-- still doesn't work. Read a lot of reviews on the internet and Amazon and interestingly, a number had the same problem just with varying time, but most consistently after 1 year. So our best airfyer ever turned out tragically as the most shortlived one too. I feel bad to give it just 2 stars when it surely could have been 5 stars. But a shortlived airfryer no matter how excellent it was could not be pleasing to anyone who buys it.\" 1 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link Sign up for a Slickdeals account to remove this ad. BabyBubba Original Poster Pro Yesterday Apr 12, 2025 9:56 PM 3,564 Posts Joined Apr 2021 Yesterday Apr 12, 2025 9:56 PM BabyBubba Original Poster Pro Yesterday Apr 12, 2025 9:56 PM 3,564 Posts Quote from rh71 : We have had a tabletop convection oven for years and now wondering if there's any benefit to an air fryer over that. Coincidentally did frozen fries last night and 20 minutes later they came out great. Is it just a time thing? I have both, an air fryer and a microwave/convection oven combo. The air fryer is much faster, browns better, and is more efficient when cooking for one person. Seems to sear in juices better as well. I don't use my convection oven that much since having the choice, although it still gets used for brownies, cornbread, etc. I'm amazed at the versatility of the air fryer; it does everything well. 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link Santa_Claus 9h ago Apr 13, 2025 1:08 AM 9,425 Posts Joined Sep 2007 9h ago Apr 13, 2025 1:08 AM Santa_Claus 9h ago Apr 13, 2025 1:08 AM 9,425 Posts Um this is a good deal? 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply BabyBubba Original Poster Pro 7h ago Apr 13, 2025 2:13 AM 3,564 Posts Joined Apr 2021 7h ago Apr 13, 2025 2:13 AM BabyBubba Original Poster Pro 7h ago Apr 13, 2025 2:13 AM 3,564 Posts Quote from Santa_Claus : Um this is a good deal? Um with a retail price of $149.99 and a price on Amazon of $92.03, you be the judge. Do some research instead of asking a pointless question. Like Like Helpful Funny Not helpful Reply Copy Comment Link jaspr180 6h ago Apr 13, 2025 3:27 AM 980 Posts Joined Mar 2005 6h ago Apr 13, 2025 3:27 AM jaspr180 6h ago Apr 13, 2025 3:27 AM 980 Posts Quote from rh71 : We have had a tabletop convection oven for years and now wondering if there's any benefit to an air fryer over that. Coincidentally did frozen fries last night and 20 minutes later they came out great. Is it just a time thing? I believe the rounded design to these bowls allows air to circulate far better leading to not just faster cooking but dryer and crunchier surfaces of stuff like fries. No idea for this brand or design but my vortex works very well and very fast. Like Like Helpful Funny Not helpful Reply Copy Comment Link Related Searches Home & Home Improvement Small Appliances Air Fryers & Deep Fryers Online Only T-fal Woot! $7.99 $13 38% off Fiskars Ergonomic Cast-Aluminum Garden Weeder Tool w/ SoftGrip & Hang Hole $7.99 + Free Shipping w/ Prime or on $35+ 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $75 $125 40% off Greenworks 40V 12\" String Trimmer w/ 2.0 Ah Battery & Charger $75.18 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $59 $129 54% off RYOBI ONE+ 18V Cordless 1/4 Sheet Sander with FREE ONE+ 18V 2.0 Ah Lithium-Ion Battery $59 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $2.24 $4.48 50% off 1-Cu Ft Sta-Green In-Ground Vegetable & Flower Garden Soil $2.24 + Free Store Pickup at Lowes 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $15 $20 25% off $14.99: Carhartt Women's Loose Fit Heavyweight Short-Sleeve Pocket T-Shirt at Amazon 8 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $1,350 CyberPowerPC Gamer Supreme Gaming Desktop – Intel Core Ultra 7 265F - Arc B580 – Windows 11 - $1349.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 8 $2.17 $2.99 27% off $2.17: 12-Oz MoonPie Marshmallow Sandwich Minis Chocolate at Amazon 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $270 $300 10% off $269.99: 128GB Meta Quest 3S VR Headset + Batman: Arkham Shadow + 3-Month Trial of Meta Quest+ at Amazon 3 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $200 $300 33% off Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black $199.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 7 $1,999 $2,799 28% off Gibson Les Paul Standard 50' and '60s Figured Top - '60s Cherry ($1999) 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 6 Feedback", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slickdeals.net/f/18246283-t-fal-easy-fry-xxl-5-9qt-air-fryer-grill-combo-free-shipping-w-prime-27-99", "source": "Slickdeals.net", "published_at": "2025-04-12T10:02:55"}, {"id": 28, "title": "T-fal Easy Fry XXL 5.9Qt. Air Fryer & Grill Combo + Free Shipping w/ Prime $27.99", "content": "T-fal Easy Fry XXL 5.9Qt. Air Fryer & Grill Combo + Free Shipping w/ Prime $27.99 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo $28 $150 81% off Help the community know if this is a good deal. 19 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Woot! Slickdeals Forums Hot Deals frontpage Posted by BabyBubba • Yesterday Apr 12, 2025 10:02 AM Item 1 of 2 Item 1 of 2 frontpage Posted by BabyBubba • Yesterday Apr 12, 2025 10:02 AM 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo + Free S/H for Prime Members $28 $150 81% off Woot! 19 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 12 Comments 10,462 Views Get Deal at Woot! Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Save Share Deal Details Woot has 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo on sale for $27.99 . Shipping is free for Amazon Prime Members (must login with your Amazon account and select a shipping address in order for Woot to apply free shipping) or is otherwise $6 per order. Thanks Community Member BabyBubba for sharing this deal Features : Excess fat & grease collects beneath the cooking plate for easy separation & cleanup. Just pop in your food, select the time & temperature and walk away. Easily select programs designed for fries, chops, shrimp, pizza, grilled burgers, fish, chicken, and cake. Air fry up to 3 lbs of fresh-cut fries, grill 4 quarter-pound patties, or roast up to a 5-lb chicken. Editor's Notes Written by oceanlake | Staff About this Offer : Our research indicates that this deal is $64.04 less ( 69.58 % savings ) than the next best available price from a reputable merchant with prices starting from $92 at the time of this posting. Reviews : This Air Fryer receives 4.5 Stars out of 5 Stars based on over 600 Customer Reviews. Warranty : Includes 90 Day Woot Limited Warranty Refer to Woot Return Policy About Amazon Prime : Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Original Post Written by BabyBubba Community Notes This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make informed decisions. Add Entry About the Poster BabyBubba Joined in Apr 2021 Follow Give Rep Message 872 Deal Posts 3,564 Comments Posts 5,937 Reputation Points 196 Votes Submitted Deal Details Community Notes About the Poster Woot has 5.9-Quart T-fal Easy Fry XXL Air Fryer & Grill Combo on sale for $27.99 . Shipping is free for Amazon Prime Members (must login with your Amazon account and select a shipping address in order for Woot to apply free shipping) or is otherwise $6 per order. Thanks Community Member BabyBubba for sharing this deal Features : Excess fat & grease collects beneath the cooking plate for easy separation & cleanup. Just pop in your food, select the time & temperature and walk away. Easily select programs designed for fries, chops, shrimp, pizza, grilled burgers, fish, chicken, and cake. Air fry up to 3 lbs of fresh-cut fries, grill 4 quarter-pound patties, or roast up to a 5-lb chicken. Editor's Notes Written by oceanlake | Staff About this Offer : Our research indicates that this deal is $64.04 less ( 69.58 % savings ) than the next best available price from a reputable merchant with prices starting from $92 at the time of this posting. Reviews : This Air Fryer receives 4.5 Stars out of 5 Stars based on over 600 Customer Reviews. Warranty : Includes 90 Day Woot Limited Warranty Refer to Woot Return Policy About Amazon Prime : Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Original Post Written by BabyBubba Deal Score +19 Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Woot! Leave a Comment To participate in the comments, please log in. Log In Sign Up 12 Comments Oldest Sign up for a Slickdeals account to remove this ad. Cinnamon_Wilson Yesterday Apr 12, 2025 5:20 PM 205 Posts Joined Jan 2017 Yesterday Apr 12, 2025 5:20 PM Cinnamon_Wilson Yesterday Apr 12, 2025 5:20 PM 205 Posts I just repaired my Cuisinart TOA-60 mode selector switch last month but if I hadn't I'd jump on one of these. Good gift idea for a young person starting out too. Good post. Repped. 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link AmusedDime497 Yesterday Apr 12, 2025 6:09 PM 4,828 Posts Joined May 2022 This comment has been rated as unhelpful by Slickdeals users. Show Comment AmusedDime497 Yesterday Apr 12, 2025 6:11 PM 4,828 Posts Joined May 2022 Yesterday Apr 12, 2025 6:11 PM AmusedDime497 Yesterday Apr 12, 2025 6:11 PM 4,828 Posts I like this bullet point : \"Cooking of 1.2 kg of fresh fries at 55% weight loss with 15 ml of oil vs traditional deep fryer with 2L\" 😄😄 What??? let me do the math for you : using 3 POUNDS of potatoes and ONE tablespoon of oil will help you lose 55% 2 2 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply BabyBubba Original Poster Pro Yesterday Apr 12, 2025 6:57 PM 3,564 Posts Joined Apr 2021 Yesterday Apr 12, 2025 6:57 PM BabyBubba Original Poster Pro Yesterday Apr 12, 2025 6:57 PM 3,564 Posts Quote from AmusedDime497 : I like this bullet point :\"Cooking of 1.2 kg of fresh fries at 55% weight loss with 15 ml of oil vs traditional deep fryer with 2L\"😄😄 What???let me do the math for you :using 3 POUNDS of potatoes and ONE tablespoon of oil will help you lose 55% T-fal probably should have just left that part out about the oil; I can see it being very confusing to a new user. My air fryer often renders oil from what I cook, but I've never used cooking oil with it. Frozen seasoned fries go in frozen and 12 minutes later they're delicious. An air fryer would be more accurately named a convection roaster. I'm super pleased with the way it cooks and the results with lots of different foods. The \"set it and forget it\" is an especially convenient feature. It's even replaced my microwave oven as my most used small kitchen appliance. Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply ArseneWenger Yesterday Apr 12, 2025 8:48 PM 2,943 Posts Joined Feb 2011 Yesterday Apr 12, 2025 8:48 PM ArseneWenger Yesterday Apr 12, 2025 8:48 PM 2,943 Posts I read all the reviews where people \"came back\" to update after their initial review. This seems to last between 1-2 years. It's a good price and honestly even my Ninja only really lasted 2 years but keep that in mind if you like things that last. 4 Like Like Helpful Funny Not helpful Reply Copy Comment Link rh71 Yesterday Apr 12, 2025 9:05 PM 428 Posts Joined Jun 2014 Yesterday Apr 12, 2025 9:05 PM rh71 Yesterday Apr 12, 2025 9:05 PM 428 Posts Quote from BabyBubba : T-fal probably should have just left that part out about the oil; I can see it being very confusing to a new user. My air fryer often renders oil from what I cook, but I've never used cooking oil with it. Frozen seasoned fries go in frozen and 12 minutes later they're delicious. An air fryer would be more accurately named a convection roaster. I'm super pleased with the way it cooks and the results with lots of different foods. The \"set it and forget it\" is an especially convenient feature. It's even replaced my microwave oven as my most used small kitchen appliance. We have had a tabletop convection oven for years and now wondering if there's any benefit to an air fryer over that. Coincidentally did frozen fries last night and 20 minutes later they came out great. Is it just a time thing? Like Like Helpful Funny Not helpful Reply Copy Comment Link 2 Replies whoopdaddy Yesterday Apr 12, 2025 9:22 PM 822 Posts Joined Dec 2009 Yesterday Apr 12, 2025 9:22 PM whoopdaddy Yesterday Apr 12, 2025 9:22 PM 822 Posts Many reviews like this one(dies after 1 year): \"We got this as a gift from my sister Christmas of 2022. It was very impressive and useful. We haven't enjoyed our airfryer this much especially that this has the largest capacity/volume of them all. I can even cook an entire chicken or reheat a rotisserie chicken. The controls are moody but the most frequently used ones work just fine. It was easy to clean. Then just yesterday, February 26, 2024, it just plummeted from appearing not able to warm up our food enough when it usually did before and then afterwards, it just died suddenly while I was reheating food. No power and even the power button that lights up when you plug the cord was gone. Tried to move to other outlets that work and nope-- still doesn't work. Read a lot of reviews on the internet and Amazon and interestingly, a number had the same problem just with varying time, but most consistently after 1 year. So our best airfyer ever turned out tragically as the most shortlived one too. I feel bad to give it just 2 stars when it surely could have been 5 stars. But a shortlived airfryer no matter how excellent it was could not be pleasing to anyone who buys it.\" 1 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link Sign up for a Slickdeals account to remove this ad. BabyBubba Original Poster Pro Yesterday Apr 12, 2025 9:56 PM 3,564 Posts Joined Apr 2021 Yesterday Apr 12, 2025 9:56 PM BabyBubba Original Poster Pro Yesterday Apr 12, 2025 9:56 PM 3,564 Posts Quote from rh71 : We have had a tabletop convection oven for years and now wondering if there's any benefit to an air fryer over that. Coincidentally did frozen fries last night and 20 minutes later they came out great. Is it just a time thing? I have both, an air fryer and a microwave/convection oven combo. The air fryer is much faster, browns better, and is more efficient when cooking for one person. Seems to sear in juices better as well. I don't use my convection oven that much since having the choice, although it still gets used for brownies, cornbread, etc. I'm amazed at the versatility of the air fryer; it does everything well. 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link Santa_Claus 9h ago Apr 13, 2025 1:08 AM 9,425 Posts Joined Sep 2007 9h ago Apr 13, 2025 1:08 AM Santa_Claus 9h ago Apr 13, 2025 1:08 AM 9,425 Posts Um this is a good deal? 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply BabyBubba Original Poster Pro 7h ago Apr 13, 2025 2:13 AM 3,564 Posts Joined Apr 2021 7h ago Apr 13, 2025 2:13 AM BabyBubba Original Poster Pro 7h ago Apr 13, 2025 2:13 AM 3,564 Posts Quote from Santa_Claus : Um this is a good deal? Um with a retail price of $149.99 and a price on Amazon of $92.03, you be the judge. Do some research instead of asking a pointless question. Like Like Helpful Funny Not helpful Reply Copy Comment Link jaspr180 6h ago Apr 13, 2025 3:27 AM 980 Posts Joined Mar 2005 6h ago Apr 13, 2025 3:27 AM jaspr180 6h ago Apr 13, 2025 3:27 AM 980 Posts Quote from rh71 : We have had a tabletop convection oven for years and now wondering if there's any benefit to an air fryer over that. Coincidentally did frozen fries last night and 20 minutes later they came out great. Is it just a time thing? I believe the rounded design to these bowls allows air to circulate far better leading to not just faster cooking but dryer and crunchier surfaces of stuff like fries. No idea for this brand or design but my vortex works very well and very fast. Like Like Helpful Funny Not helpful Reply Copy Comment Link Related Searches Home & Home Improvement Small Appliances Air Fryers & Deep Fryers Online Only T-fal Woot! $7.99 $13 38% off Fiskars Ergonomic Cast-Aluminum Garden Weeder Tool w/ SoftGrip & Hang Hole $7.99 + Free Shipping w/ Prime or on $35+ 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $75 $125 40% off Greenworks 40V 12\" String Trimmer w/ 2.0 Ah Battery & Charger $75.18 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $59 $129 54% off RYOBI ONE+ 18V Cordless 1/4 Sheet Sander with FREE ONE+ 18V 2.0 Ah Lithium-Ion Battery $59 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $2.24 $4.48 50% off 1-Cu Ft Sta-Green In-Ground Vegetable & Flower Garden Soil $2.24 + Free Store Pickup at Lowes 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $15 $20 25% off $14.99: Carhartt Women's Loose Fit Heavyweight Short-Sleeve Pocket T-Shirt at Amazon 8 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $1,350 CyberPowerPC Gamer Supreme Gaming Desktop – Intel Core Ultra 7 265F - Arc B580 – Windows 11 - $1349.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 8 $2.17 $2.99 27% off $2.17: 12-Oz MoonPie Marshmallow Sandwich Minis Chocolate at Amazon 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $270 $300 10% off $269.99: 128GB Meta Quest 3S VR Headset + Batman: Arkham Shadow + 3-Month Trial of Meta Quest+ at Amazon 3 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $200 $300 33% off Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black $199.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 7 $1,999 $2,799 28% off Gibson Les Paul Standard 50' and '60s Figured Top - '60s Cherry ($1999) 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 6 Feedback", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slickdeals.net/f/18246283-t-fal-easy-fry-xxl-5-9qt-air-fryer-grill-combo-free-shipping-w-prime-27-99?utm_source=rss&utm_content=ht&utm_medium=RSS2", "source": "Slickdeals.net", "published_at": "2025-04-12T10:02:55"}, {"id": 29, "title": "No, These 36 Products Aren't Exciting, But Their *Results* Definitely Are", "content": "36 Products That Seem Boring But Have Exciting Results BuzzFeed Shopping logo BuzzFeed Shopping logo Search Gift Guide Beauty + Personal Care Fashion Home Sports + Fitness Stores Tech Kids Pets Sex Toys View All We hope you love our recommendations! Some may have been sent as samples, but all were independently selected by our editors. Just FYI, BuzzFeed and its publishing partners may collect a share of sales and/or other compensation from the links on this page. Posted on Apr 12, 2025 Subscribe to Shopping Newsletter Caret Down No, These 36 Products Aren't Exciting, But Their *Results* Definitely Are Including the touch-up paint that might help you get your security deposit back. by Daniel Boan BuzzFeed Staff Facebook Pinterest Link 1. A pair of teeth-whitening pens , which are SO much easier to use than traditional white strips. Just swipe it on and let the gel sit for 30 minutes — and eventually, you'll see years and years of stains start to disappear. This is a must for all my fellow coffee connoisseurs. www.amazon.com Promising review: \"I’ve tried a bunch of teeth whitening products in the past, and they’ve always left my teeth feeling sensitive. It’s been a long time since I’ve tried a whitening product and was skeptical to try another one, but after searching around, I decided to give it a try, and I am happy to say that I have not felt any sensitivity at all! The instructions say to use it 2x a day, but for now, I’m just using it 1x a day as I want to see how my teeth feel and adjust. I’ve been using the product for about a month now, and I have been able to see some results, but only after I took a photo did I realize it has been working so fast. I have pretty white teeth, so I’m pretty amazed at how well it works. It may take longer for those with darker teeth.\" — Adam Get a two-pack from Amazon for $18.95 (available in two sizes and various packs). 2. A flat outlet cover connected to a power strip so you can finally push your furniture all the way back to the wall! If you have an outlet that's basically rendered useless because it's behind your couch, bed, or other big piece of furniture, this is the solution you never knew you needed. It's also way more aesthetically pleasing than having a mess of tangled cords sprouting from the wall. www.amazon.com Promising reviews: \"Makes an incredible difference as my furnishings now sit flush against the walls while still accessing the outlets.\" — Dwags \"Incredible product! Works perfectly and provides a streamlined look throughout the room. I used one in all my outlets to provide a uniform look and can’t believe how well they work and how good they look.\" — JAD Get the three-foot version with three outlets from Amazon for $23.95 (also available in various lengths, extension options, and for inverted outlets). 3. A Bounce wrinkle release spray in a convenient travel size so you can take it with you on your next vacay. Seriously, who has time to iron while traveling?! There's also no telling if that dusty hotel iron is actually going to work. All you have to do is spray, tug the fabric a few times, then smooth the wrinkles away with your hand. It's also perfect for refreshing any clothes you plan to wear a few times during your trip, thanks to the fresh scent. www.amazon.com Promising review: \"Hate dragging out the old hotel iron and board, so I just spray my wrinkled clothes with this, and viola! Takes the wrinkles out, and off I go — no wrestling while putting the iron and board away. I even have a small travel iron or use my hair styling irons if I want a better finish, but this usually does the job nicely.\" — Audie Get it from Amazon for $6.05 . 4. A grout ink pen — it'll take the space between your tiles from grimy to shiny in a few simple swipes. This won't clean your grout, but it'll make it look brand-new. It's like a more productive version of an adult coloring book! www.amazon.com Promising review: \"I was pleasantly surprised by how far these went. I did the entire floor of my large master bathroom, plus a little of the shower, with one pen. It is pretty forgiving, and you have quite a bit of working time before it dries completely. This was not a quick task, but it went faster than I thought it would. I was worried the white would look too bright, but it just makes everything look so much cleaner. Very happy with this product!\" — Jenelle Get it from Amazon for $8.99+ (also available with a wide tip). 5. A handheld garment steamer to get those pesky wrinkles out of clothes without ever having to worry about pulling out the ironing board. It heats up in just 30 seconds, and one tank will get you 15 minutes of continuous use. Reviewers say it's super lightweight and that they're able to get a surprising amount of clothes done with just one tank. amazon.com Promising review: \"What a fantastic little gadget! I hate ironing. Hate it with a passion. This little miracle worker makes things easier for me. It takes away the wrinkles so quickly. Wow!\" — Tes Get one from Amazon for $22.47+ (available in three colors). 6. A bottle of Goo Gone foaming spray that's specifically designed to win the fight against the greasy nastiness that's been living on your oven door for far too long now. You can also use it to spruce up range hoods (it's probably way dirtier than you think right now), microwaves, pots and pans, and any food-prep surfaces. www.amazon.com Just spray and wipe — or leave it on for up to two minutes for caked-on messes. Promising review: \"Wow! A degreaser that actually works! I love the foam, which starts to work immediately on my stove top as well as cookware and other kitchen surfaces.\" — P. Webb Get it from Amazon for $7.34+ (available in two sizes and a two-pack). 7. And! An all-natural oven scrub made with gritty pumice stone so you can really go to town on that pizza that exploded and left a mess everywhere. It'll even clean all the hard-to-reach spots on your racks...or you can just clean your oven door to create the illusion that it's fully clean. Everneat/Etsy You can also use this on porcelain sinks, grout, toilet bowls, stovetop burners, and stainless steel cookware. Avoid using on aluminum and nonstick surfaces, though! Promising review: \"Finally tackled the rings on our stove top with this scrub and a reusable paper towel (as I was worried about using a scourer on an easily scratched surface), and the rings came right off! These are those 'oh, crap, the pot boiled over' rings that I ignored that lead to my stove top looking a bit crusty. The oven scrub ate them right off and left my oven and stove top looking great.\" — Jessie Bono Everneat is a small Etsy shop based in Fairfield, Connecticut, that specializes in cleaning products. Get it from Everneat on Etsy for $20 (available in a plastic or glass jar). 8. A two-pack of reusable mop pads because it's time to say goodbye to the wasteful disposable ones you've been spending way too much money on. These even have helpful Velcro straps so the pads won't go flying off when you're scrubbing your kitchen floor. www.amazon.com , www.amazon.com They're compatible with both the original Swiffer and the Swiffer Wet Jet ! Promising review: \"The Velcro closure alone is worth the purchase. It was really easy to put on (no more pinched fingers) and the hold is very strong. No more having to handle the dirty, drippy sheets to try to reattach them in the middle of cleaning the floor. I noticed that my floors are cleaner because the microfiber absorbs more and doesn't just push the grime around the floor. Also, these can be washed in the washing machine for the next use.\" — Rosemary P. Get a pack of two from Amazon for $10.95 . 9. A bathroom cleaner made with natural ingredients (like tea tree and eucalyptus essential oils) to leave your tiles shining and your tub as sparkly as the day you moved in. Plus, it's free from fumes and synthetic dyes, so you won't have to worry about any mid-chore headaches. www.amazon.com Promising review: \"I have an old shower/bathtub. I tried name-brand shower cleaners and bleach to try to clean the soap scum off the tiles and tub. I had no luck and I would cough and get sick because of how strong the smell was. I thought I would try this to save my lungs. I sprayed my entire shower and left it for about 15 minutes. Came back and rinsed off the walls, and they were shiny! I've never had such a clean shower. The smell is amazing and subtle. All I smell is tea tree and it didn't affect me at all. The price is also a good deal since the bottle is pretty large.\" — Amber Erwin Get a pack of two from Amazon for $15.99 . 10. A bottle of anti-fog drops for the glasses that'll have you singing, \"I can see clearly now the fog is gone!\" — especially when you step outside on a 90-degree day after being in the sweet, sweet AC all day. Simply add a few drops to your lenses, let it air dry for 15-20 seconds, then wipe clean and go about your fog-free day! Amazon These are safe for anti-reflective lenses! Promising review: \"I’ve tried a few different sprays, wipes, and liquids like this during the pandemic and this is the *only* one that works. It lasts way longer and there’s hardly any fog on my glasses even when it’s 30 degrees outside.\" — Pandamonium Optix 55 is a small business specializing in glasses care. Get it from Amazon for $15.55 . 11. A stainless-steel tongue cleaner so you can scrape away all the nastiness in your mouth that's been giving you a case of morning breath. It's gross and satisfying in equal measure. amazon.com Promising review: \"Unfortunately I, like many, suffer from bad breath and have tried so many things to stop it. I read that sometimes it's the germs on your tongue that can cause it, so I went crazy trying to brush my tongue. Of course, we all know how that ends — gagging, watery eyes, and it still looks like that gross film is on your tongue. I finally decided that maybe it was time to get a tongue cleaner, and it had to be a stainless-steel one because they are easier to clean and sterilize. This product is really easy to use, and I can get very far back on my tongue without activating my gag reflex. Also, it doesn't have the feeling that brushing with a toothbrush does. This cleaner just glides across my tongue, taking all the icky germs and bad breath with it. I love my nice new fresh breath and bolster of confidence!\" — jordanlauren Get it from Amazon for $8.39 (also available in a pack of two and 12). 12. A glass cleaner that'll remove any stubborn hard-water spots and have your shower doors looking so clean you might accidentally walk into them. It's designed to work in seconds; just apply with a damp cloth in circular motions and wipe away with a paper towel or cloth to reveal the shiny showroom-worthy shower doors of your dreams. www.amazon.com Promising review: \"This product works beautifully. I tried a lot of products to remove the hard water from my glass shower. I have to admit the first time I used it with a cloth, it was not very effective. The second time, I used a nonabrasive sponge for glass. It turned out beautiful, just like the first day the glass was installed .\" — EJP Get it from Amazon for $11.65 . 13. An all-natural leather conditioner because I'm here to remind you that your go-to handbag used to be a completely different shade of brown when you first bought it. This will bring it (and any other leather goods!) back to life — just swirl it on with a soft cloth and wipe away. amazon.com The brand recommends letting the leather dry for 24-48 hours. Promising review: \"Almost out after doing it on my entire collection. Worked great on a variety of colors. Sperrys, Clark’s, and other dress shoes were all able to be helped. Would recommend it especially if you are afraid of the dyes or larger kits.\" — iamjaredm Otter Wax is a small business specializing in leather and fabric care. Get it from Amazon for $9.95 . 14. An over-the-drain hair catcher that'll collect all your loose strands in a tidy pile that's super easy to clean up. Reviewers say the silicone material helps keep it in place, and the drain holes are just big enough to let water through — meaning you won't be standing in a puddle of water by the end of your shower. www.amazon.com , www.amazon.com Promising review: \"I've been very impressed! It's tall enough to fit easily over my pop-up drain, and (even without suction cups) the weighted top keeps it in place. I have medium-length hair and seem to shed almost as much as my cat, but the drain protector catches it all, and the hair is easily removed and tossed away. Best of all, the silicone doesn't hold onto mildew or mold. I have been able to spray and wipe away any grime with very little effort. It looks like this drain protector will last a very long time . This has been a very worthy purchase!\" — Suneimi Get it from Amazon for $11.99 . 15. Ice molds to take your beverage game to the next level. The slow-melting spheres will chill your drink without watering it down — and you'll totally feel like you're in an episode of Mad Men . Amazon, www.amazon.com The lids on the molds are tight-fitting (no freezer spills!) and stackable to save space. Promising review: \"I bought these molds to make ice spheres to add to whiskey drinks and other concoctions served in an old fashioned glass, and they have been outstanding. They are durable, easy to clean, and they produce a sphere that is the perfect size for a standard old fashioned glass. Because they take longer to melt, the ice spheres don't water my drinks down as much, which I appreciate both for alcoholic and non-alcoholic beverages. I have always hated watery soda, so I rarely put ice in it before I got these sphere molds, but now I can enjoy ice cold soda without it getting weak. If I am drinking an old fashioned, these spheres add just the right amount of water as they melt, mellowing the drink out without making it too bland. Also, and this is important, my friends think they are cool. I don't know what it is about a large ball of ice, but people get oddly excited when you make them a drink with one. Some of the simple things in life are the most satisfying, and this is a simple thing that people get pumped about, which amuses me.\" — John H. Get a two-pack from Amazon for $11.99 . 16. A slicer and pit remover that'll make it so much easier to make avocado toast for the seventh time this week. Use the knife side to cut your avocado in half, pop the pit out with the circular remover in the handle, then flip over to the slicer to cut out perfect strips. Amazon, www.amazon.com Promising review: \" Avocado? Yes, please! This tool is awesome. Easy to cut open the fruit. Pit remover works well, just push onto the pit and give it a twist, and the pit pops right out. The best part is the slicer. Makes beautiful slices for a great presentation.\" — NPR Man Get it from Amazon for $9.98 . 17. A pumice cleaning stone to break down all of the nastiness in your toilet and have it looking sparkly and presentable when you have last-minute guests over. Just wet it with water, get to scrubbing, then store it in the included carrying case until your next deep-cleaning session! www.amazon.com Promising review: \"I have a 19-year-old master bathroom toilet that had accumulated some nasty stains over time that regular toilet brushes and cleaning products just would not remove. I decided to try this pumice stone, figuring that the worst that could happen would be that it scratched the porcelain, and I'd have to replace the toilet. Which was what I would have had to do anyway if I couldn't get the disgusting stains out. The pumice stone worked like a charm! Given the nature and severity of the stains, it required some elbow grease, but 10 minutes later, I had a new-looking bowl, and I saw no signs of scratching. I am very happy with this purchase...well worth the very low price!\" — Happy Retiree Get it from Amazon for $9.26 (also available in packs of two and four). 18. A beloved car interior cleaner that'll have your ride back to the way it looked before that beach trip left it completely covered in wet sand. It's designed to work on leather, vinyl, plastic, rubber, and glass — so every inch of your car is about to look fresh off the lot. amazon.com Promising review: \"This does exactly what I wanted — clean all the interior surfaces of my car while not leaving any residues, streaks, or strong odors. I first used this on my 4-month-old Grand Cherokee Trailhawk that was CAKED in dust (inside!) from a recent off-road adventure. The Total Interior cleaner cleaned all my surfaces — dash, screen, leather seats, etc. without leaving any streaky residues or strong odors, good or bad. After things settled my car looked and smelled new again!\" – T. Porter Get it from Amazon for $11.97+ (available in three sizes and various bundles). 19. A handheld milk frother so you can try all those delicious-looking latte recipes you've seen on TikTok. For the cost of about three cappuccinos, you can whip up all the frothed milk topping you could ever want. www.amazon.com , www.amazon.com This requires two AA batteries (not included). Promising review: \"This makes the creamiest froth ever! I am completely blown away by the results of this device. I had no idea that I could make froth at home like this. This changes my whole cappuccino experience!!!\" — Wells Family Get it from Amazon for $9.99+ (available in 27 colors). 20. An absolutely genius tool that lets you easily spread butter on your pans before cooking or directly on hot foods like corn on the cob or fresh bread. No more ~butter fingers~! The Magnetack/Etsy Promising review: \"Absolutely perfect. It holds a whole stick of butter, and the butter stays in place, unlike with some of the other products on the market that are supposed to serve the same purpose.\" — Michelle The Magnetack is a small Etsy seller based in Miami. Get it from The Magnetack on Etsy for $14.95 . 21. A jewelry-cleaning stick so you can quickly and easily add some bling back to your rings and make them 🎵 shine bright like a diamond 🎵 . You can use it on basically any of your accessories that need a good sprucing-up — just twist the pen to dispense some cleanser onto the brush, then gently swipe on your jewelry to let the microfine cleansers wipe away dirt and oil. www.amazon.com Promising review: \"This little pen brush is incredible! I wasn't sure if it would work well on my emerald engagement ring since it's mostly advertised for diamonds, but I thought I'd give it a try. I have been wearing the ring since getting engaged in October, and even though I had it cleaned at the jeweler's in April, it just didn't seem as bright as it was when it was new, and I thought it would just always be a little cloudy. But after cleaning it once with the Dazzle Stik, I was blown away by the difference — it looks as bright and sparkly as when I first got it! I'm so glad I didn't buy an ultrasonic cleaner, since this is so much less expensive and easier and gentler. It took me less than a minute to clean, and I can do it whenever I want! And it's honestly better than when the jeweler cleaned it. So thrilled!\" — KFray Get it from Amazon for $9.48 (also available in various packs). 22. A pack of jumbo Spacesaver vacuum storage bags that truly live up to their name. These will help you store all your bulky coats or thick duvets into one compact bag until winter rolls around again. Say hello to extra closet space! BuzzFeed / Maitland Quitmeyer To activate the compression, simply close the seal at the top, remove cap from the valve and attach a vacuum nozzle to the valve, then turn on until all the air is removed and replace the cap. Promising review: \"I’ve just downsized from a large home in the suburbs to a condo living downtown. Purging and getting rid of so much stuff that I’ve accumulated throughout the years was life-changing! I had quite a bit of really nice bedding that I wanted to keep but had very little storage space. I decided to order these jumbo bags for King down duvets, thick blankets, and king-sized pillows. I was amazed at how much these held, how easy they were to pack/vacuum, and how much I could fit in such a small space! \" — Raquel Moss Get a pack of three jumbo-sized bags from Amazon for $14.99 (also available in three other sizes, a variety pack, and multiple pack sizes). 23. A stuffed burger press to seriously upgrade your grilling game. This gadget creates a perfect little pocket in your patty that you can stuff to your heart's desire. Amazon, www.amazon.com Start by pressing a space into the first layer of meat, add your toppings, and then use the press tool to add your second layer. Promising review: \"Love to grill burgers and my wife loves to stuff our veal/lamb/pork/beef burgers with all sorts of cheeses and veggies. The problem has been that sometimes the burgers crumble on the grill and don't look so appetizing when served. No more. The burger press burgers are loaded up but look just perfect when plated or laid on a big roll. And I don't have to worry about them on the grill. You can really load them up, and they cook perfectly. Simple but great product.\" — Jerry O'Connor Get it from Amazon for $19.95 . 24. An Iron Out rust stain remover in a ridiculously easy-to-use gel formula that looks that looks those annoying orange stains right in the eye and says, \"bring. it. on.\" Oh, and it does so with no scrubbing required: just spray, leave it on for a few seconds so it can activate its rust-dissolving magic, then rinse away! www.amazon.com Promising review: \"My new BFFL. Guys. I hate cleaning, so anytime I find a product that makes it easier and faster, I’m in! This stuff works wonders. My sink had rust stains that I just couldn’t get out, so I did what anyone would do... I walked away and pretended it didn’t exist. But now, I spray this on, walk away, and come back to a rust-free sink. This stuff... Stop reading reviews and just buy it. You can thank us all later. \" — Laurane Petrarca Get it from Amazon for $5.94 (also available in packs of three and six in two sizes). 25. A pack of special silicone cups so you can whip up poached eggs like a professional chef. Simply place the egg-filled cups on 1-inch of water in a pan, then cook while covered for 8-10 minutes. You can also use them in the microwave by heating on \"low\" for three minutes! So basically, you have no excuse for not treating yourself to perfectly poached eggs every day. www.amazon.com Promising review: \"My wife loves poached eggs and I never knew how to make them, only eggs over-easy, omelets. So, I researched the procedure and found these Cozlife egg poachers highly rated and simple. After three sets of faultless poached eggs , my wife is very happy.\" — OceanAveBoy Get a set of four from Amazon for $10.97 . 26. A cord organizer with an adhesive sticker you can place on the back of your stand mixer (or any other appliance!) so you'll have a place to wrap your cord instead of letting it dangle all over your counter. This is honestly genius, and I want to put one on every appliance I own. 3DHome Solutions/Etsy Promising reviews: \"This little thing works so well at containing the cord. It makes my mixer all neat and tidy. I love this!\" — Isabelleosborne21 3D Home Solutions is a small Etsy shop based in Frisco, Texas. Get it from 3D Home Solutions on Etsy for $8 (available in three colors). 27. A battery-operated fabric shaver so you can bring some new life to your current sweaters instead of splurging for new ones. Just run this over any areas where you see pilling, and this little device will shave it away. www.amazon.com Also, be sure to pick up two AA batteries ! They're not included. Promising review: \"I must admit, I was skeptical about this. I've also used cheap razors to get lint off of clothes and it has been convenient enough. I saw this and bought it for my mom, and she really enjoyed it but didn't try it myself. I finally did, and WOW, I am impressed! It fits easily in hand and works even better than a razor. I was able to get clean and even lint removal on even my lumpiest of sweaters .\" — Haley W. Get it from Amazon for $8.99+ (available in five colors and two styles). 28. A cult-favorite foot file that'll grind away at calluses and have your heels and toes looking silky smooth and ready to slip into your coziest socks. There are many foot files out there, but more than 85,000 Amazon reviewers say this one works like a charm. www.amazon.com Promising review: \"OMG, these should be standard issue to every human. I’ve bought them all: the cheap foot files, the expensive ones, the Ped Egg, and even a foot file from that direct sales nail wrap company. None of those remotely compare to this one. I thought I was reduced to course heels forever; no more! With just one use, my heels are fabulous! The callouses this thing removed was absolutely disgusting, but I couldn’t be happier. You won’t be disappointed!!\" — JMart Get it from Amazon for $9.99 . 29. A set of fast-acting Keurig cleaner pods to get all the dirt and grime out of your trusty coffee companion. Simply place it in your Keurig like a typical K-Cup, brew on the largest cup size, remove the cleaning pod, and then brew another round of hot water to rinse. You'd be surprised how much coffee residue and old coffee grinds can get stuck in the dispenser. www.amazon.com , www.amazon.com Promising review: \"I had no idea that cleaning a Keurig was a thing. I bought these because I saw them on TikTok, believe it or not. I wanted to give it a go because my Keurig isn’t that old, and I didn’t think it would do anything. IT WORKS SO WELL! My Keurig wasn’t as nasty as some I’ve seen, luckily. I would highly recommend; keeps everything running correctly and clean .\" — Lauren Get a set of six from Amazon for $9.95 (the six-count box is also available in packs of two and three). 30. A headlight restoration kit that attaches to a household drill so you can stop squinting to see what's ahead of you every time the sun goes down. It comes with everything you need to get started so you can kiss that expensive mechanic bill goodbye! www.amazon.com The kit comes with masking tape (to protect your paint!), various sanding discs that can attach to a household drill , and clear coat wipes. Promising review: \"I normally don’t review products on Amazon, but I was so impressed by this kit; you all need to know how amazing it is. The kit comes with everything needed to recondition your headlight lens. Don’t waste your money on kits that don’t have a drill attachment. The results were better for me than the kit from Turtle Wax that requires hand sanding. Wear a dust mask, follow the directions, watch a YouTube video if needed, and take your time. The photos are from a 10-year-old Lexus with cloudy headlights. It took me about 45 minutes to get the headlight lens smooth and clear! I was amazed at how much brighter the lights are and how you can now see the side market lights. This kit is a good value! \" — Reviews Get it from Amazon for $15.98 . 31. A mini bottle of touch-up paint to mask any scratches or scuffs on your walls and furniture... and to make sure you get that security deposit back. You can use it directly on wood or to freshen up existing paint, so don't be surprised if you get the urge to roam around your home looking for cabinets, shutters, and floorboards to spruce up. Amazon, www.amazon.com Promising review: \"Over the years, my sloppy 'hair-dying job at home' has left several spots on my white bathroom walls. This is exactly what I was looking for. If you're unsure which color to use (no need to be an exact match for this type of touch-ups), you can contact the company and they'll send you a color chart for free. This is like a whiteout for the imperfections. I didn't want to have to paint the entire bathroom for some small spots, but those spots were bothering me for certain. Now I don't even know where those spots are anymore, and the walls look normal. This is such a lifesaver.\" — mrsj Get it from Amazon for $18.95 (available in 24 shades). 32. An enzyme-based laundry stain remover so you won't have to panic the next time you accidentally get some pizza sauce on your favorite white top. It's a plant-powered formula (so no chemicals like ammonia or bleach that might harm some fabrics) and is super simple to use: spray the stain, wait 15 minutes for fresh stains or 8 hours for set-in stains, then wash as you normally would (though the brand recommends adding an extra rinse to your cycle for best results!). www.amazon.com Promising review: \"For whatever reason, I am ALWAYS spilling things on my shirts, and I cook every night (sometimes I remember the apron, sometimes I don't). My clothes are a mess by the end of the day. I'm not proud of it, but there it is. I have tried EVERYTHING there is to remove stains and this is the absolute BEST thing out there. (There is simply not a major stain remover that I have not tried.) The only thing close is a long presoak (I mean like six hours) in Oxyclean. With Puracy, you get the best result by doing it well in advance, but for me, that is another plus because I would far rather spray them when I put them in the hamper than do it all at once just before I do the laundry. It seems to get everything out, and I've never had any trouble with damaged fabric. I don't really review very much, but this is seriously outstanding .\" — NYC Buyer Puracy is a Texas-based, family-owned small business specializing in plant-based, chemical-free, hypoallergenic home products, with a donation made to local families in need with a portion of every purchase. Get it from Amazon for $16.99 . 33. A powerful spray that will break down stubborn mold and mildew stains almost instantly. Just leave it on for about 15 seconds, then lightly wipe away to reveal what your shower is actually supposed to look like. amazon.com Promising review: \"I bought this RMR spray with low expectations, even with the good reviews. I sprayed a small patch in the evening and let it sit overnight. The next morning, the grout where I had sprayed was as white as if it were brand new. I decided to spray the entire wall and part of the roof. The next day everything I sprayed had no visible mold. By the third night, I was pretty much spraying everything left in the shower. This stuff is amazing.\" — John Werner Get it from Amazon for $15.99 (available in three sizes and multipacks). 34. A granite and stone cleaner — not only will it have your countertops looking ready for the pages of Architectural Digest , but it also kills 99.9% of germs and bacteria in just a few swipes. It's basically a must-have for any last-minute dinner parties. www.amazon.com Promising review: \"This is my go-to granite cleaner, and I’ve tried a lot! Actually gets counters clean without a film or streak and not a lot of elbow grease.\" — Lori Get it from Amazon for $6.49+ (available in two sizes and a pack of six). 35. A pair of handheld scrapers that will make your cast iron pans look as good as the day you bought them. It's gentle enough to use on nonstick surfaces, and unlike a sponge, this won't trap a bunch of food particles that are hard to rinse out. Now you can spend less time cleaning and more time whipping up culinary masterpieces. www.amazon.com Promising review: \"Necessary tool to clean your cast iron pots and pans. Perfectly contoured to the rounded corners used by Lodge in their pans so you'll get any food stuck to your pan off easily. The plastic is sturdy and malleable but not so much that it will deform. Been using them for a couple months now, and I haven't had them break . And since I still can't get a properly seasoned coating on my pans, I have a lot of food that sticks (my fault), but these scrapers get pretty much everything off easily.\" — JGtz Get a two-pack from Amazon for $6.79 . 36. A bottle of earwax removal drops — it uses fizzy microfoam action to break down all the stubborn wax that's been clogging up your ears for way too long now. Just apply five to 10 drops to your ear, keep your head tilted for several minutes to let the carbamide peroxide loosen your hardened ear wax, then flush away any remaining wax with warm water in a bulb or syringe. www.amazon.com , www.amazon.com However, It's always a good idea to chat with your ENT before using any ear-cleaning products! Promising review: \"One of my ears was blocked by excess ear wax, which caused hearing issues. These drops helped me to soften and loosen the ear wax, allowing it to easily drain.\" — Skh Get it from Amazon for $6.99 (also available in a pack of two). When a responsible adult purchase is actually exciting: Tap to play GIF Tap to play GIF MTV Reviews here have been edited for length and/or clarity.", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.buzzfeed.com/danielboan/boring-products-impressive-results", "source": "Buzzfeed", "published_at": "2025-04-12T10:01:04"}, {"id": 30, "title": "Reacher season 4: everything we know so far about the hit Prime Video show’s return", "content": "Reacher season 4: everything we know so far about the hit Prime Video show’s return | TechRadar Skip to main content Reacher season 4 will commence filming in mid-2025 (Image credit: Amazon Prime Video) Jump to: Release date prediction Trailer speculation Predicted cast Story rumors Where to watch Future seasons Reacher season 4: key information - Renewed in October 2024 - Filming reportedly starting in mid-2025 - No release date revealed yet - Reacher returns for another adaptation of Lee Child's novels - Main cast predicted to return - Speculation around plot and which book it will follow - No official trailer yet - Neagley spin-off officially commenced filming in February Reacher season 4 is on the way. With season 3 done and dusted, it's time to really start talking about season 4, which was officially renewed back in October 2024. Prime Video, one of the best streaming services , proudly revealed that Reacher season 3 has become Prime Video’s biggest returning show , thanks to 54.6 million viewers globally within the first 19 days. So, it's certainly one of the best Prime Video shows that's ready to return for more. Based on the novels by Lee Child, action-packed thriller follows Jack Reacher, an ex-military police officer, who finds himself continuously embroiled in conspiracies and dangerous missions after being wrongly accused of murder. You may like How to watch Reacher season 3 online from anywhere – stream Lee Child adaptation Invincible season 4: everything we know so far about the hit Prime Video show's next chapter Each season is filled with big fights and mystery-solving, and season 3 was no different. A tumultuous ending hints at much more to come, so here's everything we know about Reacher season 4 from a release date and trailer to plot rumors and more. Full spoilers follow for Reacher season 3 and the previous seasons. Potential spoilers for Reacher season 4 will also appear. Reacher season 4 release date prediction A post shared by Amazon MGM Studios (@amazonmgmstudios) A photo posted by on There’s no Reacher season 4 release date just yet, but we do know that the show was renewed back in October 2024. Speaking to The Mirror in February, Child said: “So we’re ready to go on season four. Obviously, we can’t reveal anything yet, but it’s another good’un, I’ll tell you. It’s going to be great.” He added: “I’ll see you next year and we’ll talk about it,” possibly hinting that Reacher season 4 will premiere in 2026. Get daily insight, inspiration and deals in your inbox Sign up for breaking news, reviews, opinion, top tech deals, and more. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors If we take previous seasons as a guide for season 4, season 1 came out in 2022, season 2 ran from 2023 to 2024, and season 3 in 2025. If Prime Video continues releasing annually, it could well be early 2026. When Child discussed future seasons of Reacher in an exclusive chat with TechRadar, he revealed filming will commence sooner than you might think: “It’s written and it’s ready to go. It’s going to start shooting in the summer.” Reacher season 4 trailer: is there one? (Image credit: Amazon Prime Video) Given the cast and crew haven’t started filming yet, there’s no trailer to share. Historically, trailers come out a lot nearer to the release of the show. So, for a Reacher season 4 trailer, we imagine a wait until at least late 2025, early 2026. Reacher season 4 predicted cast Alan Ritchson will surely reprise his role as the titular, Jack Reacher (Image credit: Amazon MGM Studios) Full spoilers follow for Reacher season 3. Based on the Reacher season 3 finale, this is the cast we predict will return for Reacher season 4. Though, at time of writing, these characters are yet to be confirmed. Aside from Reacher himself: Alan Ritchson as Jack Reacher Sonya Cassidy as Susan Duffy Anthony Michael Hall as Zachary Beck Maria Sten as Frances Neagley Malcolm Goodwin as Oscar Finlay Willa Fitzgerald as Roscoe Conklin Brian Tee as Francis Xavier Quinn / Julius McCabe Reacher season 4 plot rumors Reacher season 3 ended with an almighty brawl (Image credit: Amazon Prime Video) Full spoilers follow for Reacher seasons 1-3. Plus, potential spoilers for Reacher season 4. Jack Reacher is a man on a mission, or several missions if you take all seasons so far into consideration. He’s been repeatedly ensnared in conspiracies that put a lot of lives at risk, including his own. From false murder accusations to going deep undercover to retrieve a lost DEA agent, following Lee Child's novels has given plenty of plot for the show to follow along with. And season 3 saw Reacher’s feud with villains (new and old), Xavier Quinn and Zachary Beck, come to a head. The finale episode, titled ‘Unfinished Business’, saw Reacher's team break down a crime syndicate, run by Beck, by infiltrating his base. But, in order to do so, he had to come up against Beck's towering bodyguard, Paulie . And that led to an almighty brawl placing brains against brawn. At the end of it all, he sat down with Neagley and talked about the real reason Reacher gets embroiled in so much trouble, because he hates the \"big guy\". For season 4's plot then, the best place to turn is to the books. Season 1 was adapted from Killing Floor , Child’s debut novel, season 2 from Bad Luck and Trouble, his 11th novel, and season 3 from Persuader , his 7th novel. So, they're not going in book order, but they're certainly going from the books. Neagley tells Reacher how it is (Image credit: Prime Video) While there’s been speculation around Personal , book 19, being the basis of season 4 given how the flashbacks in Persuader and in season 3 line up with the plot, there's been no confirmation . Speaking to The Independent though, Child revealed book 22 is one he’d love to adapt: “It was well received but The Midnight Line is one of my favourites because it was an opioid book, but it was written from the point of view of the addict with tremendous sympathy.” Adding: “I wonder if it will ever get made. We have to see whether we ever choose that one, but I’d love to see how it comes out.” And Child supports that the show can jump around the book order, saying he: “very deliberately wrote the book series so you did not have any prior knowledge. I wanted people to be able to pick up any title anywhere and have a really satisfying story, so we can take the same approach.” Which direction Reacher season 4 decides to go in is entirely down to Lee Child and showrunner Nick Santora, so we’ll have to wait and see. Where to watch Reacher All seasons of Reacher, exclusively on Prime Video (Image credit: Prime Video) Reacher seasons 1 to 3 can be streamed exclusively on Prime Video. Finished them all and eager for more? Check out these 6 muscular thrillers to watch while you wait . Will there be more seasons of Reacher? A post shared by Maria Sten (@mariasten) A photo posted by on It's incredibly likely. Reacher season 4 was greenlit months before season 3 came out, and we wouldn't be surprised to hear about season 5 in a similar way. And, of course, there's all the books that Lee Child has written of the Jack Reacher series — currently totalling 29. But, it's not just Reacher that'll be on the scene. In October 2024, Prime Video announced a spin-off series, focused on Frances Neagley, a recurring character in the Reacher series. And in February, the show officially went into production with Maria Sten pictured holding the clapperboard for episode one. While we wait to hear news on more seasons of Reacher , we'll keep an ear to the ground and update you when we can. For more Prime Video TV-based coverage, read our guides on The Boys season 5 , Mr and Mrs Smith season 2 , The Rings of Power season 3 , and Fallout season 2 . Today's best Amazon Prime Video deals Amazon Prime Video - Free Trial View at Amazon Prime Grace Dean Contributor Grace is a freelance writer for TechRadar, with past work at sites like GamesRadar, Metro and WhatToWatch. She's been writing about entertainment for over ten years, and has a special interest in sci-fi, rom-coms, and captivating dramas. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name. Logout Read more How to watch Reacher season 3 online from anywhere – stream Lee Child adaptation Invincible season 4: everything we know so far about the hit Prime Video show's next chapter Reacher season 3 is Prime Video's #1 show – here are 3 more action shows that pack a punch with over 80% on Rotten Tomatoes Invincible season 3: release date, trailer, confirmed cast, plot rumors, and more news on the hit Prime Video show's return Slow Horses season 5: everything we know so far about the popular Apple TV+ show's return The Wheel of Time season 3: release date, trailer, confirmed cast, story synopsis, and more news about the Prime Video show's return Ted Lasso season 4: everything we know so far about the return of the hit Apple TV+ show Bridgerton season 4: everything we know so far about the hugely successful Netflix show's return Shōgun season 2: everything we know so far about the hit show's return on Hulu and Disney Plus Severance season 3: everything we know so far about the wildly popular Apple TV+ show's next chapter Severance season 2: release date, trailer, confirmed cast, plot synopsis, and more news on the hit Apple TV Plus show's return Only Murders in the Building season 5: everything we know so far about the show's return to Hulu and Disney Plus Latest in Amazon Prime Video The Bondsman is Prime Video's most popular show – here are 3 more quirky series with over 90% on Rotten Tomatoes 5 new Prime Video dramas with over 90% on Rotten Tomatoes I'm streaming in April – and you should too 3 new Prime Video movies in April 2025 with over 90% on Rotten Tomatoes Everything new on Prime Video in April 2025, including Oscar winner Conclave and nominee Nickel Boys 'I think he's Dorian Gray': The Bondsman showrunner on Kevin Bacon, demon hunting and blues music in the new Prime Video series This new Prime Video show is the funniest I've ever seen – no seriously, I'm still laughing just thinking about it today Reacher season 4: everything we know so far about the hit Prime Video show’s return Prime Video’s hit new historical drama will continue its reign for another season as House of David gets renewed The Wheel of Time season 3 is Prime Video's #2 show – here are 3 more fantasy series with over 85% on Rotten Tomatoes I'm rewatching We Are Newcastle United on Prime Video after my club's exhilarating Carabao Cup win Disappointed by The Electric State? Here's 4 reasons you should watch Tales From the Loop on Prime Video Reacher season 3 becomes Prime Video’s biggest returning show thanks to Hollywood’s biggest heavyweight Latest in News ICYMI: the week's 7 biggest tech stories from tariff-based iPhone panic buying to Samsung One UI 7 update taking its times Fujifilm's quirky new compact just leaked – and it could be 2025's most fun camera Samsung's new Bespoke Jet AI Lite might be the perfect upgrade to my classic Bespoke Jet vacuum, if the price is right WhatsApp has just dropped these 9 new features – including 2 that I'm not happy about OnePlus Watch 3 gets surprise price hike in the US – and you can already guess why Microsoft’s latest attempt to persuade upgrades to Windows 11 falls spectacularly flat on its face Garmin has just crossed a powerful bike light with a 4K dash cam – and as a cyclist, I’m all in Mass quishing attacks linked to organized crime gangs across the UK MSI has apparently leaked new its Nvidia RTX 5060 Ti third-party GPUs, and I’m worried these budget GPUs will come with a ‘new motherboard’ tax 10 new Apple TV+ shows and movies are coming in mid-2025 – here are the 3 I'll be streaming on my Apple TV 4K Google Workspace is offering huge discounts for the US government Windows 11’s controversial Recall feature could soon arrive for Copilot+ PCs – I just hope Microsoft’s tightening of its privacy is up to scratch LATEST ARTICLES 1 \"Weakening encryption would make European security worse\" – the VPN industry reacts to the EU's plan for end-to-end encryption backdoors 2 Reacher season 4: everything we know so far about the hit Prime Video show’s return 3 These are the top four electric sports cars I’ve driven – and they show electrification doesn’t mean boring 4 Lenovo Yoga Slim 7x Review: Thought OLED was overrated? Not with this laptop - it's one of the best-looking I've ever used 5 “We want to work with the best\" - Okta reveals new security tools designed to safeguard GenAI systems Close Please login or signup to comment Please wait... Login Sign Up", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://www.techradar.com/streaming/amazon-prime-video/reacher-season-4-everything-we-know-so-far-about-the-hit-prime-video-shows-return", "source": "TechRadar", "published_at": "2025-04-12T10:00:00"}, {"id": 31, "title": "Instant Slim by Instant Pot 6QT Air Fryer Oven, EvenCrisp Technology, Space Saving, Nonstick and Dishwasher-Safe Basket + Free Shipping w/ Prime $29.99", "content": "Instant Slim by Instant Pot 6QT Air Fryer Oven, EvenCrisp Technology, Space Saving, Nonstick and Dishwasher-Safe Basket + Free Shipping w/ Prime $29.99 6-Quart Instant Pot Vortex Slim XL Air Fryer Oven $30 $130 76% off Help the community know if this is a good deal. 17 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Visit Woot! Slickdeals Forums Deal Talk Heads up, this deal has expired. Want to create a deal alert for this item? Add Deal Alert expired Posted by BabyBubba • Yesterday Apr 12, 2025 9:55 AM Item 1 of 2 Item 1 of 2 expired Posted by BabyBubba • Yesterday Apr 12, 2025 9:55 AM 6-Quart Instant Pot Vortex Slim XL Air Fryer Oven + Free Shipping w/ Amazon Prime $30 $130 76% off Woot! 17 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 20 Comments 11,017 Views Visit Woot! Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Save Share Deal Details Woot! has 6-Quart Instant Pot Vortex Slim XL Air Fryer Oven on sale for $29.99 . Shipping is free for Amazon Prime Members (must login with your Amazon account and select a shipping address in order for Woot to apply free shipping) or is otherwise $6 per order. Thanks to community member BabyBubba for finding this deal. Product Details : 5-in-1 functionality: Air fry, broil, bake, roast, and reheat Slimmer than the standard 6QT Vortex, for more side-to-side counter and prep space Easy to make foods like flatbreads, kebabs, bacon and more Quiet Mark Certified allowing you to hear your timer and not the air fryer fan Holds a 4 lb. chicken or 2 lb. bag of fries Editor's Notes Written by jimmytx | Staff About this Store : More details about Woot's 90-Day Limited Warranty Policy and Return Policy . Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Additional Information : Rated 4.3 out of 5 stars on Amazon based on over 380 customer reviews . Please see the original post for additional details and/or view the Wiki and forum comments for further helpful discussion if available. Original Post Written by BabyBubba Community Notes This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make informed decisions. Add Entry About the Poster BabyBubba Joined in Apr 2021 Follow Give Rep Message 872 Deal Posts 3,564 Comments Posts 5,937 Reputation Points 196 Votes Submitted Deal Details Community Notes About the Poster Woot! has 6-Quart Instant Pot Vortex Slim XL Air Fryer Oven on sale for $29.99 . Shipping is free for Amazon Prime Members (must login with your Amazon account and select a shipping address in order for Woot to apply free shipping) or is otherwise $6 per order. Thanks to community member BabyBubba for finding this deal. Product Details : 5-in-1 functionality: Air fry, broil, bake, roast, and reheat Slimmer than the standard 6QT Vortex, for more side-to-side counter and prep space Easy to make foods like flatbreads, kebabs, bacon and more Quiet Mark Certified allowing you to hear your timer and not the air fryer fan Holds a 4 lb. chicken or 2 lb. bag of fries Editor's Notes Written by jimmytx | Staff About this Store : More details about Woot's 90-Day Limited Warranty Policy and Return Policy . Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Additional Information : Rated 4.3 out of 5 stars on Amazon based on over 380 customer reviews . Please see the original post for additional details and/or view the Wiki and forum comments for further helpful discussion if available. Original Post Written by BabyBubba Deal Score +17 Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Visit Woot! Leave a Comment To participate in the comments, please log in. Log In Sign Up Top Comments ArseneWenger Way too many reviews citing burning plastic smell not going away after months and leaking into the food… Slimeyface These days it feels like if something appears on discount at Woot then it probably is suffering from a defect of some kind or is generally unappealing. Its like a dumpster heap of failed and rejected products. How the mighty Woot has fallen from grace. RIP to an old friend. LavenderPickle7682 In 2025, being \"FDA Approved\" isn't exactly screaming with confidence. More like screaming from a cancer diagnosis. 20 Comments Oldest Sign up for a Slickdeals account to remove this ad. meanmachine Yesterday Apr 12, 2025 8:00 PM 54 Posts Joined Jun 2011 Yesterday Apr 12, 2025 8:00 PM meanmachine Yesterday Apr 12, 2025 8:00 PM 54 Posts Got one. Thanks! Like Like Helpful Funny Not helpful Reply Copy Comment Link ArseneWenger Yesterday Apr 12, 2025 8:22 PM 2,943 Posts Joined Feb 2011 Yesterday Apr 12, 2025 8:22 PM ArseneWenger Yesterday Apr 12, 2025 8:22 PM 2,943 Posts Our community has rated this post as helpful. If you agree, why not thank ArseneWenger Way too many reviews citing burning plastic smell not going away after months and leaking into the food… 11 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply geoelectric Yesterday Apr 12, 2025 8:38 PM 10 Posts Joined Dec 2007 Yesterday Apr 12, 2025 8:38 PM geoelectric Yesterday Apr 12, 2025 8:38 PM 10 Posts Our community has rated this post as helpful. If you agree, why not thank geoelectric Quote from ArseneWenger : Way too many reviews citing burning plastic smell not going away after months and leaking into the food… Yeah, just checked Amazon reviews. Yikes. 4 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link Slimeyface Yesterday Apr 12, 2025 9:02 PM 10,540 Posts Joined Aug 2008 Yesterday Apr 12, 2025 9:02 PM Slimeyface Yesterday Apr 12, 2025 9:02 PM 10,540 Posts Our community has rated this post as helpful. If you agree, why not thank Slimeyface These days it feels like if something appears on discount at Woot then it probably is suffering from a defect of some kind or is generally unappealing. Its like a dumpster heap of failed and rejected products. How the mighty Woot has fallen from grace. RIP to an old friend. 6 2 Like Like Helpful Funny Not helpful Reply Copy Comment Link 3 Replies liejian Yesterday Apr 12, 2025 9:28 PM 366 Posts Joined Aug 2010 Yesterday Apr 12, 2025 9:28 PM liejian Yesterday Apr 12, 2025 9:28 PM 366 Posts amazon shows this as having a ceramic nonstick coating but cant be confirmed on instant pot's site. Anyone know what the coating is made of? 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply BabyBubba Original Poster Pro Yesterday Apr 12, 2025 9:35 PM 3,564 Posts Joined Apr 2021 Yesterday Apr 12, 2025 9:35 PM BabyBubba Original Poster Pro Yesterday Apr 12, 2025 9:35 PM 3,564 Posts Quote from Slimeyface : These days it feels like if something appears on discount at Woot then it probably is suffering from a defect of some kind or is generally unappealing. Its like a dumpster heap of failed and rejected products. How the mighty Woot has fallen from grace. RIP to an old friend. Sometimes yes, but I've been scoring lots of deals from them lately. An Eddie Bauer blanket for $5, Community coffee for $2.50 a pound, and an Old Timer midsize folding knife for $9. Lots of other great deals too. An Amazon Basics microcut paper shredder for $28, a nice 3/8\" ratchet for $3, and a rice cooker I use regularly for $8. All within the last couple of months, and all high quality stuff at a deep discount. I watch Woot's offerings daily; most of their prices are nothing special but a select few are amazing. 3 Like Like Helpful Funny Not helpful Reply Copy Comment Link ontech Yesterday Apr 12, 2025 9:58 PM 243 Posts Joined Jan 2010 Yesterday Apr 12, 2025 9:58 PM ontech Yesterday Apr 12, 2025 9:58 PM 243 Posts Quote from liejian : amazon shows this as having a ceramic nonstick coating but cant be confirmed on instant pot's site. Anyone know what the coating is made of? If it's coated in anything is probably not safe. 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply Sign up for a Slickdeals account to remove this ad. BabyBubba Original Poster Pro Yesterday Apr 12, 2025 10:06 PM 3,564 Posts Joined Apr 2021 Yesterday Apr 12, 2025 10:06 PM BabyBubba Original Poster Pro Yesterday Apr 12, 2025 10:06 PM 3,564 Posts Quote from ontech : If it's coated in anything is probably not safe. Life isn't safe; no one survives it. I doubt that an FDA approved non-stick coating will move the needle all that much. 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply LavenderPickle7682 Yesterday Apr 12, 2025 11:53 PM 2,288 Posts Joined Sep 2019 Yesterday Apr 12, 2025 11:53 PM LavenderPickle7682 Yesterday Apr 12, 2025 11:53 PM 2,288 Posts Quote from BabyBubba : Life isn't safe; no one survives it. I doubt that an FDA approved non-stick coating will move the needle all that much. In 2025, being \"FDA Approved\" isn't exactly screaming with confidence. More like screaming from a cancer diagnosis. 6 Like Like Helpful Funny Not helpful Reply Copy Comment Link 2 Replies BabyBubba Original Poster Pro 10h ago Apr 13, 2025 12:03 AM 3,564 Posts Joined Apr 2021 10h ago Apr 13, 2025 12:03 AM BabyBubba Original Poster Pro 10h ago Apr 13, 2025 12:03 AM 3,564 Posts Quote from LavenderPickle7682 : In 2025, being \"FDA Approved\" isn't exactly screaming with confidence. More like screaming from a cancer diagnosis. I really don't understand why people feel the need to scream safety fears on a deals site. This is a great price. Either buy it or don't. But please stop whining about cancer. It's so lame and tiresome for the rest of us. If you want to express a product safety concern, take it to the Consumer Product Safety Commission. Expect eye rolls when you bring it up here. 4 Like Like Helpful Funny Not helpful Reply Copy Comment Link 3 Replies gobblygook 8h ago Apr 13, 2025 1:38 AM 2,514 Posts Joined Jan 2007 8h ago Apr 13, 2025 1:38 AM gobblygook 8h ago Apr 13, 2025 1:38 AM 2,514 Posts Quote from BabyBubba : I really don't understand why people feel the need to scream safety fears on a deals site. This is a great price. Either buy it or don't. But please stop whining about cancer. It's so lame and tiresome for the rest of us. If you want to express a product safety concern, take it to the Consumer Product Safety Commission. Expect eye rolls when you bring it up here. Because \"cheap\" doesn't make everything a \"deal\". Please stop whining about whining, whinerboi. 3 2 Like Like Helpful Funny Not helpful Reply Copy Comment Link zen_cohen 8h ago Apr 13, 2025 2:04 AM 368 Posts Joined Dec 2013 8h ago Apr 13, 2025 2:04 AM zen_cohen 8h ago Apr 13, 2025 2:04 AM 368 Posts This or the T-Fal? Like Like Helpful Funny Not helpful Reply Copy Comment Link LavenderPickle7682 7h ago Apr 13, 2025 2:57 AM 2,288 Posts Joined Sep 2019 7h ago Apr 13, 2025 2:57 AM LavenderPickle7682 7h ago Apr 13, 2025 2:57 AM 2,288 Posts Quote from BabyBubba : I really don't understand why people feel the need to scream safety fears on a deals site. This is a great price. Either buy it or don't. But please stop whining about cancer. It's so lame and tiresome for the rest of us. If you want to express a product safety concern, take it to the Consumer Product Safety Commission. Expect eye rolls when you bring it up here. Ah, another government commission for consumer safety. I'm sure they're on the ball just as much as the other deregulated agencies and commissions! lol. 3 Like Like Helpful Funny Not helpful Reply Copy Comment Link ablang 7h ago Apr 13, 2025 2:57 AM 3,163 Posts Joined Nov 2012 7h ago Apr 13, 2025 2:57 AM ablang 7h ago Apr 13, 2025 2:57 AM 3,163 Posts Quote from Slimeyface : These days it feels like if something appears on discount at Woot then it probably is suffering from a defect of some kind or is generally unappealing. Its like a dumpster heap of failed and rejected products. How the mighty Woot has fallen from grace. RIP to an old friend. The shirts that have graphics on them seem like the worst of the bunch. I don't recall the last time I jumped in on a Woot deal. Like Like Helpful Funny Not helpful Reply Copy Comment Link Sign up for a Slickdeals account to remove this ad. Indio22 6h ago Apr 13, 2025 3:41 AM 3,362 Posts Joined Jan 2010 6h ago Apr 13, 2025 3:41 AM Indio22 6h ago Apr 13, 2025 3:41 AM 3,362 Posts Quote from BabyBubba : I really don't understand why people feel the need to scream safety fears on a deals site. This is a great price. Either buy it or don't. But please stop whining about cancer. It's so lame and tiresome for the rest of us. If you want to express a product safety concern, take it to the Consumer Product Safety Commission. Expect eye rolls when you bring it up here. I want to know about the product I'm considering, and that includes various aspects from smelly plastics to potential health/safety concerns. A deal isn't just about low price for some of us. Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply Related Searches Home & Home Improvement Small Appliances Free Shipping with Prime Online Only Instant Pot Woot! $7.99 $13 38% off Fiskars Ergonomic Cast-Aluminum Garden Weeder Tool w/ SoftGrip & Hang Hole $7.99 + Free Shipping w/ Prime or on $35+ 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $75 $125 40% off Greenworks 40V 12\" String Trimmer w/ 2.0 Ah Battery & Charger $75.18 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $59 $129 54% off RYOBI ONE+ 18V Cordless 1/4 Sheet Sander with FREE ONE+ 18V 2.0 Ah Lithium-Ion Battery $59 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $2.24 $4.48 50% off 1-Cu Ft Sta-Green In-Ground Vegetable & Flower Garden Soil $2.24 + Free Store Pickup at Lowes 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $15 $20 25% off $14.99: Carhartt Women's Loose Fit Heavyweight Short-Sleeve Pocket T-Shirt at Amazon 8 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $1,350 CyberPowerPC Gamer Supreme Gaming Desktop – Intel Core Ultra 7 265F - Arc B580 – Windows 11 - $1349.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 8 $2.17 $2.99 27% off $2.17: 12-Oz MoonPie Marshmallow Sandwich Minis Chocolate at Amazon 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $270 $300 10% off $269.99: 128GB Meta Quest 3S VR Headset + Batman: Arkham Shadow + 3-Month Trial of Meta Quest+ at Amazon 3 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $200 $300 33% off Garmin vívoactive 5, Health and Fitness GPS Smartwatch, AMOLED Display, Up to 11 Days of Battery, Black $199.99 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 7 $1,999 $2,799 28% off Gibson Les Paul Standard 50' and '60s Figured Top - '60s Cherry ($1999) 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 6 Feedback", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slickdeals.net/f/18246274-instant-slim-by-instant-pot-6qt-air-fryer-oven-evencrisp-technology-space-saving-nonstick-and-dishwasher-safe-basket-free-shipping-w-prime-29-99?utm_source=rss&utm_content=ht&utm_medium=RSS2", "source": "Slickdeals.net", "published_at": "2025-04-12T09:55:16"}, {"id": 32, "title": "2 Reasons to Avoid Amazon Stock as Tariffs Escalate", "content": "", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_9fb30910-328c-412f-8a5f-9927289f666a", "source": "Yahoo Entertainment", "published_at": "2025-04-12T09:50:00"}], "timeline": [{"date": "2025-04-12T09:50:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T09:55:16", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T10:00:00", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T10:02:55", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T10:02:55", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T10:04:36", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T10:07:30", "score": 0.9, "sentiment": "POSITIVE"}]}