{"company": {"id": 2, "name": "Apple", "aliases": ["AAPL", "Apple Inc"]}, "stats": {"POSITIVE": 10, "NEGATIVE": 5, "NEUTRAL": 9, "TOTAL": 24, "AVG_SCORE": 0.16666666666666666}, "mentions": [{"id": 62, "title": "‘Politically Catastrophic’: Chuck Todd Breaks Down Why Trump’s Tariff-Stock Market Debacle is His ‘Afghanistan Moment’", "content": "Chuck Todd: Trump Tariffs May Be 'Politically Catastrophic' ‘Worse Than a Recession!’ Business Titan Ray Dalio Forecasts Economic Doom Caused By ‘Very Disruptive’ Trump Tariffs Trump’s Doctor Issues a Glowing Report On His Physical — Touts Perfect Score on Cognitive Test and ‘Frequent Victories in Golf Events’ ‘It’s a Contradictory Message!’ CNN’s Jake Tapper Grills Kevin Hassett About Trump’s Administration’s Mixed Messages on Tariffs Josh Shapiro and Family Evacuated After Arsonist Strikes PA Governor’s Mansion, Authorities Say NBC’s Kristen Welker Confronts Peter Navarro About Elon Musk Attacking Him: He Called You ‘Dumber Than a Sack of Bricks’ Chuck Todd Breaks Down Why Trump’s Tariff-Stock Market Debacle is ‘Politically Catastrophic’ Tommy Christopher Apr 12th, 2025, 1:39 pm Twitter share button Independent media entrepreneur and broadcast veteran Chuck Todd said that President Donald Trump’s stock market-threatening tariff machinations could be “politically catastrophic” — and might even fracture his support among Republicans. Todd is the guest on this week’s edition of Mediaite’s new Press Club podcast , hosted by Aidan McLaughlin , to discuss the media, the news of the day, and life after NBC News, which he left in January after nearly two decades. In the episode, now out on YouTube and podcast platforms, McLaughlin asked Todd about Trump’s tariffs and the resulting stock market roller coaster this week: AIDAN MCLAUGHLIN: Trump finally consummated his decades-long flirtation with tariffs. Have you looked at your portfolio this week? CHUCK TODD: I’m over 50, I’m having to look at it every hour. No, I mean, and that’s this, that’s the dirty little, you know what I took his biggest political problem, is that when you’re of a certain age, you start looking at this every day. You know, this whole, “well people don’t look at the stock market every day.”. Yeah, but the people who are most likely to vote in midterms, they do. They pay attention to if the Social Security office is taking their phone calls. Like, he is rattling constituencies that are the ones that are most likely to show up to vote. Right? So it’s just one of those, you’re like, this is why this could be politically catastrophic. AIDAN MCLAUGHLIN: So yeah, so we’re in very much uncharted territory right now. CHUCK TODD: And then some. Todd went on to explain why the chaotic tariff roll-out could be Trump’s “Afghanistan moment” — a reference to the U.S. withdrawal from Afghanistan that led to a collapse of former President Joe Biden’s approval ratings, a collapse he never recovered from. He explained: Afghanistan became a competency question. And I think this tariff business for Trump becomes a competency question. ‘Wait a minute, you went about this all wrong and you caused an economic tsunami. We agree we needed to do it, but you don’t know how to do.’ And in some ways, competency is actually more lethal here than the ideological distinction between the two. And this is why I think he’s probably never going to be over — barring some we don’t know, rallying around the president because we’re in war or something like this — I don’t if he ever gets over 45 [percent approval rating] again. Watch above via Mediaite’s Press Club podcast . Watch and subscribe to Mediaite’s YouTube for new episodes of Press Club, and listen to the show on Spotify and Apple Podcasts . Tags: Aidan McLaughlin Chuck Todd Donald Trump Press Club Trump tariffs Previous Post Next Post Previous Post Next Post Load Comments Please enable JavaScript to view the comments powered by Disqus. Tips Have a tip or story idea? Email us. Or to keep it anonymous, click here . Mediaite on Popin Button Popout Button Close Button Did MAGA Meltdown Get Trump to Cave on Tariffs? Play Button White House Drama? Elon Musk and Peter Navarro’s Insult War Turns UGLY Play Button Chuck Todd on Trump, 'Catastrophic' Tariffs, and Future of Media Subscribe to Mediaite: Most Popular ‘So-Called Secretary of Defense’: Dem Leader Hakeem Jeffries Rips Pete Hegseth as ‘Dumb Effing Individual’ ‘They Didn’t Call Me Back!’ Rudy Giuliani Blasts ‘Crooked’ FBI Under Trump Bill Maher Gets Defensive With WaPo Reporter Over Trump Meetup: ‘You Don’t Have to Patronize Me, Dude!’ Democratic Gov. Mocked for Brutal Viral Photo of Her ‘Hiding’ Behind Binders at WH Meeting With Trump Bill Maher Praises ‘Gracious,’ ‘Measured’ Trump After Wild White House Meeting: ‘You Can Hate Me For It, But I’m Not a Liar’ You may also like: Democratic Gov. Mocked for Brutal Viral Photo of Her ‘Hiding’ Behind Binders at WH Meeting With Trump Kipp Jones Apr 12th, 2025, 3:24 pm Bill Maher Gets Defensive With WaPo Reporter Over Trump Meetup: ‘You Don’t Have to Patronize Me, Dude!’ Kipp Jones Apr 12th, 2025, 12:46 pm Fox’s Gutfeld Slams Chuck Todd Admitting Media’s ‘Fear’ of Reporting on Biden Decline: ‘Blow the Whistle DURING the Play’ Zachary Leeman Apr 12th, 2025, 12:42 pm BREAKING: Trump Exempts Phones, Computers and More From Tariffs Zachary Leeman Apr 12th, 2025, 10:13 am Most Shocking Moments Out of Bill Maher’s Dinner with Trump, Including Orangutan Lawsuit Talk, 2020 Admission, and Autographed Insults Zachary Leeman Apr 12th, 2025, 9:59 am Bill Maher Praises ‘Gracious,’ ‘Measured’ Trump After Wild White House Meeting: ‘You Can Hate Me For It, But I’m Not a Liar’ Zachary Leeman Apr 12th, 2025, 8:54 am", "sentiment": "NEGATIVE", "sentiment_score": -0.8, "url": "https://www.mediaite.com/news/politically-catastrophic-chuck-todd-breaks-down-why-trumps-tariff-stock-market-debacle-is-his-afghanistan-moment/", "source": "Mediaite", "published_at": "2025-04-12T17:39:03"}, {"id": 63, "title": "Apple, Nvidia, and Microsoft can 'breathe a huge sigh of relief' after Trump's China tariff exemptions", "content": "Trump tariff exemptions a big boost for Apple, Nvidia, Microsoft Search Free Newsletters Editions Español Deutsch Français About We may earn a commission from links on this page News The Trump administration carved out exemptions from huge tariffs for smartphones, laptop computers, and chips By Quartz Staff Published Yesterday We may earn a commission from links on this page . Photo : Justin Sullivan ( Getty Images ) In This Story AAPL NVDA MSFT The ever-growing U.S. tariffs on imports from China won’t bite Big Tech so badly after all, after the Trump administration late Friday laid out significant exemptions from its wider trade war that include smartphones, laptop computers, chips, and more. Suggested Reading Netflix, Goldman Sachs, Citigroup, and more stocks to watch this week The 8 most chaotic airports in America Apple's 'complete disaster,' Microsoft's tariff uncertainty, and Amazon's vibe: Tech news roundup How Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off English Share this Video Facebook Twitter Email Reddit Link view video How Trump’s tariffs could make your iPhone cost $3,500 Suggested Reading Netflix, Goldman Sachs, Citigroup, and more stocks to watch this week The 8 most chaotic airports in America Apple's 'complete disaster,' Microsoft's tariff uncertainty, and Amazon's vibe: Tech news roundup How Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off English Share this Video Facebook Twitter Email Reddit Link How Trump’s tariffs could make your iPhone cost $3,500 The exemptions , published by U.S. Customs and Border Protection, amount to a huge break for tech giants such as Apple ( AAPL ), Nvidia ( NVDA ), and Microsoft ( MSFT ), and for the broader tech industry, even as uncertainty persists over the direction of President Donald Trump’s trade war. It means some of the most crucial and high-end technology imports — which overwhelmingly aren’t made in the U.S. — won’t be subject to Trump’s 125% tariff on China, or his baseline 10% tariff on almost every other country. Advertisement Related Content Mag 7, other stocks fall after Trump's tariff announcement Apple, Nvidia, and Microsoft will race to $4 trillion market caps this year, analyst says Related Content Mag 7, other stocks fall after Trump's tariff announcement Apple, Nvidia, and Microsoft will race to $4 trillion market caps this year, analyst says A Wall Street analyst quickly called it “the best news possible for tech investors.” Advertisement “The U.S. tech industry has a loud voice and despite initial strong pushback against exemptions within the White House, the reality of the situation was finally recognized in the Beltway,” Wedbush Securities analyst Dan Ives wrote in a note Saturday. “There is still clear uncertainty and volatility ahead with these China negotiations. Big Tech firms like Apple, Nvidia, Microsoft and the broader tech industry can breathe a huge sigh of relief this weekend into Monday.” Advertisement The exemptions follow a pattern from Trump’s first term, when Apple in particular saw significant success in lobbying Trump for trade war carveouts. Making products such as the iPhone in America would be almost economically impossible . Wedbush had warned earlier this month that Apple faced a “complete disaster” from the China tariffs. And the Trump administration’s move came as its trade war has driven days of volatility in financial markets, as well as cratering consumer confidence and growing recession fears . Advertisement Ives called the exemptions “a big step forward for U.S. tech to get these exemptions and the most bullish news we could have heard this weekend. ... Big Tech is back off the cliff with these exemptions and this changes the entire situation for tech stocks with this black swan event for the industry removed.” 📬 Sign up for the Daily Brief Our free, fast, and fun briefing on the global economy, delivered every weekday morning.", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://qz.com/trump-tariff-exemptions-china-apple-microsoft-nvidia-1851775941", "source": "Quartz India", "published_at": "2025-04-12T17:39:00"}, {"id": 64, "title": "Doomed Hudson River helicopter was once featured in video touting safety record — as beleaguered company says it’s not operating until further notice", "content": "Hudson River helicopter once featured in video about safety The New York City tour helicopter that plummeted into the Hudson River Thursday , killing six people, was once used in a now-chilling promotional video trumpeting the alleged safety record of the sightseeing company, which has stalled operations indefinitely. A representative for New York Helicopters said the company is “not operating until further notice” — just days after a family of five visiting from Spain and their pilot were killed in the horrific crash. In a statement posted to its site, the firm said it was “profoundly saddened by the tragic accident and loss of life that occurred on April 10, 2025, involving one of our helicopters in the Hudson River.” 4 The sightseeing helicopter was once featured in a video touting the tour company’s safety record. Facebook/New York Helicopter The statement insisted “the safety and well-being of our passengers and crew has always been the cornerstone of our operations,” and that company’s “immediate focus is supporting the families and their loved ones affected by this tragedy, as well as fully cooperating with the FAA and NTSB investigations.” Footage of the doomed Bell 206L helicopter is still available on the firm’s website under a section called “Why Choose Us,” and YouTube . 4 Crews work to remove a crashed helicopter from the Hudson River on April 10, 2025 in Jersey City, New Jersey. Getty Images In the video, which doesn’t have sound, a man is seen checking the copter ahead of a planned takeoff. “We have an industry-leading safety record,” the website states alongside the clip. Explore More Whitmer mocked for hiding her face from Oval Office cameras before Trump meeting in viral photo Trump appears to snub RFK Jr.'s wife Cheryl Hines while entering UFC fights Sen. Bernie Sanders delivers ranting speech at Coachella festival as Trump thrills UFC crowd with star-studded cast in Florida The ill-fated helicopter took off from Manhattan’s Downtown Skyport at roughly 1:50 p.m. Thursday, with Siemens executive Agustin Escober, his wife, Mercè Camprubí Montal , and their three young children — Augustin, 10, Mercedes, 8, and Victor, 4 — aboard. Stay up to date on the Hudson River helicopter crash: Pilot of doomed Hudson River helicopter ID’d as Navy SEAL veteran who had posted chilling video month before death Mom killed in Hudson River helicopter crash was from FC Barcelona soccer dynasty Cause of Hudson River helicopter crash will take ‘quite some time’ to determine, NTSB says, revealing rotors still missing Hudson River helicopter crash investigators will probe pilot’s experience, possible mechanical failure: sources Doomed Hudson River helicopter was once featured in video touting safety record — as beleaguered company says it’s not operating until further notice Devastated brother of mom killed in Hudson River helicopter crash delivers heartbreaking tribute before laying flowers at site of tragedy The family, who hailed from Barcelona, Spain, were flown by Sean Johnson , 36, a Navy veteran who recently moved to the Big Apple for his still-young aviation career. 4 A New York Police Department scuba team prepares to dive, Friday, April 11, 2025, where a sightseeing helicopter crashed into the Hudson River. AP The chopper crashed near the shoreline of Jersey City, New Jersey, moments after the main and tail rotor detached from the body of the aircraft. The exact cause of the crash has yet to be determined and could take weeks, officials said. The safety video shows the black and white copter’s main rotor blade tied to a dolly. The man in the video then unties the rope from the dolly and walks around the aircraft pulling the main rotor via the rope. 4 New York City Mayor Eric Adams speaks during a press conference, after the helicopter crash. REUTERS The man is also filmed climbing onto the side of the chopper and inspecting the engine and drive shaft before hopping into the cockpit, where he conducts more checks of the aircraft’s tools. The Bell 206L was manufactured in 2004 and had already logged 12,728 hours of flight time when it was forced into repair back in September for a mechanical issue with its transmission assembly. In April 2023, the FAA issued two safety recalls for all Bell 206L model helicopters. Trending Now on NYPost.com This story has been shared 64,018 times. 64,018 Jordan Spieth fumes over Masters censorship of 'frustrating' problem This story has been shared 57,678 times. 57,678 TV reporter horrified by 9-year-old boy’s ‘alarming’ comment to her This story has been shared 44,502 times. 44,502 Whitmer mocked for hiding her face from Oval Office cameras before Trump meeting in viral photo This story has been shared 41,548 times. 41,548 Trump appears to snub RFK Jr.'s wife Cheryl Hines while entering UFC fights Most Commented Join the conversation This story has 3.9K comments. 3.9K Trump reveals 90-day tariff pause for most countries, raises China rate to 125% — as he explains ‘yippy’ reason for stoppage, boasts about stock rebound This story has 3K comments. 3K Space Force base commander fired after astonishing email about JD Vance surfaces This story has 2.4K comments. 2.4K China hits US with 84% retaliatory tariffs after Trump’s sweeping levies go into effect Columnists Kirsten Fleming Viral CNN clip of Anderson Cooper getting schooled on pronouns exposes major fault in Dem Party Rikki Schlott Teen tech whiz kid with 4.0 GPA made $30M off his startup last year — but he was still rejected by 15 colleges See All Columnists Page Six Style Britney Spears shares cheeky lingerie photo after ditching her clothes on the beach Lady Gaga treats fans to a fashion feast during Coachella 2025 performance New York Liberty mascot Ellie the Elephant tells us what’s inside her Telfar tote: ‘It’s giving iconic’ Now on Page Six Lizzo takes a swipe at Trump tariffs with cheeky t-shirt during ‘SNL’ performance Lauren Sanchez and her hand-picked all-female team will make history on space flight — and scientists say it’s a good thing Rosie O’Donnell jokingly reveals ‘straight’ love affair with convicted killer Lyle Menendez See All Will DJ LeMahieu's age hamper his recovery? | The Injury Report The sightseeing helicopter was once featured in a video touting the tour company's safety record. Facebook/New York Helicopter Crews work to remove a crashed helicopter from the Hudson River on April 10, 2025 in Jersey City, New Jersey. Getty Images A New York Police Department scuba team prepares to dive, Friday, April 11, 2025, where a sightseeing helicopter crashed into the Hudson River. AP New York City Mayor Eric Adams speaks during a press conference, after the helicopter crash. REUTERS Advertisement Page Six Britney Spears shares cheeky lingerie photo after ditching her clothes on the beach NYPost Jordan Spieth fumes over Masters censorship of 'frustrating' problem", "sentiment": "NEGATIVE", "sentiment_score": -0.9, "url": "https://nypost.com/2025/04/12/us-news/hudson-river-helicopter-once-featured-in-video-about-safety/", "source": "New York Post", "published_at": "2025-04-12T17:36:04"}, {"id": 65, "title": "Trump administration says will exclude some electronics from reciprocal tariffs", "content": "Trump administration says will exclude some electronics from reciprocal tariffs – Statetimes The Bold Voice of J&K Likes Followers Subscribers Trump administration says will exclude some electronics from reciprocal tariffs Latest News World By statetimes_editor Last updated Apr 12, 2025 0 84 Share AGENCY WASHINGTON: The Trump administration late Friday said they would exclude electronics like smartphones and laptops from reciprocal tariffs, a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the US. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia. US Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145 per cent tariffs levied on China or the 10 per cent baseline tariffs elsewhere. It’s the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. The goal is to encourage more domestic manufacturing. But the exemptions seem to acknowledge that the current electronics supply chain is virtually all in Asia and it will be challenging to shift that to the US. For example, about 90 per cent of iPhones are produced and assembled in China, according to Wedbush Securities. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing US Big Tech,” said Wedbush analyst Dan Ives in a research note. Trump previously said he would consider exempting some companies from tariffs. Neither Apple nor Samsung responded to a request for comment early Saturday. Nvidia declined to comment. The White House did not immediately respond to a request for comment on Saturday. (PTI) 0 84 Share Facebook Twitter Google+ ReddIt WhatsApp Pinterest Email statetimes_editor Prev Post UPI faces third outage in less than a fortnight, transactions impacted Next Post Student killed in birthday party brawl in Poonch; 4 ‘friends’ nabbed Leave a comment Popular Posts Districts ‘Enemy nation’ continuously sending terrorists… J&K Crime Two revenue officials booked for illegal mutation of govt… Jammu and Kashmir Around 20 pc posts lying vacant across departments in… India PM Modi pays tribute to Jallianwala Bagh massacre victims WP Twitter Auto Publish Powered By : XYZScripts.com", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://statetimes.in/trump-administration-says-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "Statetimes.in", "published_at": "2025-04-12T17:34:48"}, {"id": 21, "title": "Show HN: A Beautiful, Minimal Habit Tracker for Humans", "content": "‎HabitNoon- Habit, Goal Tracker on the App Store Screenshots Description HabitNoon helps you build better habits and stay consistent. Whether you want to exercise daily, meditate, or improve productivity, HabitNoon makes habit tracking easy with beautiful grids, heatmaps, and interactive widgets. Features: Easy Habit Tracking – Set daily, weekly, or custom habits. Beautiful Grids & Heatmaps – Visualize your progress at a glance. Interactive Widgets – Track habits from your home screen. Streaks & Progress Insights – Stay motivated with streak tracking. Smart Reminders – Get gentle reminders to stay on track. Dark Mode & Themes – Customize your habit tracker. Apple Watch Support – Check habits right from your wrist. Start tracking your habits today with HabitNoon! Terms of Use: https://www.habitnoon.app/terms-of-use Ratings and Reviews 5.0 out of 5 1 Rating 1 Rating *threethirtythree* , 04/09/2025 Simple, works great, and love the widget! I’d been looking for a simple option that works across devices for a low price and, ideally, not a subscription! This is a great app for all of those reasons. Plus, the developer is super responsive and helpful. Free to try it out!! App Privacy The developer, Vidisha Srivastava , indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy . Data Not Collected The developer does not collect any data from this app. Privacy practices may vary, for example, based on the features you use or your age. Learn More Information Seller Vidisha Srivastava Size 15.2 MB Category Productivity Compatibility iPhone Requires iOS 17.0 or later. Mac Requires macOS 14.0 or later and a Mac with Apple M1 chip or later. Apple Watch Requires watchOS 11.2 or later. Apple Vision Requires visionOS 1.0 or later. Languages English Age Rating 4+ Copyright © 2025 Price Free In-App Purchases HabitNoon- Habit, Goal Tracker $9.99 App Support Privacy Policy App Support Privacy Policy You Might Also Like Simple - ADHD Planner & Focus Productivity Easlo Experiments Productivity WeeNote Notes and Widget Productivity Habit Tracker - Habit Radar Productivity Goals Oriented Tracker: Griply Productivity ClipyBoard AutoPaste Clipboard Productivity Copyright © 2025 Apple Inc. All rights reserved. Internet Service Terms App Store & Privacy Cookie Warning Support", "sentiment": "POSITIVE", "sentiment_score": 0.9, "url": "https://apps.apple.com/us/app/habitnoon-habit-goal-tracker/id6742749972", "source": "Apple Newsroom", "published_at": "2025-04-12T17:32:14"}, {"id": 22, "title": "Jim Cramer On Apple Inc. (AAPL): “Own Apple, Don’t Trade It!”", "content": "Jim Cramer On Apple Inc. (AAPL): “Own Apple, Don’t Trade It!” Why did Trump launch a chip imports probe? How will Meta's antitrust case affect its empire? Why is ExxonMobil stock undervalued? How will Argentina's IMF loan reshape policies? What causes tech tariff exemptions to be temporary? Why are investors wary amid policy zigzags? How will U.S.-Saudi nuclear deal impact energy? What fuels the record SOL-to-ETH ratio? Why did British Steel seek external help? Jim Cramer On Apple Inc. (AAPL): “Own Apple, Don’t Trade It!” finance.yahoo.com/news/jim-cramer-apple-inc-aapl-171954377.html In This Article: We recently published a list of Jim Cramer Discussed These 12 Stocks. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other stocks that Jim Cramer discussed. On Thursday, Jim Cramer, host of Mad Money, described the 145% duty… This story appeared on finance.yahoo.com , 2025-04-12 17:19:54. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/daa159a4837b5ce1", "source": "Biztoc.com", "published_at": "2025-04-12T17:31:59"}, {"id": 23, "title": "Gaga's Coachella Reach + Tom Chase, Porn Legend, Reclaims His Bone Throne + Gretchen Whitmer's Shame + Maher Gushes Over GRACIOUS Trump + MORE! — 6-PACK", "content": "ABOVE: Gaga reached out and touched — porn star Brogan's hand! — during her epic Coachella set.\nBELOW: Keep reading for Tom Chase's new porn, Trump's Apple reprieve and more ...\n\nTom Chase is not don… [+760 chars]", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.boyculture.com/boy_culture/2025/04/trump-whitmer-tom-chase-gay-adult-star-maher.html", "source": "Boyculture.com", "published_at": "2025-04-12T17:30:08"}, {"id": 24, "title": "Patrick Schwarzenegger Dances at 'White Lotus' Costar Lisa’s Coachella Set", "content": "Patrick Schwarzenegger Dances at 'White Lotus' Costar Lisa’s Coachella Set ​", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://people.com/patrick-schwarzenegger-dances-at-white-lotus-costar-lisa-coachella-set-instagram-11714243", "source": "PEOPLE", "published_at": "2025-04-12T17:29:43"}, {"id": 25, "title": "Big law in Trump's crosshairs", "content": "Trump targets big law firms with executive orders : Consider This from NPR : NPR Accessibility links Skip to main content Keyboard shortcuts for audio player Trump targets big law firms with executive orders : Consider This from NPR For weeks, President Trump has been targeting certain law firms with executive orders. Some have fought back, but others have cut deals to avoid the damage. For our weekly Reporter's Notebook series, we dive into this legal drama with NPR's Justice Correspondent Ryan Lucas, to see how this use of executive power is changing the landscape of the American legal system. For sponsor-free episodes of Consider This, sign up for C onsider This+ via Apple Podcasts or at plus.npr.org . Email us at considerthis@npr.org . Consider This from NPR NPR Consider This from NPR LISTEN & FOLLOW NPR App Apple Podcasts Spotify Amazon Music iHeart Radio YouTube Music RSS link Big law in Trump's crosshairs April 12, 2025 1:20 PM ET Big law in Trump's crosshairs Listen · 11:36 11:36 Toggle more options Download Embed Embed < iframe src=\"https://www.npr.org/player/embed/1249801195/1269103672\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\"> Enlarge this image WASHINGTON, DC - APRIL 09: U.S. President Donald Trump speaks to reporters as he signs executive orders in the Oval Office. (Photo by Anna Moneymaker/Getty Images) Anna Moneymaker/Getty Images hide caption toggle caption Anna Moneymaker/Getty Images WASHINGTON, DC - APRIL 09: U.S. President Donald Trump speaks to reporters as he signs executive orders in the Oval Office. (Photo by Anna Moneymaker/Getty Images) Anna Moneymaker/Getty Images For weeks, President Trump has been targeting certain law firms with executive orders. Some have fought back, but others have cut deals to avoid the damage. For our weekly Reporter's Notebook series, we dive into this legal drama with NPR's Justice Correspondent Ryan Lucas, to see how this use of executive power is changing the landscape of the American legal system. For sponsor-free episodes of Consider This, sign up for C onsider This+ via Apple Podcasts or at plus.npr.org . Email us at considerthis@npr.org . Sponsor Message This episode was produced by Noah Caldwell. It was edited by Adam Raney and Courtney Dorning. Our executive producer is Sami Yenigun. Facebook Flipboard Email Sponsor Message Sponsor Message Become an NPR sponsor", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.npr.org/2026/01/01/1249801195/trump-goes-after-big-law", "source": "NPR", "published_at": "2025-04-12T17:20:33"}, {"id": 26, "title": "Trump’s sudden tariff exemptions on key tech imports remove a ‘doomsday scenario’ for the industry, top analyst says", "content": "Trump’s sudden tariff exemptions on key tech imports remove a ‘doomsday scenario’ for the industry, top analyst says Why did Trump launch a chip imports probe? How will Meta's antitrust case affect its empire? Why is ExxonMobil stock undervalued? How will Argentina's IMF loan reshape policies? What causes tech tariff exemptions to be temporary? Why are investors wary amid policy zigzags? How will U.S.-Saudi nuclear deal impact energy? What fuels the record SOL-to-ETH ratio? Why did British Steel seek external help? Trump’s sudden tariff exemptions on key tech imports remove a ‘doomsday scenario’ for the industry, top analyst says fortune.com/2025/04/12/trump-tariff-exemptions-tech-imports-black-swan-event-dan-ives The Trump administration announced numerous exemptions late Friday night to his \"reciprocal tariffs,\" including popular consumer electronics and critical tech components. That offers a huge reprieve for US technology leaders like Apple and Nvidia, prompting Wedbush analyst Dan Ives to… This story appeared on fortune.com , 2025-04-12 17:16:54. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/52e7bb5a5fe44f9c", "source": "Biztoc.com", "published_at": "2025-04-12T17:20:21"}, {"id": 27, "title": "Accessory Maker Anker Raises Prices Following US Tariffs", "content": "Accessory Maker Anker Raises Prices Following US Tariffs Oliver Haslam · April 12, 2025 Accessory Maker Anker Raises Prices Following US Tariffs Anker, the Chinese accessory maker, has raised its prices on Amazon following the application of new tariffs brought about by the United States government. Reuters reports that the company, which makes phone cases, power banks, adapters, cables, and more, raised prices on a fifth of its products since Thursday. The move comes as the company passes the cost of US tariffs onto its US-based customers. Some 127 Anker products have seen an average increase of 18% since Thursday last week, with the majority of those occurring after Monday, April 7, when U.S. President Donald Trump added an extra 50% import duty on Chinese goods, according to data from e-commerce services provider SmartScout. Reuters notes that, on an investor call earlier in the week, Anker had said that it was able to raise prices “as it had bargaining power and because its rivals were mainly Chinese and under similar tariff pressure, but did not provide specifics.” Ultimately, more companies could well choose to follow suit. Tariffs make it more costly for companies to bring goods from specific countries into the United States. One way that those companies can negate the additional costs while protecting their profits is to increase prices, effectively passing the cost of the tariffs onto customers. The result is that US-based customers pay more for products as a result of the tariffs that were imposed by its leaders. You may also like to check out: Download: iOS 18.4 Final IPSW Links, OTA Update For iPhone, iPadOS 18.4 For iPad Released Jailbreak iOS 18.4 Status For iPhone And iPad Update iOS 18 Hidden Features For iPhone And iPad [100+ List] How To Fix Bad iOS 18 Battery Life Drain On iPhone Fix iOS 18 WiFi: Keeps Dropping, Not Working, Disconnecting Or Slow? Here’s What To Do You can follow us on X , or Instagram , subscribe to our YouTube channel and even like our Facebook page to keep yourself updated on all the latest from Microsoft, Google, Apple, and the Web TRENDING NOW iPhone Price Hike Fears Laid To Rest After Tax Exemptions Tesla’s 2025 Spring Update Brings B-Pillar Recording, Dashcam Upgrades, and More This App Just Brought ChatGPT To The iPhone 3GS Apple Watch Could Get Apple Intelligence And A visionOS-Inspired Redesign Apple’s First Foldable iPad Could Now Launch In 2026, Analyst Says Microsoft Becomes World’s Most-Valuable Public Company, Ousting Apple Thanks To Tariffs Meta Is Finally Working On An Instagram iPad App, Insider Claims Latest iOS 19 Design Leak Hints At New Icons And More Apple Launches Immersive Video Utility App For Mac And Vision Pro Creators New 20th-Anniversary iPhone 19 Pro Design Tipped FOR YOU How To Install iOS 18 And iPadOS 18 Final Version The Correct Way Here’s What To Expect From Apple At ‘It’s Glowtime’ September 9 Event iOS 18.1 Release Will Bring These Features To iPhone Later This Year And Beyond iOS 18.3.2 Battery Life Drain Test Brings Bad News For iPhone 16 Owners iOS 18.2 To Bring iOS 18.1 Apple Intelligence Delayed Features iPhone 16 Pro Max Tipped For New, Denser Battery And Altered Housing How To Fix Bad iOS 18 Battery Life Drain On iPhone Download: iOS 18.1 Public Beta 2, iPadOS 18.1 Public Beta 2 And More Released Start typing to see results or hit ESC to close Apple iPhone deals iPad Android See all results SUBSCRIBE Join 100k+ other tech lovers and get the latest news in your inbox [mc4wp_form id=\"389\"]", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.redmondpie.com/accessory-maker-anker-raises-prices-following-us-tariffs/", "source": "redmondpie.com", "published_at": "2025-04-12T17:20:07"}, {"id": 28, "title": "Jim Cramer On Apple Inc. (AAPL): “Own Apple, Don’t Trade It!”", "content": "If you click 'Accept all', we and our partners, including 239 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+702 chars]", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_bd0443dc-dee3-4e29-91aa-6ebc603a20a4", "source": "Yahoo Entertainment", "published_at": "2025-04-12T17:19:54"}, {"id": 29, "title": "Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns", "content": "Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Home Breaking News Hacking Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Pierluigi Paganini April 12, 2025 Fortinet warns attackers can keep read-only access to FortiGate devices even after the original vulnerability is patched. Fortinet warns that threat actors can retain read-only access to FortiGate devices even after the original vulnerability used for the breach has been patched. The cybersecurity firm revealed that attackers exploited known FortiGate flaws like CVE-2022-42475 , CVE-2023-27997 , and CVE-2024-21762 to gain persistent read-only access via a symlink in SSL-VPN language folders. “A threat actor used a known vulnerability to implement read-only access to vulnerable FortiGate devices. This was achieved via creating a symbolic link connecting the user filesystem and the root filesystem in a folder used to serve language files for the SSL-VPN. This modification took place in the user filesystem and avoided detection.” reads the advisory published by Fortinet. “Therefore, even if the customer device was updated with FortiOS versions that addressed the original vulnerabilities, this symbolic link may have been left behind, allowing the threat actor to maintain read-only access to files on the device’s file system, which may include configurations.” Fortinet pointed out that only devices with SSL-VPN enabled are impacted. The company added that scans show the attacks weren’t limited to any specific region or industry. Fortinet mitigated the attack by deploying AV/IPS signatures, updating releases to block the symbolic link, and urging customers to patch devices while maintaining transparency. The company did not link the attacks to a certain threat actor, however, the investigation is still ongoing. Below are the FortiOS mitigations released by the company: FortiOS 7.6.2, 7.4.7, 7.2.11 & 7.0.17, 6.4.16: The SSL-VPN UI has been modified to prevent the serving of such malicious symbolic links. FortiOS 7.4, 7.2, 7.0, 6.4: The symbolic link was flagged as malicious by the AV/IPS engine so that it would be automatically removed if the engine was licensed and enabled. FortiOS 7.6.2, 7.4.7, 7.2.11 & 7.0.17, 6.4.16: Upgrading to this release will remove the malicious symbolic link. The cybersecurity vendor notified impacted customers and provided the following mitigations: Treat all configuration as potentially compromised and follow the recommended steps below to recover: Upgrade all devices to 7.6.2, 7.4.7, 7.2.11 & 7.0.17 or 6.4.16. Review the configuration of all devices. Follow me on Twitter: @securityaffairs and Facebook and Mastodon Pierluigi Paganini ( SecurityAffairs – hacking, FortiOS) facebook linkedin twitter Fortinet FortiOS Hacking hacking news information security news IT Information Security Pierluigi Paganini Security Affairs Security News you might also like Pierluigi Paganini April 13, 2025 SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41 Read more Pierluigi Paganini April 13, 2025 Security Affairs newsletter Round 519 by Pierluigi Paganini – INTERNATIONAL EDITION Read more leave a comment newsletter Subscribe to my email list and stay up-to-date! recent articles SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41 Malware / April 13, 2025 Security Affairs newsletter Round 519 by Pierluigi Paganini – INTERNATIONAL EDITION Breaking News / April 13, 2025 China admitted its role in Volt Typhoon cyberattacks on U.S. infrastructure APT / April 13, 2025 Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Hacking / April 12, 2025 Attackers are exploiting recently disclosed OttoKit WordPress plugin flaw Security / April 12, 2025 We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://securityaffairs.com/176473/hacking/symbolic-link-trick-lets-attackers-bypass-fortigate-patches-fortinet-warns.html", "source": "Securityaffairs.com", "published_at": "2025-04-12T17:17:30"}, {"id": 30, "title": "Trump administration says it will exclude some electronics from reciprocal tariffs", "content": "Trump administration says it will exclude some electronics from reciprocal tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 9:38 AM Updated: April 13, 2025 at 9:05 AM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS FILE - A police vehicle flashes its lights in Philadelphia, Monday, Jan. 17, 2022. (AP Photo/Matt Rourke, File) 2 hours ago Man arrested, accused of running female over with vehicle, San Antonio police say Read full article: Man arrested, accused of running female over with vehicle, San Antonio police say A pedestrian was hit and killed while walking on Loop 410, according to San Antonio police. 2 hours ago Pedestrian hit, killed while walking on Loop 410, SAPD says Read full article: Pedestrian hit, killed while walking on Loop 410, SAPD says Three people were hospitalized after a shooting on the Southwest Side, according to San Antonio police. 3 hours ago 3 hospitalized after shooting on Southwest Side, SAPD says Read full article: 3 hospitalized after shooting on Southwest Side, SAPD says As April’s full moon rose on Saturday night, several KSAT viewers shared photos of a “mysterious ring” and a “flying object” in the sky. 33 minutes ago KSAT viewers share sightings of ‘mysterious ring’ illuminating sky during the pink moon Read full article: KSAT viewers share sightings of ‘mysterious ring’ illuminating sky during the pink moon KSAT DEALS Jump for joy - deals are here! SA Live deals this week: Stack up the savings Read full article: SA Live deals this week: Stack up the savings Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Business Trump administration says it will exclude some electronics from reciprocal tariffs Mae Anderson Associated Press Published: April 12, 2025 at 9:38 AM Updated: April 13, 2025 at 9:05 AM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Loading... Recommended Videos KSAT DEALS Jump for joy - deals are here! SA Live deals this week: Stack up the savings Read full article: SA Live deals this week: Stack up the savings Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.ksat.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "KSAT San Antonio", "published_at": "2025-04-12T17:15:39"}, {"id": 31, "title": "Trump exempts smartphones, laptops, and semiconductors from new tariffs", "content": "Trump exempts smartphones, laptops, and semiconductors from new tariffs | TechCrunch Trump exempts smartphones, laptops, and semiconductors from new tariffs | TechCrunch Image Credits: Andrew Harnik / Getty Images Government & Policy Trump exempts smartphones, laptops, and semiconductors from new tariffs Anthony Ha 10:11 AM PDT · April 12, 2025 The Trump administration is carving out big tariff exemptions for the tech industry. While President Donald Trump said Wednesday that he would delay many of the market-shaking tariffs that he’d announced the previous week, he kept a universal baseline 10% tariff in place, while also increasing tariffs on Chinese goods to 125% (on top of a 20% tariff that he’d already imposed on goods from China). There’s been plenty of speculation about what the tariffs will mean for the tech industry , which manufactures many consumer electronics in China and elsewhere abroad. One of Trump’s stated goals is to bring manufacturing back to the United States, but others believe the dream of an American-made iPhone is a fantasy . Those debates may be paused after Friday evening, when U.S. Customs and Border Protection posted a list of product categories that are “excluded from the reciprocal tariffs imposed under Executive Order 14257,” with the exclusions backdated to April 5. Those categories appear to include smartphones, laptops, hard drives, and semiconductors. Those products will all be exempt from both the 125% tariff on goods from China, as well as the universal baseline tariff. (Other tariffs, such as the previous 20% tariff on Chinese goods, would presumably still apply.) Notable Silicon Valley figures led by Elon Musk have joined the Trump administration, while other tech CEOs have been courting Trump, most visibly with millions of dollars donated to his inauguration. Those efforts seemed to bear little fruit — until last night’s announcement, which Daniel Ives, global head of technology research at Wedbush Securities, described as “a dream scenario for tech investors.” Tech giants like Apple and Nvidia are likely celebrating the news, as are U.S. consumers who will avoid a big markup on their next iPhone. But the industry could still be hit with more targeted tariffs and other restrictions. For example, The New York Times reports that the Trump administration is preparing a national security-related investigation into semiconductors. And indeed, U.S. Commerce Secretary Howard Lutnick said Sunday that these products would be included in “the semiconductor tariffs, which are coming in probably a month or two.” This post has been updated with Howard Lutnick’s comments about the tariffs. Topics Apple , Donald Trump , Government & Policy , Hardware , Tariffs Anthony Ha Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. View Bio View Comments Most Popular Jack Dorsey and Elon Musk would like to ‘delete all IP law’ Anthony Ha OpenAI co-founder Ilya Sutskever’s Safe Superintelligence reportedly valued at $32B Anthony Ha Trump exempts smartphones, laptops, and semiconductors from new tariffs Anthony Ha Week in Review: Jeff Bezos’ secret EV startup Karyne Levy Hacked documents reveal guide to serving Elon Musk on private jets Rebecca Bellan OpenAI will soon phase out GPT-4 from ChatGPT Kyle Wiggers Fintech founder charged with fraud after ‘AI’ shopping app found to be powered by humans in the Philippines Charles Rollet Loading the next article Error loading the next article", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://techcrunch.com/2025/04/12/trump-exempts-smartphones-laptops-and-semiconductors-from-new-tariffs/", "source": "TechCrunch", "published_at": "2025-04-12T17:11:51"}, {"id": 32, "title": "Apple’s Mythic Quest has come to an end", "content": "Apple’s Mythic Quest has come to an end | The Verge Skip to main content The homepage The Verge The Verge logo. The homepage The Verge The Verge logo. Menu Expand Navigation Drawer The Verge The Verge logo. Login / Sign Up close Close Search Subscribe Facebook Threads Instagram Youtube RSS Comments Drawer Entertainment / TV Shows Apple’s Mythic Quest has come to an end The fourth season finale episode, now the last of the series, will get a new ending next week. The fourth season finale episode, now the last of the series, will get a new ending next week. by Wes Davis Apr 12, 2025, 5:11 PM UTC Link Facebook Threads Rob McIlhenney and Charlotte Nicdao in Mythic Quest. Image: Apple Wes Davis is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Mythic Quest, the Apple TV Plus comedy about a game studio, isn’t getting a fifth season, reports Variety . And, like a developer issuing a farewell patch, Apple is updating the final episode of season four with a new “goodbye” ending next week. Variety published a statement from Mythic Quest ’s executive producers: “Endings are hard. But after four incredible seasons, ‘Mythic Quest’ is coming to a close,” said series executive producers Megan Ganz, David Hornsby, and Rob McElhenney. “We’re so proud of the show and the world we got to build—and deeply grateful to every cast and crew member who poured their heart into it. To all our fans, thank you for playing with us. To our partners at Apple, thank you for believing in the vision from the very beginning. Because endings are hard, with Apple’s blessing we made one final update to our last episode—so we could say goodbye, instead of just game over.” The news comes just weeks after a report that Apple has been losing $1 billion a year on TV Plus. The show just wrapped up its fourth season and released a f our-episode spinoff called Side Quest on March 26th. One of the early Apple TV Plus shows, Mythic Quest tells the story of Mythic Quest Studios, a fictional games studio led by Ian Grimm, Rob McElhenney’s parody of a visionary tech founder bro, and Charlotte Nicdao’s Poppy Li, an awkward but brilliant engineer who serves as his co-creative director. Throughout the series, Mythic Quest sent up the tech industry, from lampooning startup culture to raising some of the gaming world’s darker ethical questions . But to echo an early Verge write-up of Mythic Quest , you don’t need to understand any of that to enjoy the show. Mythic Quest also stars David Hornsby, Ashly Burch, Imani Hakim, Danny Pudi, Jessie Ennis, Naomi Ekperigin, Andrew Friedman, and Michael Naughton. See More : Entertainment Streaming TV Shows Most Popular Most Popular ChatGPT is transforming LinkedIn users into really dull dolls Blue Prince will steal your time just like Balatro Apple’s Mythic Quest has come to an end Bungie’s slick-looking Marathon shooter arrives on September 23rd Trump excludes smartphones, computers, chips from higher tariffs Installer A weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Advertiser Content From This is the title for the native ad More in TV Shows Science Saru’s The Ghost in the Shell series gets a new teaser trailer Doctor Who’s new companion is going to keep him on his toes Mike Flanagan is adapting Stephen King’s Carrie for Amazon A UK edition of Saturday Night Live is premiering in 2026 Black Mirror season 7 tugs at your heartstrings while skewering tech The Last of Us renewed for season 3 just ahead of HBO return Science Saru’s The Ghost in the Shell series gets a new teaser trailer Wes Davis Apr 12 Comments Comment Icon Bubble Doctor Who’s new companion is going to keep him on his toes Charles Pulliam-Moore Apr 11 Comments Comment Icon Bubble Mike Flanagan is adapting Stephen King’s Carrie for Amazon Charles Pulliam-Moore Apr 10 Comments Comment Icon Bubble A UK edition of Saturday Night Live is premiering in 2026 Charles Pulliam-Moore Apr 10 Comments Comment Icon Bubble Black Mirror season 7 tugs at your heartstrings while skewering tech Andrew Webster Apr 10 Comments Comment Icon Bubble The Last of Us renewed for season 3 just ahead of HBO return Jay Peters Apr 9 Comments Comment Icon Bubble Advertiser Content From This is the title for the native ad Top Stories 2:00 PM UTC Wool, water, Wi-Fi: Modernizing an ancient business at the final frontiers of e-commerce 5 minutes ago Smartphone tariffs are coming back in ‘a month or two,’ says Trump admin 6:36 AM UTC Freitag’s newest messenger bag is made from trash to last Apr 12 Bungie’s slick-looking Marathon shooter arrives on September 23rd Apr 12 Blue Prince will steal your time just like Balatro Apr 11 South of Midnight is a game worth hollerin’ about", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.theverge.com/tv/647661/apples-mythic-quest-has-come-to-an-end", "source": "The Verge", "published_at": "2025-04-12T17:11:50"}, {"id": 33, "title": "Apple, Google, Cash App alums ditch Big Tech to build on bitcoin, fueled by VC money and friendly White House", "content": "Apple, Google, Cash App alums ditch Big Tech to build on bitcoin, fueled by VC money and friendly White House Why did Trump launch a chip imports probe? How will Meta's antitrust case affect its empire? Why is ExxonMobil stock undervalued? How will Argentina's IMF loan reshape policies? What causes tech tariff exemptions to be temporary? Why are investors wary amid policy zigzags? How will U.S.-Saudi nuclear deal impact energy? What fuels the record SOL-to-ETH ratio? Why did British Steel seek external help? Apple, Google, Cash App alums ditch Big Tech to build on bitcoin, fueled by VC money and friendly White House cnbc.com/2025/04/12/apple-google-cash-app-alums-ditch-big-tech-to-build-on-bitcoin.html In Austin, Apple, Google, and Cash App alums ditch big paychecks for bitcoin, backed by VCs, crypto friendly policy and belief that this time, it is different. This story appeared on cnbc.com , 2025-04-12 16:50:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/7faf4d69e9dcb862", "source": "Biztoc.com", "published_at": "2025-04-12T17:09:43"}, {"id": 34, "title": "'Mind-blowing': MSNBC host stunned by 'huge' new Trump retreat", "content": "'Mind-blowing': MSNBC host stunned by 'huge' new Trump retreat - Raw Story PLAY GAMES. RAW WORD DAILY JOIN RAW STORY FOR JUST $1 About us Games US NEWS Investigations Opinion video HELP get the newsletter PLAY RAW WORD DAILY. JOIN RAW STORY FOR JUST $1 Home Shop to Support Independent Journalism Trump U.S. News World Science Video Investigations Ethics Policy 'Mind-blowing': MSNBC host stunned by 'huge' new Trump retreat Tom Boggioni April 12, 2025 1:09PM ET Tom Boggioni Senior Editor Tom Boggioni is a writer, born, raised and living in San Diego — where he attended San Diego State University. Prior to writing for Raw Story, he wrote for FireDogLake, blogged as TBogg, and worked in banking, marketing and construction. See Full Bio MSNBC host Stephanie Ruhle (MSNBC screenshot) MSNBC host Stephanie Ruhle appeared with her old hosting partner Ali Velshi on Saturday morning to weigh in on a major announcement from Donald Trump's administration on Chinese imports. In a bulletin posted by U.S. Customs and Border Protection late Friday, the administration announced smartphones, computers, and assorted electronics would be exempt from the ruinous 145% percent tariffs imposed on other Chinese products. As Ruhle, a former hedge fund trader put it, \"This is huge.\" Speaking with Velshi, she elaborated, \"So just imagine all the big electronics that we get that's manufactured in China , right? Chips, semiconductors, TVs, cell phones –– all the big electronics out there are now going to be tariff-free. I mean, Ali, this is extraordinary.\" \"It's kind of like saying we're going to impose 100 plus percent tariffs on everything we buy from China, except for what we actually buy from them,\" she dryly quipped. \"It's sort of crazy because we haven't even started negotiating, you know, this trade war and already we're making this announcement.\" \"It's mind-blowing i n that in the last week what have we done,\" she added. \"The president announced the moves on tariff, we saw the stock market crater, we saw the bond market get whacked, which is the most concerning because it means people don't have faith in the U.S.\". \"We saw consumer confidence absolutely crater and businesses big and small fall into an absolute panic, given what an enormous trading partner China is, but also countries around the world, but focusing just on china, man, if you are [ Apple head] Tim Cook or the other big tech CEO's who gave big and went to Trump's inauguration, you are glad you did that,\" she observed. You can watch below or at the link. - YouTube youtu.be SmartNews Trump News Video For customer support contact support@rawstory.com . Report typos and corrections to corrections@rawstory.com . Stories Chosen For You READ COMMENTS - JOIN THE DISCUSSION Do you support Trump’s recent tariffs imposed on major trade partners? Matt Laslo 'All hands on deck': Democrats unleash new strategy to derail Trump Sabrina Haake Trump is drinking his own Kool-Aid as evidence of his dementia grows John Stoehr Trump is about to target something far more terrifying than tariffs Copyright © 2024 Raw Story Media, Inc. PO Box 21050, Washington, D.C. 20009 | Masthead | Privacy Policy | Manage Preferences | Debug Logs For corrections contact corrections@rawstory.com , for support contact support@rawstory.com . {{ post.roar_specific_data.api_data.analytics }}", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.rawstory.com/trump-mindblowing/", "source": "Raw Story", "published_at": "2025-04-12T17:09:22"}, {"id": 35, "title": "Pokémon X Hatsune Miku \"Project Voltage\" collab supplemental illustration for April 12th, 2025", "content": "Pokémon X Hatsune Miku \"Project Voltage\" collab supplemental illustration for April 12th, 2025 | GoNintendo Front Page The Blog Pokémon X Hatsune Miku \"Project Voltage\" collab supplemental illustration for April 12th, 2025 They are what you eat 12 April 2025 by quence 0 A few months back, we reported on the collaboration between The Pokémon Company and the renowned Japanese Vocaloid, Hatsune Miku, titled “Project Voltage 18 Types 18 Songs.” This project promised 18 songs and accompanying illustrations, each representing a unique Pokémon type. The eighteenth and final illustration was released back in late September 2024, but it turned out there’s even more art to look forward to. These supplemental art pieces will release on random dates, but they’ll continue to showcase Hatsune Miku and Pokémon together. Along with that, the art will spotlight some other Vocaloid idols as well. The latest piece of art is titled “Apple Festival,“ and it was created by artist Yuu Nishida. Will this be the final release in this series? Only time will tell! [ NintendoSoup ] Comment History Loading... Close Add Comment Sign in or, Sign up Comments (0) No comments yet. Be the first! Comment Upvoting Details Loading... Close", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://gonintendo.com/contents/47416-pokemon-x-hatsune-miku-project-voltage-collab-supplemental-illustration-for-april", "source": "GoNintendo", "published_at": "2025-04-12T17:02:00"}, {"id": 36, "title": "35 Things You May Have Put Off Buying, But It’s Tiiiimeee", "content": "35 Things You May Have Put Off Buying, But It’s Time BuzzFeed Shopping logo BuzzFeed Shopping logo Search Gift Guide Beauty + Personal Care Fashion Home Sports + Fitness Stores Tech Kids Pets Sex Toys View All We hope you love our recommendations! Some may have been sent as samples, but all were independently selected by our editors. Just FYI, BuzzFeed and its publishing partners may collect a share of sales and/or other compensation from the links on this page. Posted 9 hours ago Subscribe to Shopping Newsletter Caret Down 35 Things You May Have Put Off Buying, But It’s Tiiiimeee If your current knives can barely cut through an apple, then do yourself a favor and grab this super affordable (and ADORABLE) floral set. by Iman Sakrani BuzzFeed Staff Facebook Pinterest Link 1. A flexible drain snake that'll get out all those clumps of hair and gunk so the bathtub stops filling up past your ankles every time you shower. Just stick it down the drain, twist it, and the ridges at the end will catch all the goop, making sure it all comes out. Amazon, www.amazon.com This pack contains a reusable handle and five single-use heads that you just remove and dispose of after handling your clogged pipes. Promising review: \"Wow. Best thing ever. Seriously. I have had tweezers and sticks and plumbers and chemicals trying to get my master sink to drain. Plumber even said I need an entirely new faucet to get the drain plug part because they don't sell those separately. Well, I have two sinks, a tub, and shower that all match so that was not a valid solution. Doubt I can find the same model. So I bought this thing, stuffed it down, and pulled up hair and black muck. Did it about eight times quickly, ran the water, went right down the drain. Seriously. This is the best tool ever and the best $20 I have ever spent. Everyone with a sink needs this tool. Seriously.\" — juliejules Get a five-pack from Amazon for $19.99 (also available in other sets and styles). 2. A pack of 120 retainer cleaner tablets because it turns out your Invisalign is supposed to be ~clear~ (it also works on mouthguards and dentures!). All you do is drop a tablet into warm tap water, let your dental device soak for a few minutes, and voila! — it'll kill bacteria and remove the buildup that's causing discoloration and unpleasant odors. www.amazon.com Promising review: \"I really loved this product. I am currently waiting for a new Invisalign set. My old Invisalign needed to be cleaned. I read the reviews and decided to purchase. OMG, it worked! They had a fresh taste and were clean. I wish I had found this product sooner. I did let them soak overnight only because I had been wearing them for the last four months. Nothing happened to Invisalign; there was no weakness or anything. Just very clean and fresh. If I could have given the product 10 stars, I would have. \" — Lisa R. Get 120 tablets from Amazon for $18.81 (available in five pack sizes). 3. A new pair of workout leggings to replace the super pilled ones you wear three times a week. They're made with a thick, buttery soft fabric (no one is seeing those hot pink undies) and have ~pockets~ so you don't have to carry your phone around the gym. www.amazon.com , www.amazon.com Promising review: \"THESE...are the best leggings I have ever worn in my entire life! They are so smooth and comfortable. Soft as butter. They fit perfectly. It almost feels like you're naked but they feel somehow insulated and cozy. Stretchy and made of amazingly durable quality. I need to get more colors!\" — Alexandra Shick Get them from Amazon for $24.98 (available in women's sizes XS–XXL, in three inseam lengths, and 45 colors). 4. A pack of AirPods cleaning putty because it's so embarrassing when you want to share earbuds with someone, but yours are coated in wax and dust. Plus, it's soooo satisfying to squish the lil' square into your speaker and see all the gunk it pulls out — and then you get to enjoy clearer, louder-sounding music! www.amazon.com Before you toss your tech in the trash, at least give this a try. Promising review: \"I never usually write reviews but this is an exception. I've had my AirPods for over a year and when the sound quality was diminishing, I was afraid they had a short life expectancy and I would need to get a new pair! Even after using cotton buds to clean the AirPods out, I thought that was enough until my friend said there's stuff built up and hard to see, but there was nothing able to get it out! Enter this product. It literally took five minutes to clean each ear bud effectively and instantly the sound quality was as good as new! Loud, clear, less trouble connecting to my phone, etc. You don't need a full square to clean them, so you can pull a piece off or reuse a square with a side you haven't used! SO happy I found a solution!\" — Amazon Customer Get 24 squares from Amazon for $15.99 (available in two pack sizes). 5. A veggie chopper for keeping your counter tidy while speeding up your prep time. If you love to cook but hate chopping (who doesn’t, right?), this thing is a lifesaver. It chops just about everything — onions, peppers, zucchinis, potatoes, you name it! Plus, it comes with different blades for slicing, dicing, and even spiraling your favorite veggies. www.amazon.com , Amazon Check out a TikTok of the veggie chopper in action. Promising review: \"If you cook, you need this product! I have had this chopper since 2018 and it is by far my favorite kitchen purchase. I have used it hundreds of times over the years and it has held up great. I just bought my MIL one for Christmas and she already loves how much easier it has made meal prep . It is well made and I like that there are different attachments and sizes. I would recommend this chopper!\" — Steph Get it from Amazon for $23.99+ (available in five colors and five sets). 6. A pack of two antimicrobial \"flossing toothbrushes\" because your current one looks like it was used to scrub the bathroom floor (no offense). This has dual-layered bristles: regular ones and ultra-long, thin flossing bristles that get *deep* in between your teeth and gums. Reviewers are saying it feels like they got their teeth cleaned at the dentist, but nope! — just this very innovative toothbrush. Emma Lord / BuzzFeed Mouthwatchers is a small business established by Ronald Plotka, DDS, specializing in antimicrobial toothbrushes designed for deeper cleans. Here's what BuzzFeed Shopping writer Emma Lord has to say: \"I love it just after the first few days of use! I use an electric toothbrush usually, but I feel like I'm getting a much more satisfying clean from these?? Especially because I tend to get yellow stains between my teeth no matter *how* much I floss, and these bristles seem to actually target that a lot more effectively.\" Promising review: \"I'm amazed at how well this toothbrush cleans my teeth — it definitely gets between the teeth and also, more importantly for me, gets in the small, deep crevices in my molars where I always have food stuck, and regular toothbrushes couldn't get stuff out. I brush more often (after meals/snacks) because of how effective it is. As stated, definitely go easy around the gums. The bristles feel soft but will cause your gums to bleed if you use regular pressure. Nice and easy does the trick, SO WELL!\" — Jason A. Get a pair from Amazon for $9.99 . 7. A WD-40 pen if your squeaky cabinets are driving you up the wall. It's way less messy than traditional spray methods, and reviewers love the precision this pen offers — perfect for getting into tight spaces and silencing those squeaks once and for all. www.amazon.com Promising review: \"I love WD-40 products and use them for everything. I spray on shovels to keep dirt or snow from sticking, spray around windows and thresholds to deter bugs, clean Sharpies off wood and walls, and, of course, stop squeaky doors. These small direct-point application pens are great. Keep one in the glove box, my kitchen 'junk' drawer, and the house toolbox.\" — BBP623 Get a three-pack from Amazon for $12.99 . 8. A wall-mounted organizer to handle those annoying brooms, mops, rakes, and shovels that are always falling over. This rack has five slots and can hold up to 38 pounds, so it’ll keep everything neatly stored and off the floor. www.amazon.com It comes with screws, anchors, a drilling template, and a guide — everything you'll need to set this up. Promising review: \"Perfect! Exactly what I needed to organize my mop, broom, scoop, etc. Efficient and easy to use. A little hard to get my scoop into it, but that’s because it’s thicker than the rest of the items. Love that there are hooks. Spray bottles and cleaning product bottles hang perfectly on there too.\" — Kavita Chandanie Get it from Amazon for $13.99 (available in two sizes and two colors). 9. A set of double-sided shower rings that make changing your shower curtain or liner easier than it's ever been. Since you hang the curtain on one side and the liner on the other, you'll avoid the hassle of taking the whole thing down every time you switch the curtain/liner. www.amazon.com Promising review: \"This is one of those items you didn’t know you needed, and once you get it, you can’t help but wonder how you ever managed before. I absolutely hate taking the shower curtains off because of the whole open and close for several shower curtains. I know you’re like, ‘It’s just shower curtain hooks.’ And it is. But when you have to change out the creepy shower liner that likes to attack you, and you dread doing so, this just adds seconds to your life. No more unsnapping. Simply take out the liner, place the liner on the appropriate hook, and presto.\" — Nardsbaby Get it from Amazon for $6.99+ (available in 18 colors). 10. A powerful massage gun with five speeds and massage heads — it’s great for targeting various muscle groups, so you can use it on your back, shoulders, arms, legs, and pretty much anywhere that hurts. It delivers a deep massage that helps relieve the soreness and stiffness that you've been living with for far too long. www.amazon.com Read more about what massage guns can (and can’t) do, plus how to use them, at Cleveland Clinic . Promising review: \"I have had chronic issues with pain caused by severely knotted muscles. This massager changed my life! I have tried muscle relaxers, stretching, and many other things, but a couple of muscles in my upper back would just knot up with any stress, physical or emotional, and the pain was nearly constant. I used this for about a half hour on all of my muscles with the first use, and the effects were immediate and profound. Pain relief was instant , and occasional use for a couple of minutes to the affected areas has been able to maintain that relief. I loved it so much that I bought one for my brother, who says it is helping him tremendously, as well. I have charged my massager twice in the last two months, battery life is excellent!\" — Patty S. Get it from Amazon for $89.99 (available in seven colors). 11. A Squatty Potty that elevates your feet to help mimic a natural squatting position for easier, more complete bowel movements. Just because it helps your trips to the bathroom be quicker doesn’t mean you can’t still enjoy some quality TikTok scrolling time while you’re in there! Amazon, www.amazon.com I have one and it has truly made that aspect of life (🚽) soooo much easier! The only downside is that public restrooms don't have these and I kind of can't go without it lol. Read more about constipation relief at home, including using a squatting position, at Cleveland Clinic . And if you want more Squatty Potty content before making this life-changing purchase, check out our Squatty Potty review ! Promising review: \"I'll do you all the courtesy of NOT adding a photo or video (You're welcome). This works. Whoever invented the toilet had their heart in the right place, but not their knees. This device mimics proper positioning, and you should get one. That is all. Thank you for coming to my TedTalk.\" — P.W. Get it from Amazon for $24.97 (available in three sizes; get the acrylic version for $79.99 or the teak wood version for $50.99 ). 12. And a before-you-go toilet spray — spritz the bowl before doing your business, and you'll be able to relax knowing whoever comes in next won't detect any funky smells. www.amazon.com Promising review: \"I love the variety of scents that linger long enough to work for the purpose intended. I love giving them as gifts!!!\" — AML Get it from Amazon for $4.72+ (available in six sizes). 13. A pack of crew socks because your toe is literally poking through your current socks, like hello?? These are lightweight and breathable (perfect for a socks-and-sandals moment), and reviewers say they hold up well through repeated wash cycles — which is not something many other socks can claim! www.amazon.com Promising review: \"These socks are fantastic! I love how soft and comfortable they are. They've held up really well through repeated washes, which is a huge plus. The neutral colors are perfect for everyday wear and go with everything. I'm very impressed with the quality and would definitely buy them again.\" — Mary Jo Groter Get them from Amazon for $9.99+ (available in one size that fits women's sizes 5–10, packs of two, three, and five, and in different color sets). 14. A set of budget-friendly (under $20!!) floral kitchen knives with a nonstick coating that makes them super easy to clean. They're made from high-quality stainless steel with a beautifully sharp edge that'll have you chopping up veggies with ease (instead of having to saw through them) — and questioning why you didn't replace your old, worn-down knife set sooner. www.amazon.com You'll get a chef knife, bread knife, utility knife, santoku knife, slicing knife, and a paring knife, plus a cover for each! Promising review: \"I love these knives! I’ve had them for a year now and I haven’t had to sharpen them. Good grip, durable, and easy to handle. I hand wash them because we don’t have a dishwasher but they’re very easy to clean. I love the blade covers. It makes them safe for putting them in a drawer. I love not having a big knife block on my counter. Lightweight. They have not rusted.\" — Nvs Get the 12-piece set from Amazon for $18.99 (also available in a 10-piece set). 15. A spice drawer organizer so you can finally have the neatly arranged, easy-to-find collection of spices you've always wanted. These nonslip liners are made from a soft foam that can be trimmed to fit any drawer. Think of how much faster you'll cook dinner when you don't need to hunt for the smoked paprika! Amazon YouCopia is a woman-owned small biz that makes ingenious home and kitchen storage solutions. Promising review: \"This is one of my favorite things I've ever purchased from Amazon! I think this will be my go-to gift for all of my friends who love cooking as much as I do! Freeing up cabinet space and having something that can so easily be rinsed off in the sink makes this a for sure buy! \" — momonono Get a 10-foot roll from Amazon for $16.99 (also available in beige and two other sizes). 16. An oil stain remover that pulls out stains caused by oil, brake fluid, and other petroleum-based products from porous floor surfaces (like concrete, pavers, parking lots, etc). It's basically like skincare for your driveway! www.amazon.com Promising review: \"The scene: me with a hot glove carrying a drip pan full of au jus. Thumb goes into hot liquid. Pan is dropped, and greasy meat juice is all over our patio brick. In freezing temps. I use a putty knife to get some out, but there the stain remains six months later. Even muriatic acid didn’t cut it. Ordered this. Tried a spot. Let it dry overnight. Swept it. Stain is almost gone. I apply it to the rest of the stain and let it set. But this time it rains and turns it gooey. Fortunately, new power washer and I join forces with Chomp, and within a half hour, it’s totally gone. Amazing product. 1,000% satisfied. \" — Teddy Roosevelt Get it from Amazon for $17.97 (available in two sizes). 17. A set of gold cable organizers you can stick to your desk or nightstand to hold those cords that are always falling to the ground or getting tangled. Unlike those bulky (and tbh ugly) organizers, these'll look like beautiful gold gems in your space. Brighttia / Etsy Brighttia is a New York-based Etsy shop established in 2018 that specializes in industrial and modern interior lighting and decor. Promising review: \"These brass cable organizers are beautiful and high quality. I’m using two of them to keep a plug-in sconce cord attached to the wall and to direct the cord to the electrical outlet. These little gold pieces add a touch of functionality and glamour to the sconces. Exactly what I was looking for.\" — Amy Margolis Get a set of four from Brighttia on Etsy for $22.98 (available in 12 colors). 18. A dishwasher magnet so everyone in the house knows NOT to put their dirty spoon in with the freshly cleaned silverware. Sometimes it's too hard to tell whether the dishwasher needs to be run or unloaded, and this just clears up all the confusion. Sally Elshorafa / BuzzFeed, www.amazon.com Promising review: \"What took them so long?? Every household should have one of these. Does your partner point to the dishwasher and ask you, 'Hey, are these good?' Mine did, almost daily. Not anymore, though! A breeze to install (our dishwasher is magnetic, but I'm really glad it came with adhesive pads — someday when we move, if we need them we have them!), and even though I bought it (mostly) as a joke, I use the heck out of it. Slides easily when it needs to.\" — Andrea Braun Get it from Amazon for $6.99 (available in six styles). 19. A bestselling ChomChom pet hair remover if you want to see what your clothes, furniture, and other fabric surfaces look like *not* covered in fur. It's reusable and works its magic without using anything sticky (so no residue)! This gadget went super viral based on its results — and that's when you know a product is good. Jenae Sitzes / BuzzFeed See the ChomChom roller in action on TikTok ! BuzzFeed Shopping editor Jenae Sitzes swears by this: \"The tens of thousands of 5-star Amazon reviews are reason enough to add the ChomChom to your cart immediately — but let me add my own personal review to the stack. I've been using the ChomChom for quite a while now, and I took the photos above to show just how quick, easy, and effective this roller is. It took 10 seconds to rid my velvet couch ottoman (yes, velvet...a terrible cat owner choice, I know) of the hair my two gray kitties are constantly leaving everywhere. It takes a bit of practice to get the hang of using this roller — at first, I thought you only brushed down in one direction, and was confused why it wasn't picking up hair. It's important to do a push-and-pull brushing in *both* directions so it actually pulls the hair inside , which does require you to apply a bit of pressure. Afterward, you'll just dump out the hair that's been trapped inside. The ChomChom is best for large flat surfaces like couches and beds.\" Get it from Amazon for $24.99 (available in three colors). 20. And a bottle of Angry Orange pet odor eliminator — I know you're busy, but you simply cannot sit any longer in a house that smells like cat urine. This breaks down stains and odors at their source, leaving your home smelling fresh and citrusy without using harsh ingredients. That one spot behind the couch that your cat won't stop peeing on doesn't stand a chance. 💪 www.amazon.com , www.amazon.com Promising review: \"This product is amazing!!!! We have a Rottweiler pup and a bichon pup, and our house was feeling the PAIN! I tried everything and used to tell my wife, 'With all the science and technology in the world, we still can’t come up with something that gets rid of the dog mark smell!' This product does everything and more. Just ordered another round. We were about to throw away some furniture due to the smell and now after use we can keep it. Saved me hundreds. Well worth the money. \" — clayton s tonkin Get it from Amazon for $17.96 (available in two sizes and packs of two or three). 21. A standing weeder that uses a simple lever system to make weeding easy. It has a bamboo handle and four steel claws to really dig into those roots and pull them OUT. Your back deserves a break from playing tug of war with stubborn weeds. Amazon Grampa's Gardenware Co. is an Oregon-based, family-owned small business. Promising review: \"Oh my god, I friggin' love this tool. I bought this on a whim given we bought our first house and know nothing about caring for a yard. Boy has it come in handy. Our new house had a ton of weeds in the front yard and this tool helped me get most of them out in no time. In fact, the process of yanking out the weed was strangely satisfying! I don't think anyone can say that weeding is fun but this tool made it as close to fun as you can get , especially when you see a long root along with the weed you pulled.\" — JG Get it on Amazon for $39.99 . 22. Some foaming garbage disposal cleaning packets to clean out all the gunk from your roommates who just don't understand the concept of throwing food in the garbage instead of down the sink. Just insert a packet into the disposal with hot water trickling to the side, then turn on the disposal and watch it fizz up — soon, those gag-worthy smells will be a thing of the past. Amazon Promising review: \"Saw on TikTok (don’t judge) and automatically added to cart. So easy to use, takes probably a minute to fully bubble up and clean, and you’re left with a clean sink! I use with other drain cleaning products, but would 100% recommend for weekly maintenance.\" — Jessica Hamilton Get a four-pack from Amazon for $7.90 (available in a pack of two). 23. And while you're at it, some dishwasher tablets that break down lime and mineral buildup to properly clean your dishwasher (you know, the machine that cleans your dishes ) without *any* effort on your part. Just pop in a tablet and run the dishwasher as normal — it sure beats having to climb in there yourself and scrub. www.amazon.com Promising review: \"After using this product, I am happy to report that my $5 investment saved me over $500. I was ready to replace my dishwasher due to super cloudy glasses, residue, and dishes just not getting clean. Then, I became aware that the water softener was no longer doing its job so I had the rental company replace it. Dishwasher performance improved somewhat. I decided to do two more loads before deciding to purchase a new one. Then I saw a product test review for Affresh. I was ordering some stuff from Amazon anyway so I added that to my order. When it came, I tossed one of the tablets into the bottom of the full machine per the instructions and ran the regular cycle. I did not expect the results I got! The glassware that I thought was permanently etched and ruined came out like new. Same with cutlery. The difference is unbelievable. I will use this faithfully every month, as recommended. \" — Sheila Get a pack of six tablets from Amazon for $7.49 . 24. A three-pack of heavy duty scissors because it is TIME to upgrade those dull blades that can barely cut through paper. Reviewers love how comfortable they are to hold and how they *stay* sharp. www.amazon.com Promising review: \"Aside from these being a very inexpensive and aesthetic-looking set, they have an excellent, smooth, molded grip that feels good in the hand. The blades are thick, tight, and strong. They are built to last decades. I absolutely love them! Being a teacher, I use them several times daily, all throughout the year. You will NOT be disappointed, (unless for some odd reason you get a defective pair) I promise! 😃⭐️⭐️⭐️⭐️⭐️\" — gr8female Get a three-pack from Amazon for $9.99 (available in eight color sets and packs of 24 or 36). 25. Bioré blackhead removers to help remove all the gunk and buildup that's clogging up your pores. After having it on for about 10 minutes, you'll get to enjoy the satisfying feeling of pulling out all the little clumps and marveling at your smooth, cleared-out pores. www.amazon.com , www.amazon.com Promising review: \"I wear makeup (powder/foundation) a few times a week and these strips never disappoint! Been using them since high school! The amount of junk and buildup that comes off is so satisfying to see! It can be irritating when removing, especially if you have sensitive skin. Don’t put any moisturizers or oils on afterward; otherwise, you’ll get a pimple or two! 😬\" — Christina S. Get a pack of 24 from Amazon for $16.19 (available in four styles and five pack sizes). 26. An electric makeup brush cleaner because deep down, you know your brushes are long overdue for a thorough cleanse. It has three adjustable speeds so you can wash and dry your makeup brushes in literal minutes instead of hand washing them and then waiting hours (or even days) for them to fully dry. www.amazon.com , www.amazon.com This kit includes: the electric brush spinner, a cleaning bowl, eight brush collars, a brush cleaner dock, a charging cable, and a user guide. To use it, you just put water and/or some brush cleaning solution in the bowl, attach the brush to the electric spinner, spin the brush in the liquid until cleaned, and then spin the brush in the air to quickly dry it. Promising review: \"So, I don’t write reviews. You never really know who wrote them if they are good and if they are bad…was it a fluke? I have to say I LOVE THIS PRODUCT!! I prefer to apply my makeup with brushes and when they would get caked with product I would throw them away and buy new. Well that got expensive-quickly. I tried this product on a whim…and boy am I glad!! I wash, rinse and dry in the morning and they are dry and ready for use by lunch if I need a touch up. It does take a few minutes but SO WORTH it!! They more I use it, the faster I am getting. My brushes look new after and feel so much better on my skin. My makeup even goes on nicer. From a non-review-writing-make-up-loving girl...buy it. You will love it!!\" — Sally B Get it from Amazon for $26.99 (available in two colors). 27. Clear shelf dividers to keep your closet from looking like a thrift store donation bin. These make sure everything stays neatly folded and doesn’t topple over, creating one big mess. Plus, keeping your stacks of clothes organized and separate makes it easier to find what you need faster! Say goodbye to digging through messy piles. www.amazon.com Promising review: \"Love these acrylic shelf dividers! They make my closet look so neat and organized. I used them to divide shelves that hold my folded workout tops. I used a folding helper tool like the ones retail stores use, which gives my folded clothes a uniform width/look, and by using two dividers on each shelf, I can fit three stacks perfectly on my 30-inch wide shelves. I am ordering more to add to my shelves with sweaters! \" — Aimee Lonergan Get them from Amazon for $22.99+ (available in two sizes and in various pack sizes). 28. A supremely soft microfiber pastel duvet cover set because the one you've been using for the past five years is all pilled and covered in stains. This one even has corner ties inside to prevent the filling from bunching, so you won't have to deal with re-floofing it every three days! And it's not a heavy hit to your wallet either. Amazon, Amazon Promising review: \"I took a chance with this duvet cover. Couldn’t beat the price! If I could give the quality and comfort of this duvet cover and pillowcases 10 stars, I would!! Definitely a great buy at an extremely affordable price. The quality exceeded my expectations. It is so soft, true to size and color, wrinkle-free, and has a well-made zipper at the bottom. There are also ties on the inside to keep your duvet in place. I absolutely LOVE everything about this cover. Can’t wait to get home in my bed after a long, exhausting work shift on my feet. My furbaby loves it too! Thanks Amazon for simplifying my life! ❤️\" — Theresa Get a set from Amazon for $24.99+ (available in sizes twin–oversized king and in 30 colors). 29. A Bissell multi-purpose portable cleaner , which uses a strong suction and powerful spot remover to lift dirt and stains from floors, carpets, upholstery, and more. It’s super portable, so you can easily carry it around to clean messes all over the house, and it's ridiculously effective on stains — take it from the over 70,000 5-star reviewers who agree. www.amazon.com , www.amazon.com Promising review : \"Was ready to throw out my couch. Bought covers for my upholstered dining chairs. This machine brought all my upholstered furniture back to life. My dog puked on my rug, and this cleaned it right up and left no stain.\" — Kristen White Get it from Amazon for $123.59 (available in three styles). 30. A set of floating bookshelves because your book collection that's been sitting on the floor deserves to be properly displayed. These hold up to 15 pounds, and reviewers say they are super easy to install. Now all your books can look like they've been perpetually Wingardium Leviosa-ed! www.amazon.com Promising review: \"These are so much fun! We ordered the small size, which fits standard hardback books (approximately 5–7 hardbacks in my experience). They're a great way to add some extra storage to our very small home, and we've placed them in our hallway so people ask us about them all the time. I'd highly recommend!\" — LaBuenaVidaMere Get a set of three from Amazon for $23.65 (available in two sizes). 31. A set of adjustable clip holders to turn any bra into a racerback, so the straps don't stick out or fall off your shoulder. Just attach the clips to both straps in the back, and voila! — no one can see your bra straps from the front. Amazon Promising review: \"My bra straps spent more time off my shoulders than on them. I have bras that fit perfectly, but the straps are too wide-set or something. I'm so glad I bought these little bra strap clip holders because they've solved the problem. I've used them for three days now, and my straps have not fallen off of my shoulders even once in that time. Amazing! I love them! I put a clip holder on my bra and then put the bra on like a T-shirt — over my head, put my arms in, then fasten it as usual in the back — pretty easy. The length of the clip holders are adjustable. I have fully extended them to fit across the back of my 38DD bras. At first it felt a bit odd because it was different, but it doesn't take long to adjust to the feel of it. The strap clip holders do the job, and they are pretty cheap, so give them a try. \" — Polly Esther Get a set of three from Amazon for $5.97+ (available in eight sets with different colors). 32. A medication tracker you can attach to any of your pill bottles so you don't accidentally take your antidepressants twice in one day. www.amazon.com Take-n-Slide is a small business that makes wonderfully innovative medication trackers. Promising review: \"I absolutely love this product! I have a couple of daily medications and oftentimes I forget whether I’ve taken them and/or whether I’ve taken the second dose. Recently I inadvertently took a double dose because I couldn’t remember whether I had taken the medication or not. This product solves the problem. There is even a satisfying feeling I get when I 'click' the tabs. Genius little invention. \" — Tiffany Maggard Get a pack of five from Amazon for $19.99 (available in two colors). 33. An adorable ombre bath mat that's super plush and fluffy, so you'll feel like you're stepping onto a cloud instead of the old mop-like texture of your current worn-out bath mat. This one's also quick-drying, so it won't be all soggy five hours after your shower. Amazon, www.amazon.com Promising review : \"This rug is very pretty. It absorbs water well. It’s stays in place nicely. I think it’s a good value for the money. It’s easy to clean and is even washable. I have two other colors in this rug, and they are very durable after two years and still look great.\" — Sherri Dale Get it from Amazon for $19.54+ (available in 27 colors and 15 sizes). 34. A compact cutlery organizer with stacked, angled compartments that take up *much* less room than traditional silverware organizers. You can free up more space for those larger cooking utensils that take up an entire drawer or are sitting on your counter. Amazon, www.amazon.com See this \"life-changing\" drawer organizer on TikTok. BuzzFeed Shopping editor Chelsea Stuart has used the cutlery organizer to make her kitchen feel more organized. She says: \"Just got this, and it has freed up SO much space in our cutlery drawer that we can now store teas, small Tupperware, etc. vs. before it was just a mess of utensils.\" Promising review: \"I had never seen this before I bought it, and holy crap it changed my life. So. Much. Room. There is so much room left in my drawer now that I moved stuff from another drawer and I have an entirely empty drawer in my kitchen now. Now only HALF the drawer is silverware and the other half is spatulas and cooking utensils. It is great. It also seems very sturdy. Highly recommend.\" — van31050 Get it from Amazon for $8.99 (available in two sizes and an expandable style). 35. An exfoliating scrub mitt that buffs away dead skin, leaving your body feeling soft, smooth, and refreshed (just in time for warmer weather!). It's made from plant-based materials that won't irritate your skin, and it's quick-drying so it won't accumulate moisture and collect bacteria. It even has a little loop for hanging (so you don't have to awkwardly drape it over your shower caddy). www.amazon.com It's recommended to use it 2–4 times a month so you don't over-exfoliate! Promising review: \"My skin is 100% softer and feels far smoother thanks to this product!!! The difference was noticeable after ONE use, its true. All the grime, rolled up skin, flakes and chucks — shudder, that was on me??? Everything other customers are saying about how disgusting it is when you see how much dead skin sloughs off is true. I disagree that it only comes off after the first use though — I have continued to see improvement over the time I've used it, about six weeks, and even some age-related and sun damage discoloration is gone. These are the BEST, a MUST-HAVE, holy grail exfoliating mittens . I DEFINITELY recommend this! Did I say I recommend this 100%? I do!\" — Kindle Customer. g'ma Get it from Amazon for $10.99 (also available in a set of two). Reviews have been edited for length and/or clarity.", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://www.buzzfeed.com/imansakrani/things-youve-put-off-buying", "source": "Buzzfeed", "published_at": "2025-04-12T17:01:02"}, {"id": 37, "title": "Trump administration says it will exclude some electronics from reciprocal tariffs", "content": "Trump administration says it will exclude some electronics from reciprocal tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS The \"worm\" logo is on the left, the classic \"meatball\" logo is on the right. 37 minutes ago Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge Read full article: Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge JSO generic night 3 hours ago Teenage motorcyclist killed in crash on Gate Parkway Read full article: Teenage motorcyclist killed in crash on Gate Parkway . 5 hours ago A cool start, leading into a gorgeous day! Read full article: A cool start, leading into a gorgeous day! News4Jax shines at Florida News Awards 13 hours ago News4JAX shines at Florida News Awards Read full article: News4JAX shines at Florida News Awards DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Business Trump administration says it will exclude some electronics from reciprocal tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.news4jax.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WJXT News4JAX", "published_at": "2025-04-12T17:00:42"}, {"id": 38, "title": "How to keep your old computer running for as long as possible", "content": "How to keep your old computer running for as long as possible | Popular Science Old computers can still have their uses. Image: FRANCESCO CARTA/Getty Images Get the Popular Science daily newsletter💡 Email address Sign up Thank you! Terms of Service and Privacy Policy. You want to squeeze as much life from a laptop or desktop computer as possible. Doing so can save a substantial amount of money over time, and stops you from contributing to mountains of e-waste . At the same time, dealing with an old, sluggish computer is a frustrating experience. If apps and websites are taking ages to load, it can seriously impact your productivity. At a certain point, the temptation to upgrade to a shiny, speedy new computer proves irresistible. A middle ground exists, which is to make sure your laptop or desktop lasts as long as possible. There are multiple tricks you can try when it starts to show its age—tricks that could mean it stays usable for much longer than you expected. Cut down on the clutter You’ll find several programs starting up with Windows or macOS. Screenshot: Apple One way to stretch the life of your computer is to reduce its load. Uninstall any apps you’re not actively using, and keep your apps trim in terms of extensions and add-ons. We’ve covered how to uninstall programs on Windows and macOS , and it’s not difficult to do. Limiting the number of programs starting up with your computer can help too: It means fewer apps running in the background, freeing up more memory and other system resources. You can take care of this with a few clicks on both Windows and macOS . The more storage space you have the better. It gives your computer and its operating system room to breathe and get organized, and can improve performance. Uninstalling apps should help with this, but also be on the lookout for files that you no longer need or can move somewhere else. Choose some upgrades Some well-chosen upgrades can breathe new life into an old computer. While this is going to cost you money, it won’t cost as much as a full upgrade would—and it could mean you get several years of extra use out of your device. The right upgrade will depend on your system’s specs, how much you have to spend, how easy the system is to upgrade, and how comfortable you are with opening up your computer. This is mostly for Windows PCs and for desktops, though a few limited laptop upgrades are sometimes possible. Upgrading the RAM or the storage on your computer are usually the best upgrades for getting the most bang from your bucks. It could be something as straightforward as buying an external hard drive to move files over to, for example. Install another operating system There are plenty of lightweight Linux distros to choose from. Screenshot: Lubuntu In the interests of doing more with older components, you can install a fresh operating system to replace Windows or macOS, one that’s less demanding on your aging computer. This will wipe everything on your system though, so be sure to back up all of your important files and folders first. Linux is always a popular and completely free option, and it comes in many different flavors (known as distros). Some of them, such as Lubuntu , are designed to be as lightweight as possible. Have a browse around the web and you’ll find many options to pick from, as well as detailed guides to how to make the switch. Then there’s ChromeOS Flex , which essentially turns your Windows or Mac computer into a Chromebook. You’re just running a web browser with a few extras, so older computers should be up to the challenge. As with Linux, this is free to do, and it’s perfect if you spend most of your computing time in a web browser anyway. Use your computer for something else Then there’s the option of using your computer for something else , rather than an all-purpose machine. One option is using your aging laptop or desktop as a media server: It doesn’t have to do anything except stream audio and video to other devices on your network. Plex and Emby are two programs that can help. Or how about turning your ancient computer into a dedicated writing machine? This could work if your machine is so old that it’s no longer getting security updates, so shouldn’t really be connected to the web. Set up a word processor and you’re good to go (you will need a USB drive to get your writing shared elsewhere, however). Repurposing your laptop or desktop doesn’t save you from the cost of an upgrade, because you’ll still need to buy another computer, but it does cut down on e-waste and does mean your hardware stays useful for longer. And when you do finally need to get rid of a computer, make sure you do it responsibly . More deals, reviews, and buying guides The PopSci team has tested hundreds of products and spent thousands of hours trying to find the best gear and gadgets you can buy. SEE MORE GEAR Trending Environment The Great Pacific Garbage Patch isn’t a just a floating trash pile The Great Pacific Garbage Patch isn’t a just a floating trash pile By RJ Mackenzie Environment Wind chill isn’t what you think it is Wind chill isn’t what you think it is By Maggie Galloway More in Tech Hacks How to turn your laptop into a desktop computer How to turn your laptop into a desktop computer By David Nield How to add Google Drive to your computer (and why you should) How to add Google Drive to your computer (and why you should) By David Nield How to use the Signal app to keep your chats secure How to use the Signal app to keep your chats secure By David Nield How to use Windows Safe Mode to get out of computer trouble How to use Windows Safe Mode to get out of computer trouble By David Nield It’s time to declutter your messy macOS It’s time to declutter your messy macOS By David Nield How to use tasks and reminders inside ChatGPT How to use tasks and reminders inside ChatGPT By David Nield How to spot when your hard drive will fail before it does How to spot when your hard drive will fail before it does By David Nield How to customize Google Chrome to make it your own How to customize Google Chrome to make it your own By David Nield SEE MORE More in DIY How to fully back up your Android device How to fully back up your Android device By David Nield How to reset the YouTube algorithm How to reset the YouTube algorithm By Justin Pot Windows and macOS can free up storage space for you—here’s how Windows and macOS can free up storage space for you—here’s how By David Nield How to get MS-DOS up and running on Windows or macOS How to get MS-DOS up and running on Windows or macOS By David Nield How to use Apple Intelligence to sort your emails How to use Apple Intelligence to sort your emails By David Nield How to mirror your iPhone on your Mac How to mirror your iPhone on your Mac By David Nield How to factory reset a Mac How to factory reset a Mac By Justin Pot How to make sure all your software and apps are up to date How to make sure all your software and apps are up to date By David Nield SEE MORE", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.popsci.com/diy/how-to-keep-an-old-computer-running/", "source": "Popular Science", "published_at": "2025-04-12T17:00:00"}, {"id": 39, "title": "Trump enacts tariff exemptions for computers, smartphones, and more", "content": "Trump exempts computers, smartphones, and more from tariffs | Tom's Hardware Skip to main content (Image credit: Shutterstock) Amidst the flurry of tariffs imposed by the Trump administration over the last few weeks, we finally have some exemptions that should significantly impact the tech sector. While the initial reciprocal tariffs will remain for imports, U.S. Customs and Border Protection shared some new exemptions on tech-related goods. The update was announced yesterday evening and follows various tariff increases, particularly on Chinese imports. The exemptions include many products we're excited to see get some relief. The complete list is available in the official bulletin, but it includes computers, smartphones, semiconductor chips, and other tech goods like flat panel TVs, solar cells, and flash drives. The most recent tariff increase from Trump was 145% on Chinese goods. This sent waves across the tech industry, as many realized the significant impact it would have on many tech products that we rely on, including laptops, desktops, CPUs, semiconductor chips, and any PC component. Large companies like Apple, HP, Dell , and more preemptively imported extra stock before the tariff announcement to skirt some of the impact. You may like Tech enthusiasts brace for Trump tariff price hikes on new components Nvidia may avoid recent tariffs on its AI servers — 60% of Nvidia servers pass through Mexico, may be exempt from Trump tariff flurry These exemptions should benefit industry leaders and consumers alike, who have been anticipating serious price hikes on imported products. This should offset the price increases for customers and manufacturers who rely on imports for construction materials. The United States imports around 66% of its tech goods from China, which caused significant concern when tariffs were first announced and subsequently raised on Chinese imports. We recently reported expectations that consoles, monitors, and laptops would be among the most impacted. Many tariffs initially imposed on April 5th will be reduced for 90 days, but tariffs on China have continued to increase . This exemption list is the first we've seen concerning the tariff situation with China. That said, tariffs will remain in place for all other imports not included in the exemption list. The situation is subject to change, but we'll report any significant updates on the tariff situation as things progress, so be sure to check back regularly for more information. Stay On the Cutting Edge: Get the Tom's Hardware Newsletter Get Tom's Hardware's best news and in-depth reviews, straight to your inbox. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors See all comments (12) Ash Hill Contributing Writer Ash Hill is a contributing writer for Tom's Hardware with a wealth of experience in the hobby electronics, 3D printing and PCs. She manages the Pi projects of the month and much of our daily Raspberry Pi reporting while also finding the best coupons and deals on all tech. Read more Tech enthusiasts brace for Trump tariff price hikes on new components Nvidia may avoid recent tariffs on its AI servers — 60% of Nvidia servers pass through Mexico, may be exempt from Trump tariff flurry Are gaming GPUs subject to new U.S. tariffs? It isn't entirely clear yet China fires back at Trump’s tariff increases with 125% levies on U.S. goods PC prices up at least 20%: Trump Tariffs may hurt U.S. system integrators most Trump says that chip tariffs are starting 'very soon' Latest in Tech Industry Pat Gelsinger turns to particle accelerators for a new way to make chips, joins xLight Trump exempts computers, smartphones, and more from tariffs Chinese chip giants say they don't care about U.S. tariffs — many don't sell to the U.S. anyway due to existing sanctions China fires back at Trump’s tariff increases with 125% levies on U.S. goods China's new semiconductor rule spares Taiwan fabs, punishes Intel, GlobalFoundries & Texas Instruments Elon Musk’s xAI allegedly uses 'illegal' generators to power Colossus supercomputer facility Latest in News Charred RTX 4070 fell victim to a PSU without protection feature Asus launches the flagship ROG Crosshair X870E Extreme, starting at $1,400 Pat Gelsinger turns to particle accelerators for a new way to make chips, joins xLight AMD's latest ROCm 6.4 release continues to lack RDNA 4 support Old-school Creative Sound Blaster cards repaired and demoed Trump exempts computers, smartphones, and more from tariffs 12 Comments Comment from the forums Seems like a good move initially to reduce some of the price hikes. Reply Are you sure that it includes PC components , not just fully-assembled PCs? Also, I expect cases, heatsinks, and radiators are still be affected by the 25% steel & aluminum tariffs, which did not get suspended. Lastly, the \"de minimis\" exemption on small (sub-$800) packages ends May 2nd. That will hit anything shipped directly from abroad (AliExpress, Temu, some sellers on Amazon & ebay, etc.). I'm not sure exactly how that's going to work, but I think you'll be assessed a customs fee that you pay in order to pick up or receive your package. But, it's the recipient who pays. So, don't expect it to be incorporated into sellers' prices. Reply \"The complete list is available in the official bulletin\" No it's not. Reply What it must feel like hopping on a ride at Rollercoaster Tycoon while the player is still editing the tracks. Reply bit_user said: Are you sure that it includes PC components , not just fully-assembled PCs? https://hts.usitc.gov/search?query=8542 Reply Giroro said: \"The complete list is available in the official bulletin\" No it's not. Sure it is, but you have to look up what all those headings/sub correspond to here: https://hts.usitc.gov/ Reply sadly, the only groups that will benefit from these exemptions will be the big businesses. they wont reduce their prices, theyll simply pocket the price difference, while consumers continue to pay inflated prices Reply This tariff exemption move is good for consumers and big tech companies, but it also severely undermines the whole point of the tariffs . I'm completely confused on what the objective and strategy is now. I also get the impression that the big tech executives have too much influence when they can create special exemptions for their businesses. Reply thestryker said: https://hts.usitc.gov/search?query=8542 So, what's that column labelled \"2\", which says 35% ? Reply bigdragon said: This tariff exemption move is good for consumers and big tech companies, but it also severely undermines the whole point of the tariffs . Yeah, I can imagine more and more exemptions getting created, as that 145% rate on Chinese imports begins to bite and retailers & consumers start to recoil at the prices of things. As for tech products, recall that the same thing happened last time around. There was initial panic about motherboards & graphics cards getting hit, but then they were exempted for a time period that kept getting extended. bigdragon said: I'm completely confused on what the objective and strategy is now. I think the objective hasn't really changed. The strategy is what's now in doubt. bigdragon said: I also get the impression that the big tech executives have too much influence when they can create special exemptions for their businesses. Well, yes but I'm sure their case played well, with AI being seen as a strategic priority. Also, it's not just tech executives... Reply View All 12 Comments Show more comments", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://www.tomshardware.com/tech-industry/trump-enacts-tariff-exemptions-for-computers-smartphones-and-more", "source": "Tom's Hardware UK", "published_at": "2025-04-12T16:59:52"}, {"id": 40, "title": "Smartphones and computers are now spared from Trump's reciprocal tariffs", "content": "Smartphones and computers are exempt from Trump's reciprocal tariffs : NPR Accessibility links Skip to main content Keyboard shortcuts for audio player Smartphones and computers are exempt from Trump's reciprocal tariffs The exemption comes amid worries of how President Trump's steep new tariffs will affect American tech companies that rely on supply chains in China, like Apple. Business Smartphones and computers are now spared from Trump's reciprocal tariffs Updated April 12, 2025 2:02 PM ET Originally published April 12, 2025 12:58 PM ET Juliana Kim Versions of the new Apple iPhone 16 are displayed at an Apple store in in Manhattan Beach, Calif., on April 8. Jay L Clendenin/Getty Images hide caption toggle caption Jay L Clendenin/Getty Images The Trump administration has amended its list of imports that will be affected by sweeping global tariffs in order to exempt certain electronics, including smartphones and computers. Politics China put steep tariffs on U.S. exports. Farmers are worried The updated guidance was published Friday night by U.S. Customs and Border Protection. The exemption will apply to President Trump's steep \"reciprocal tariffs\" imposed across dozens of countries, which have since been paused until early July as well as the 145% levies currently in place on China. That was the only country excluded from the reciprocal tariff pause. The exemption is effective for products that entered the U.S. or left warehouses starting on April 5. The White House issued a presidential memo about the exemption on Saturday. Sponsor Message When asked about the reasoning behind the exemption, White House press secretary Karoline Leavitt said in a statement: \"President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops.\" Leavitt added, \"At the direction of the President,\" companies including Apple, TSMC and Nvidia \"are hustling to onshore their manufacturing in the United States as soon as possible.\" The electronics exemption is a major development in the tariff war with China, which has imposed a 125% tariff on U.S. goods . Prices for electronics from China, a key sector, had been expected to spike . Politics Where do tariffs stand? A look at what's in place and what's on pause Among the items that will now be spared from Trump's steep tariffs include smartphones, computers, semiconductors, and flat panel display modules. But the updated guidance did not address any changes to the existing 20% tariff on Chinese goods in response to China's involvement in the fentanyl trade. According to the U.S. International Trade Commission , China has long been America's chief source for electronic products, with Mexico, Taiwan, Vietnam, and Malaysia rounding out the top five. There was also concern for American tech giants that rely on supply chains in China, like Apple. Before the updated guidance, Apple was expected to experience major setbacks as a result of the tariffs, Dan Ives, global head of technology research at Wedbush Securities, told CNBC earlier this week. Tariffs smartphones Facebook Flipboard Email Sponsor Message Sponsor Message Become an NPR sponsor", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.npr.org/2025/04/12/nx-s1-5363025/apple-iphone-tariff-exemption-china", "source": "NPR", "published_at": "2025-04-12T16:58:13"}], "timeline": [{"date": "2025-04-12T16:59:52", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:01:02", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:02:00", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:09:43", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:11:50", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:17:30", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:19:54", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:20:07", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:20:21", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:29:43", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:32:14", "score": 0.9, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:34:48", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:36:04", "score": -0.9, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:39:00", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:39:03", "score": -0.8, "sentiment": "NEGATIVE"}]}