{"company": {"id": 2, "name": "Apple", "aliases": ["AAPL", "Apple Inc"]}, "stats": {"POSITIVE": 12, "NEGATIVE": 6, "NEUTRAL": 13, "TOTAL": 31, "AVG_SCORE": 0.15483870967741942}, "mentions": [{"id": 69, "title": "Big law in Trump's crosshairs", "content": "Trump targets big law firms with executive orders : Consider This from NPR : NPR Accessibility links Skip to main content Keyboard shortcuts for audio player Trump targets big law firms with executive orders : Consider This from NPR For weeks, President Trump has been targeting certain law firms with executive orders. Some have fought back, but others have cut deals to avoid the damage. For our weekly Reporter's Notebook series, we dive into this legal drama with NPR's Justice Correspondent Ryan Lucas, to see how this use of executive power is changing the landscape of the American legal system. For sponsor-free episodes of Consider This, sign up for C onsider This+ via Apple Podcasts or at plus.npr.org . Email us at considerthis@npr.org . Consider This from NPR NPR Consider This from NPR LISTEN & FOLLOW NPR App Apple Podcasts Spotify Amazon Music iHeart Radio YouTube Music RSS link Big law in Trump's crosshairs April 12, 2025 1:20 PM ET Big law in Trump's crosshairs Listen · 11:36 11:36 Toggle more options Download Embed Embed < iframe src=\"https://www.npr.org/player/embed/1249801195/1269103672\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\"> Enlarge this image WASHINGTON, DC - APRIL 09: U.S. President Donald Trump speaks to reporters as he signs executive orders in the Oval Office. (Photo by Anna Moneymaker/Getty Images) Anna Moneymaker/Getty Images hide caption toggle caption Anna Moneymaker/Getty Images WASHINGTON, DC - APRIL 09: U.S. President Donald Trump speaks to reporters as he signs executive orders in the Oval Office. (Photo by Anna Moneymaker/Getty Images) Anna Moneymaker/Getty Images For weeks, President Trump has been targeting certain law firms with executive orders. Some have fought back, but others have cut deals to avoid the damage. For our weekly Reporter's Notebook series, we dive into this legal drama with NPR's Justice Correspondent Ryan Lucas, to see how this use of executive power is changing the landscape of the American legal system. For sponsor-free episodes of Consider This, sign up for C onsider This+ via Apple Podcasts or at plus.npr.org . Email us at considerthis@npr.org . Sponsor Message This episode was produced by Noah Caldwell. It was edited by Adam Raney and Courtney Dorning. Our executive producer is Sami Yenigun. Facebook Flipboard Email Sponsor Message Sponsor Message Become an NPR sponsor", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.npr.org/2026/01/01/1249801195/trump-goes-after-big-law", "source": "NPR", "published_at": "2025-04-12T17:20:33"}, {"id": 70, "title": "Trump’s sudden tariff exemptions on key tech imports remove a ‘doomsday scenario’ for the industry, top analyst says", "content": "Trump’s sudden tariff exemptions on key tech imports remove a ‘doomsday scenario’ for the industry, top analyst says Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Trump’s sudden tariff exemptions on key tech imports remove a ‘doomsday scenario’ for the industry, top analyst says fortune.com/2025/04/12/trump-tariff-exemptions-tech-imports-black-swan-event-dan-ives The Trump administration announced numerous exemptions late Friday night to his \"reciprocal tariffs,\" including popular consumer electronics and critical tech components. That offers a huge reprieve for US technology leaders like Apple and Nvidia, prompting Wedbush analyst Dan Ives to… This story appeared on fortune.com , 2025-04-12 17:16:54. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/52e7bb5a5fe44f9c", "source": "Biztoc.com", "published_at": "2025-04-12T17:20:21"}, {"id": 71, "title": "Accessory Maker Anker Raises Prices Following US Tariffs", "content": "Accessory Maker Anker Raises Prices Following US Tariffs Oliver Haslam · April 12, 2025 Accessory Maker Anker Raises Prices Following US Tariffs Anker, the Chinese accessory maker, has raised its prices on Amazon following the application of new tariffs brought about by the United States government. Reuters reports that the company, which makes phone cases, power banks, adapters, cables, and more, raised prices on a fifth of its products since Thursday. The move comes as the company passes the cost of US tariffs onto its US-based customers. Some 127 Anker products have seen an average increase of 18% since Thursday last week, with the majority of those occurring after Monday, April 7, when U.S. President Donald Trump added an extra 50% import duty on Chinese goods, according to data from e-commerce services provider SmartScout. Reuters notes that, on an investor call earlier in the week, Anker had said that it was able to raise prices “as it had bargaining power and because its rivals were mainly Chinese and under similar tariff pressure, but did not provide specifics.” Ultimately, more companies could well choose to follow suit. Tariffs make it more costly for companies to bring goods from specific countries into the United States. One way that those companies can negate the additional costs while protecting their profits is to increase prices, effectively passing the cost of the tariffs onto customers. The result is that US-based customers pay more for products as a result of the tariffs that were imposed by its leaders. You may also like to check out: Download: iOS 18.4 Final IPSW Links, OTA Update For iPhone, iPadOS 18.4 For iPad Released Jailbreak iOS 18.4 Status For iPhone And iPad Update iOS 18 Hidden Features For iPhone And iPad [100+ List] How To Fix Bad iOS 18 Battery Life Drain On iPhone Fix iOS 18 WiFi: Keeps Dropping, Not Working, Disconnecting Or Slow? Here’s What To Do You can follow us on X , or Instagram , subscribe to our YouTube channel and even like our Facebook page to keep yourself updated on all the latest from Microsoft, Google, Apple, and the Web TRENDING NOW iPhone Price Hike Fears Laid To Rest After Tax Exemptions Tesla’s 2025 Spring Update Brings B-Pillar Recording, Dashcam Upgrades, and More This App Just Brought ChatGPT To The iPhone 3GS Apple Watch Could Get Apple Intelligence And A visionOS-Inspired Redesign Apple’s First Foldable iPad Could Now Launch In 2026, Analyst Says Microsoft Becomes World’s Most-Valuable Public Company, Ousting Apple Thanks To Tariffs Meta Is Finally Working On An Instagram iPad App, Insider Claims Latest iOS 19 Design Leak Hints At New Icons And More Apple Launches Immersive Video Utility App For Mac And Vision Pro Creators New 20th-Anniversary iPhone 19 Pro Design Tipped FOR YOU How To Install iOS 18 And iPadOS 18 Final Version The Correct Way Here’s What To Expect From Apple At ‘It’s Glowtime’ September 9 Event iOS 18.1 Release Will Bring These Features To iPhone Later This Year And Beyond iOS 18.3.2 Battery Life Drain Test Brings Bad News For iPhone 16 Owners iOS 18.2 To Bring iOS 18.1 Apple Intelligence Delayed Features iPhone 16 Pro Max Tipped For New, Denser Battery And Altered Housing How To Fix Bad iOS 18 Battery Life Drain On iPhone Download: iOS 18.1 Public Beta 2, iPadOS 18.1 Public Beta 2 And More Released Start typing to see results or hit ESC to close Apple iPhone deals iPad Android See all results SUBSCRIBE Join 100k+ other tech lovers and get the latest news in your inbox [mc4wp_form id=\"389\"]", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.redmondpie.com/accessory-maker-anker-raises-prices-following-us-tariffs/", "source": "redmondpie.com", "published_at": "2025-04-12T17:20:07"}, {"id": 72, "title": "Jim Cramer On Apple Inc. (AAPL): “Own Apple, Don’t Trade It!”", "content": "If you click 'Accept all', we and our partners, including 239 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+702 chars]", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_bd0443dc-dee3-4e29-91aa-6ebc603a20a4", "source": "Yahoo Entertainment", "published_at": "2025-04-12T17:19:54"}, {"id": 73, "title": "Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns", "content": "Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Home Breaking News Hacking Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Pierluigi Paganini April 12, 2025 Fortinet warns attackers can keep read-only access to FortiGate devices even after the original vulnerability is patched. Fortinet warns that threat actors can retain read-only access to FortiGate devices even after the original vulnerability used for the breach has been patched. The cybersecurity firm revealed that attackers exploited known FortiGate flaws like CVE-2022-42475 , CVE-2023-27997 , and CVE-2024-21762 to gain persistent read-only access via a symlink in SSL-VPN language folders. “A threat actor used a known vulnerability to implement read-only access to vulnerable FortiGate devices. This was achieved via creating a symbolic link connecting the user filesystem and the root filesystem in a folder used to serve language files for the SSL-VPN. This modification took place in the user filesystem and avoided detection.” reads the advisory published by Fortinet. “Therefore, even if the customer device was updated with FortiOS versions that addressed the original vulnerabilities, this symbolic link may have been left behind, allowing the threat actor to maintain read-only access to files on the device’s file system, which may include configurations.” Fortinet pointed out that only devices with SSL-VPN enabled are impacted. The company added that scans show the attacks weren’t limited to any specific region or industry. Fortinet mitigated the attack by deploying AV/IPS signatures, updating releases to block the symbolic link, and urging customers to patch devices while maintaining transparency. The company did not link the attacks to a certain threat actor, however, the investigation is still ongoing. Below are the FortiOS mitigations released by the company: FortiOS 7.6.2, 7.4.7, 7.2.11 & 7.0.17, 6.4.16: The SSL-VPN UI has been modified to prevent the serving of such malicious symbolic links. FortiOS 7.4, 7.2, 7.0, 6.4: The symbolic link was flagged as malicious by the AV/IPS engine so that it would be automatically removed if the engine was licensed and enabled. FortiOS 7.6.2, 7.4.7, 7.2.11 & 7.0.17, 6.4.16: Upgrading to this release will remove the malicious symbolic link. The cybersecurity vendor notified impacted customers and provided the following mitigations: Treat all configuration as potentially compromised and follow the recommended steps below to recover: Upgrade all devices to 7.6.2, 7.4.7, 7.2.11 & 7.0.17 or 6.4.16. Review the configuration of all devices. Follow me on Twitter: @securityaffairs and Facebook and Mastodon Pierluigi Paganini ( SecurityAffairs – hacking, FortiOS) facebook linkedin twitter Fortinet FortiOS Hacking hacking news information security news IT Information Security Pierluigi Paganini Security Affairs Security News you might also like Pierluigi Paganini April 13, 2025 SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41 Read more Pierluigi Paganini April 13, 2025 Security Affairs newsletter Round 519 by Pierluigi Paganini – INTERNATIONAL EDITION Read more leave a comment newsletter Subscribe to my email list and stay up-to-date! recent articles SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41 Malware / April 13, 2025 Security Affairs newsletter Round 519 by Pierluigi Paganini – INTERNATIONAL EDITION Breaking News / April 13, 2025 China admitted its role in Volt Typhoon cyberattacks on U.S. infrastructure APT / April 13, 2025 Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Hacking / April 12, 2025 Attackers are exploiting recently disclosed OttoKit WordPress plugin flaw Security / April 12, 2025 We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://securityaffairs.com/176473/hacking/symbolic-link-trick-lets-attackers-bypass-fortigate-patches-fortinet-warns.html", "source": "Securityaffairs.com", "published_at": "2025-04-12T17:17:30"}, {"id": 74, "title": "Trump administration says it will exclude some electronics from reciprocal tariffs", "content": "Trump administration says it will exclude some electronics from reciprocal tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 9:38 AM Updated: April 13, 2025 at 9:05 AM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS FILE - A police vehicle flashes its lights in Philadelphia, Monday, Jan. 17, 2022. (AP Photo/Matt Rourke, File) 1 hour ago Man arrested, accused of running female over with vehicle, San Antonio police say Read full article: Man arrested, accused of running female over with vehicle, San Antonio police say A pedestrian was hit and killed while walking on Loop 410, according to San Antonio police. 2 hours ago Pedestrian hit, killed while walking on Loop 410, SAPD says Read full article: Pedestrian hit, killed while walking on Loop 410, SAPD says Three people were hospitalized after a shooting on the Southwest Side, according to San Antonio police. 2 hours ago 3 hospitalized after shooting on Southwest Side, SAPD says Read full article: 3 hospitalized after shooting on Southwest Side, SAPD says As April’s full moon rose on Saturday night, several KSAT viewers shared photos of a “mysterious ring” and a “flying object” in the sky. 14 minutes ago KSAT viewers share sightings of ‘mysterious ring’ illuminating sky during the pink moon Read full article: KSAT viewers share sightings of ‘mysterious ring’ illuminating sky during the pink moon KSAT DEALS Jump for joy - deals are here! SA Live deals this week: Stack up the savings Read full article: SA Live deals this week: Stack up the savings Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Business Trump administration says it will exclude some electronics from reciprocal tariffs Mae Anderson Associated Press Published: April 12, 2025 at 9:38 AM Updated: April 13, 2025 at 9:05 AM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Loading... Recommended Videos KSAT DEALS Jump for joy - deals are here! SA Live deals this week: Stack up the savings Read full article: SA Live deals this week: Stack up the savings Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.ksat.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "KSAT San Antonio", "published_at": "2025-04-12T17:15:39"}, {"id": 75, "title": "Trump exempts smartphones, laptops, and semiconductors from new tariffs", "content": "Trump exempts smartphones, laptops, and semiconductors from new tariffs | TechCrunch Trump exempts smartphones, laptops, and semiconductors from new tariffs | TechCrunch Image Credits: Andrew Harnik / Getty Images Government & Policy Trump exempts smartphones, laptops, and semiconductors from new tariffs Anthony Ha 10:11 AM PDT · April 12, 2025 The Trump administration is carving out big tariff exemptions for the tech industry. While President Donald Trump said Wednesday that he would delay many of the market-shaking tariffs that he’d announced the previous week, he kept a universal baseline 10% tariff in place, while also increasing tariffs on Chinese goods to 125% (on top of a 20% tariff that he’d already imposed on goods from China). There’s been plenty of speculation about what the tariffs will mean for the tech industry , which manufactures many consumer electronics in China and elsewhere abroad. One of Trump’s stated goals is to bring manufacturing back to the United States, but others believe the dream of an American-made iPhone is a fantasy . Those debates may be paused after Friday evening, when U.S. Customs and Border Protection posted a list of product categories that are “excluded from the reciprocal tariffs imposed under Executive Order 14257,” with the exclusions backdated to April 5. Those categories appear to include smartphones, laptops, hard drives, and semiconductors. Those products will all be exempt from both the 125% tariff on goods from China, as well as the universal baseline tariff. (Other tariffs, such as the previous 20% tariff on Chinese goods, would presumably still apply.) Notable Silicon Valley figures led by Elon Musk have joined the Trump administration, while other tech CEOs have been courting Trump, most visibly with millions of dollars donated to his inauguration. Those efforts seemed to bear little fruit — until last night’s announcement, which Daniel Ives, global head of technology research at Wedbush Securities, described as “a dream scenario for tech investors.” Tech giants like Apple and Nvidia are likely celebrating the news, as are U.S. consumers who will avoid a big markup on their next iPhone. But the industry could still be hit with more targeted tariffs and other restrictions. For example, The New York Times reports that the Trump administration is preparing a national security-related investigation into semiconductors. And indeed, U.S. Commerce Secretary Howard Lutnick said Sunday that these products would be included in “the semiconductor tariffs, which are coming in probably a month or two.” This post has been updated with Howard Lutnick’s comments about the tariffs. Topics Apple , Donald Trump , Government & Policy , Hardware , Tariffs Anthony Ha Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. View Bio View Comments Most Popular OpenAI co-founder Ilya Sutskever’s Safe Superintelligence reportedly valued at $32B Anthony Ha Trump exempts smartphones, laptops, and semiconductors from new tariffs Anthony Ha Week in Review: Jeff Bezos’ secret EV startup Karyne Levy The most interesting startups showcased at Google Cloud Next Julie Bort Hacked documents reveal guide to serving Elon Musk on private jets Rebecca Bellan OpenAI will soon phase out GPT-4 from ChatGPT Kyle Wiggers Fintech founder charged with fraud after ‘AI’ shopping app found to be powered by humans in the Philippines Charles Rollet Loading the next article Error loading the next article", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://techcrunch.com/2025/04/12/trump-exempts-smartphones-laptops-and-semiconductors-from-new-tariffs/", "source": "TechCrunch", "published_at": "2025-04-12T17:11:51"}, {"id": 76, "title": "Apple’s Mythic Quest has come to an end", "content": "Apple’s Mythic Quest has come to an end | The Verge Skip to main content The homepage The Verge The Verge logo. The homepage The Verge The Verge logo. Menu Expand Navigation Drawer The Verge The Verge logo. Login / Sign Up close Close Search Subscribe Facebook Threads Instagram Youtube RSS Comments Drawer Entertainment / TV Shows Apple’s Mythic Quest has come to an end The fourth season finale episode, now the last of the series, will get a new ending next week. The fourth season finale episode, now the last of the series, will get a new ending next week. by Wes Davis Apr 12, 2025, 5:11 PM UTC Link Facebook Threads Rob McIlhenney and Charlotte Nicdao in Mythic Quest. Image: Apple Wes Davis is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020. Mythic Quest, the Apple TV Plus comedy about a game studio, isn’t getting a fifth season, reports Variety . And, like a developer issuing a farewell patch, Apple is updating the final episode of season four with a new “goodbye” ending next week. Variety published a statement from Mythic Quest ’s executive producers: “Endings are hard. But after four incredible seasons, ‘Mythic Quest’ is coming to a close,” said series executive producers Megan Ganz, David Hornsby, and Rob McElhenney. “We’re so proud of the show and the world we got to build—and deeply grateful to every cast and crew member who poured their heart into it. To all our fans, thank you for playing with us. To our partners at Apple, thank you for believing in the vision from the very beginning. Because endings are hard, with Apple’s blessing we made one final update to our last episode—so we could say goodbye, instead of just game over.” The news comes just weeks after a report that Apple has been losing $1 billion a year on TV Plus. The show just wrapped up its fourth season and released a f our-episode spinoff called Side Quest on March 26th. One of the early Apple TV Plus shows, Mythic Quest tells the story of Mythic Quest Studios, a fictional games studio led by Ian Grimm, Rob McElhenney’s parody of a visionary tech founder bro, and Charlotte Nicdao’s Poppy Li, an awkward but brilliant engineer who serves as his co-creative director. Throughout the series, Mythic Quest sent up the tech industry, from lampooning startup culture to raising some of the gaming world’s darker ethical questions . But to echo an early Verge write-up of Mythic Quest , you don’t need to understand any of that to enjoy the show. Mythic Quest also stars David Hornsby, Ashly Burch, Imani Hakim, Danny Pudi, Jessie Ennis, Naomi Ekperigin, Andrew Friedman, and Michael Naughton. See More : Entertainment Streaming TV Shows Most Popular Most Popular ChatGPT is transforming LinkedIn users into really dull dolls Blue Prince will steal your time just like Balatro Apple’s Mythic Quest has come to an end Bungie’s slick-looking Marathon shooter arrives on September 23rd Trump excludes smartphones, computers, chips from higher tariffs Installer A weekly newsletter by David Pierce designed to tell you everything you need to download, watch, read, listen to, and explore that fits in The Verge’s universe. Email (required) Sign Up By submitting your email, you agree to our Terms and Privacy Notice . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Advertiser Content From This is the title for the native ad More in TV Shows Doctor Who’s new companion is going to keep him on his toes Mike Flanagan is adapting Stephen King’s Carrie for Amazon A UK edition of Saturday Night Live is premiering in 2026 Black Mirror season 7 tugs at your heartstrings while skewering tech The Last of Us renewed for season 3 just ahead of HBO return Murderbot is going through it in the first trailer for Apple’s sci-fi series Doctor Who’s new companion is going to keep him on his toes Charles Pulliam-Moore Apr 11 Comments Comment Icon Bubble Mike Flanagan is adapting Stephen King’s Carrie for Amazon Charles Pulliam-Moore Apr 10 Comments Comment Icon Bubble A UK edition of Saturday Night Live is premiering in 2026 Charles Pulliam-Moore Apr 10 Comments Comment Icon Bubble Black Mirror season 7 tugs at your heartstrings while skewering tech Andrew Webster Apr 10 Comments Comment Icon Bubble The Last of Us renewed for season 3 just ahead of HBO return Jay Peters Apr 9 Comments Comment Icon Bubble Murderbot is going through it in the first trailer for Apple’s sci-fi series Andrew Webster Apr 9 Comments Comment Icon Bubble Advertiser Content From This is the title for the native ad Top Stories 2:00 PM UTC Wool, water, Wi-Fi: Modernizing an ancient business at the final frontiers of e-commerce 6:36 AM UTC Freitag’s newest messenger bag is made from trash to last Apr 12 Bungie’s slick-looking Marathon shooter arrives on September 23rd Apr 12 Trump excludes smartphones, computers, chips from higher tariffs Apr 12 Blue Prince will steal your time just like Balatro Apr 11 South of Midnight is a game worth hollerin’ about", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.theverge.com/tv/647661/apples-mythic-quest-has-come-to-an-end", "source": "The Verge", "published_at": "2025-04-12T17:11:50"}, {"id": 77, "title": "Apple, Google, Cash App alums ditch Big Tech to build on bitcoin, fueled by VC money and friendly White House", "content": "Apple, Google, Cash App alums ditch Big Tech to build on bitcoin, fueled by VC money and friendly White House Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Apple, Google, Cash App alums ditch Big Tech to build on bitcoin, fueled by VC money and friendly White House cnbc.com/2025/04/12/apple-google-cash-app-alums-ditch-big-tech-to-build-on-bitcoin.html In Austin, Apple, Google, and Cash App alums ditch big paychecks for bitcoin, backed by VCs, crypto friendly policy and belief that this time, it is different. This story appeared on cnbc.com , 2025-04-12 16:50:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/7faf4d69e9dcb862", "source": "Biztoc.com", "published_at": "2025-04-12T17:09:43"}, {"id": 61, "title": "'Mind-blowing': MSNBC host stunned by 'huge' new Trump retreat", "content": "'Mind-blowing': MSNBC host stunned by 'huge' new Trump retreat - Raw Story PLAY GAMES. RAW WORD DAILY JOIN RAW STORY FOR JUST $1 About us Games US NEWS Investigations Opinion video HELP get the newsletter PLAY RAW WORD DAILY. JOIN RAW STORY FOR JUST $1 Home Shop to Support Independent Journalism Trump U.S. News World Science Video Investigations Ethics Policy 'Mind-blowing': MSNBC host stunned by 'huge' new Trump retreat Tom Boggioni April 12, 2025 1:09PM ET Tom Boggioni Senior Editor Tom Boggioni is a writer, born, raised and living in San Diego — where he attended San Diego State University. Prior to writing for Raw Story, he wrote for FireDogLake, blogged as TBogg, and worked in banking, marketing and construction. See Full Bio MSNBC host Stephanie Ruhle (MSNBC screenshot) MSNBC host Stephanie Ruhle appeared with her old hosting partner Ali Velshi on Saturday morning to weigh in on a major announcement from Donald Trump's administration on Chinese imports. In a bulletin posted by U.S. Customs and Border Protection late Friday, the administration announced smartphones, computers, and assorted electronics would be exempt from the ruinous 145% percent tariffs imposed on other Chinese products. As Ruhle, a former hedge fund trader put it, \"This is huge.\" Speaking with Velshi, she elaborated, \"So just imagine all the big electronics that we get that's manufactured in China , right? Chips, semiconductors, TVs, cell phones –– all the big electronics out there are now going to be tariff-free. I mean, Ali, this is extraordinary.\" \"It's kind of like saying we're going to impose 100 plus percent tariffs on everything we buy from China, except for what we actually buy from them,\" she dryly quipped. \"It's sort of crazy because we haven't even started negotiating, you know, this trade war and already we're making this announcement.\" \"It's mind-blowing i n that in the last week what have we done,\" she added. \"The president announced the moves on tariff, we saw the stock market crater, we saw the bond market get whacked, which is the most concerning because it means people don't have faith in the U.S.\". \"We saw consumer confidence absolutely crater and businesses big and small fall into an absolute panic, given what an enormous trading partner China is, but also countries around the world, but focusing just on china, man, if you are [ Apple head] Tim Cook or the other big tech CEO's who gave big and went to Trump's inauguration, you are glad you did that,\" she observed. You can watch below or at the link. - YouTube youtu.be SmartNews Trump News Video For customer support contact support@rawstory.com . Report typos and corrections to corrections@rawstory.com . Stories Chosen For You READ COMMENTS - JOIN THE DISCUSSION Do you support Trump’s recent tariffs imposed on major trade partners? Matt Laslo 'All hands on deck': Democrats unleash new strategy to derail Trump Sabrina Haake Trump is drinking his own Kool-Aid as evidence of his dementia grows John Stoehr Trump is about to target something far more terrifying than tariffs Copyright © 2024 Raw Story Media, Inc. PO Box 21050, Washington, D.C. 20009 | Masthead | Privacy Policy | Manage Preferences | Debug Logs For corrections contact corrections@rawstory.com , for support contact support@rawstory.com . {{ post.roar_specific_data.api_data.analytics }}", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.rawstory.com/trump-mindblowing/", "source": "Raw Story", "published_at": "2025-04-12T17:09:22"}, {"id": 62, "title": "Pokémon X Hatsune Miku \"Project Voltage\" collab supplemental illustration for April 12th, 2025", "content": "Pokémon X Hatsune Miku \"Project Voltage\" collab supplemental illustration for April 12th, 2025 | GoNintendo Front Page The Blog Pokémon X Hatsune Miku \"Project Voltage\" collab supplemental illustration for April 12th, 2025 They are what you eat 12 April 2025 by quence 0 A few months back, we reported on the collaboration between The Pokémon Company and the renowned Japanese Vocaloid, Hatsune Miku, titled “Project Voltage 18 Types 18 Songs.” This project promised 18 songs and accompanying illustrations, each representing a unique Pokémon type. The eighteenth and final illustration was released back in late September 2024, but it turned out there’s even more art to look forward to. These supplemental art pieces will release on random dates, but they’ll continue to showcase Hatsune Miku and Pokémon together. Along with that, the art will spotlight some other Vocaloid idols as well. The latest piece of art is titled “Apple Festival,“ and it was created by artist Yuu Nishida. Will this be the final release in this series? Only time will tell! [ NintendoSoup ] Comment History Loading... Close Add Comment Sign in or, Sign up Comments (0) No comments yet. Be the first! Comment Upvoting Details Loading... Close", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://gonintendo.com/contents/47416-pokemon-x-hatsune-miku-project-voltage-collab-supplemental-illustration-for-april", "source": "GoNintendo", "published_at": "2025-04-12T17:02:00"}, {"id": 21, "title": "35 Things You May Have Put Off Buying, But It’s Tiiiimeee", "content": "35 Things You May Have Put Off Buying, But It’s Time BuzzFeed Shopping logo BuzzFeed Shopping logo Search Gift Guide Beauty + Personal Care Fashion Home Sports + Fitness Stores Tech Kids Pets Sex Toys View All We hope you love our recommendations! Some may have been sent as samples, but all were independently selected by our editors. Just FYI, BuzzFeed and its publishing partners may collect a share of sales and/or other compensation from the links on this page. Posted 9 hours ago Subscribe to Shopping Newsletter Caret Down 35 Things You May Have Put Off Buying, But It’s Tiiiimeee If your current knives can barely cut through an apple, then do yourself a favor and grab this super affordable (and ADORABLE) floral set. by Iman Sakrani BuzzFeed Staff Facebook Pinterest Link 1. A flexible drain snake that'll get out all those clumps of hair and gunk so the bathtub stops filling up past your ankles every time you shower. Just stick it down the drain, twist it, and the ridges at the end will catch all the goop, making sure it all comes out. Amazon, www.amazon.com This pack contains a reusable handle and five single-use heads that you just remove and dispose of after handling your clogged pipes. Promising review: \"Wow. Best thing ever. Seriously. I have had tweezers and sticks and plumbers and chemicals trying to get my master sink to drain. Plumber even said I need an entirely new faucet to get the drain plug part because they don't sell those separately. Well, I have two sinks, a tub, and shower that all match so that was not a valid solution. Doubt I can find the same model. So I bought this thing, stuffed it down, and pulled up hair and black muck. Did it about eight times quickly, ran the water, went right down the drain. Seriously. This is the best tool ever and the best $20 I have ever spent. Everyone with a sink needs this tool. Seriously.\" — juliejules Get a five-pack from Amazon for $19.99 (also available in other sets and styles). 2. A pack of 120 retainer cleaner tablets because it turns out your Invisalign is supposed to be ~clear~ (it also works on mouthguards and dentures!). All you do is drop a tablet into warm tap water, let your dental device soak for a few minutes, and voila! — it'll kill bacteria and remove the buildup that's causing discoloration and unpleasant odors. www.amazon.com Promising review: \"I really loved this product. I am currently waiting for a new Invisalign set. My old Invisalign needed to be cleaned. I read the reviews and decided to purchase. OMG, it worked! They had a fresh taste and were clean. I wish I had found this product sooner. I did let them soak overnight only because I had been wearing them for the last four months. Nothing happened to Invisalign; there was no weakness or anything. Just very clean and fresh. If I could have given the product 10 stars, I would have. \" — Lisa R. Get 120 tablets from Amazon for $18.81 (available in five pack sizes). 3. A new pair of workout leggings to replace the super pilled ones you wear three times a week. They're made with a thick, buttery soft fabric (no one is seeing those hot pink undies) and have ~pockets~ so you don't have to carry your phone around the gym. www.amazon.com , www.amazon.com Promising review: \"THESE...are the best leggings I have ever worn in my entire life! They are so smooth and comfortable. Soft as butter. They fit perfectly. It almost feels like you're naked but they feel somehow insulated and cozy. Stretchy and made of amazingly durable quality. I need to get more colors!\" — Alexandra Shick Get them from Amazon for $24.98 (available in women's sizes XS–XXL, in three inseam lengths, and 45 colors). 4. A pack of AirPods cleaning putty because it's so embarrassing when you want to share earbuds with someone, but yours are coated in wax and dust. Plus, it's soooo satisfying to squish the lil' square into your speaker and see all the gunk it pulls out — and then you get to enjoy clearer, louder-sounding music! www.amazon.com Before you toss your tech in the trash, at least give this a try. Promising review: \"I never usually write reviews but this is an exception. I've had my AirPods for over a year and when the sound quality was diminishing, I was afraid they had a short life expectancy and I would need to get a new pair! Even after using cotton buds to clean the AirPods out, I thought that was enough until my friend said there's stuff built up and hard to see, but there was nothing able to get it out! Enter this product. It literally took five minutes to clean each ear bud effectively and instantly the sound quality was as good as new! Loud, clear, less trouble connecting to my phone, etc. You don't need a full square to clean them, so you can pull a piece off or reuse a square with a side you haven't used! SO happy I found a solution!\" — Amazon Customer Get 24 squares from Amazon for $15.99 (available in two pack sizes). 5. A veggie chopper for keeping your counter tidy while speeding up your prep time. If you love to cook but hate chopping (who doesn’t, right?), this thing is a lifesaver. It chops just about everything — onions, peppers, zucchinis, potatoes, you name it! Plus, it comes with different blades for slicing, dicing, and even spiraling your favorite veggies. www.amazon.com , Amazon Check out a TikTok of the veggie chopper in action. Promising review: \"If you cook, you need this product! I have had this chopper since 2018 and it is by far my favorite kitchen purchase. I have used it hundreds of times over the years and it has held up great. I just bought my MIL one for Christmas and she already loves how much easier it has made meal prep . It is well made and I like that there are different attachments and sizes. I would recommend this chopper!\" — Steph Get it from Amazon for $23.99+ (available in five colors and five sets). 6. A pack of two antimicrobial \"flossing toothbrushes\" because your current one looks like it was used to scrub the bathroom floor (no offense). This has dual-layered bristles: regular ones and ultra-long, thin flossing bristles that get *deep* in between your teeth and gums. Reviewers are saying it feels like they got their teeth cleaned at the dentist, but nope! — just this very innovative toothbrush. Emma Lord / BuzzFeed Mouthwatchers is a small business established by Ronald Plotka, DDS, specializing in antimicrobial toothbrushes designed for deeper cleans. Here's what BuzzFeed Shopping writer Emma Lord has to say: \"I love it just after the first few days of use! I use an electric toothbrush usually, but I feel like I'm getting a much more satisfying clean from these?? Especially because I tend to get yellow stains between my teeth no matter *how* much I floss, and these bristles seem to actually target that a lot more effectively.\" Promising review: \"I'm amazed at how well this toothbrush cleans my teeth — it definitely gets between the teeth and also, more importantly for me, gets in the small, deep crevices in my molars where I always have food stuck, and regular toothbrushes couldn't get stuff out. I brush more often (after meals/snacks) because of how effective it is. As stated, definitely go easy around the gums. The bristles feel soft but will cause your gums to bleed if you use regular pressure. Nice and easy does the trick, SO WELL!\" — Jason A. Get a pair from Amazon for $9.99 . 7. A WD-40 pen if your squeaky cabinets are driving you up the wall. It's way less messy than traditional spray methods, and reviewers love the precision this pen offers — perfect for getting into tight spaces and silencing those squeaks once and for all. www.amazon.com Promising review: \"I love WD-40 products and use them for everything. I spray on shovels to keep dirt or snow from sticking, spray around windows and thresholds to deter bugs, clean Sharpies off wood and walls, and, of course, stop squeaky doors. These small direct-point application pens are great. Keep one in the glove box, my kitchen 'junk' drawer, and the house toolbox.\" — BBP623 Get a three-pack from Amazon for $12.99 . 8. A wall-mounted organizer to handle those annoying brooms, mops, rakes, and shovels that are always falling over. This rack has five slots and can hold up to 38 pounds, so it’ll keep everything neatly stored and off the floor. www.amazon.com It comes with screws, anchors, a drilling template, and a guide — everything you'll need to set this up. Promising review: \"Perfect! Exactly what I needed to organize my mop, broom, scoop, etc. Efficient and easy to use. A little hard to get my scoop into it, but that’s because it’s thicker than the rest of the items. Love that there are hooks. Spray bottles and cleaning product bottles hang perfectly on there too.\" — Kavita Chandanie Get it from Amazon for $13.99 (available in two sizes and two colors). 9. A set of double-sided shower rings that make changing your shower curtain or liner easier than it's ever been. Since you hang the curtain on one side and the liner on the other, you'll avoid the hassle of taking the whole thing down every time you switch the curtain/liner. www.amazon.com Promising review: \"This is one of those items you didn’t know you needed, and once you get it, you can’t help but wonder how you ever managed before. I absolutely hate taking the shower curtains off because of the whole open and close for several shower curtains. I know you’re like, ‘It’s just shower curtain hooks.’ And it is. But when you have to change out the creepy shower liner that likes to attack you, and you dread doing so, this just adds seconds to your life. No more unsnapping. Simply take out the liner, place the liner on the appropriate hook, and presto.\" — Nardsbaby Get it from Amazon for $6.99+ (available in 18 colors). 10. A powerful massage gun with five speeds and massage heads — it’s great for targeting various muscle groups, so you can use it on your back, shoulders, arms, legs, and pretty much anywhere that hurts. It delivers a deep massage that helps relieve the soreness and stiffness that you've been living with for far too long. www.amazon.com Read more about what massage guns can (and can’t) do, plus how to use them, at Cleveland Clinic . Promising review: \"I have had chronic issues with pain caused by severely knotted muscles. This massager changed my life! I have tried muscle relaxers, stretching, and many other things, but a couple of muscles in my upper back would just knot up with any stress, physical or emotional, and the pain was nearly constant. I used this for about a half hour on all of my muscles with the first use, and the effects were immediate and profound. Pain relief was instant , and occasional use for a couple of minutes to the affected areas has been able to maintain that relief. I loved it so much that I bought one for my brother, who says it is helping him tremendously, as well. I have charged my massager twice in the last two months, battery life is excellent!\" — Patty S. Get it from Amazon for $89.99 (available in seven colors). 11. A Squatty Potty that elevates your feet to help mimic a natural squatting position for easier, more complete bowel movements. Just because it helps your trips to the bathroom be quicker doesn’t mean you can’t still enjoy some quality TikTok scrolling time while you’re in there! Amazon, www.amazon.com I have one and it has truly made that aspect of life (🚽) soooo much easier! The only downside is that public restrooms don't have these and I kind of can't go without it lol. Read more about constipation relief at home, including using a squatting position, at Cleveland Clinic . And if you want more Squatty Potty content before making this life-changing purchase, check out our Squatty Potty review ! Promising review: \"I'll do you all the courtesy of NOT adding a photo or video (You're welcome). This works. Whoever invented the toilet had their heart in the right place, but not their knees. This device mimics proper positioning, and you should get one. That is all. Thank you for coming to my TedTalk.\" — P.W. Get it from Amazon for $24.97 (available in three sizes; get the acrylic version for $79.99 or the teak wood version for $50.99 ). 12. And a before-you-go toilet spray — spritz the bowl before doing your business, and you'll be able to relax knowing whoever comes in next won't detect any funky smells. www.amazon.com Promising review: \"I love the variety of scents that linger long enough to work for the purpose intended. I love giving them as gifts!!!\" — AML Get it from Amazon for $4.72+ (available in six sizes). 13. A pack of crew socks because your toe is literally poking through your current socks, like hello?? These are lightweight and breathable (perfect for a socks-and-sandals moment), and reviewers say they hold up well through repeated wash cycles — which is not something many other socks can claim! www.amazon.com Promising review: \"These socks are fantastic! I love how soft and comfortable they are. They've held up really well through repeated washes, which is a huge plus. The neutral colors are perfect for everyday wear and go with everything. I'm very impressed with the quality and would definitely buy them again.\" — Mary Jo Groter Get them from Amazon for $9.99+ (available in one size that fits women's sizes 5–10, packs of two, three, and five, and in different color sets). 14. A set of budget-friendly (under $20!!) floral kitchen knives with a nonstick coating that makes them super easy to clean. They're made from high-quality stainless steel with a beautifully sharp edge that'll have you chopping up veggies with ease (instead of having to saw through them) — and questioning why you didn't replace your old, worn-down knife set sooner. www.amazon.com You'll get a chef knife, bread knife, utility knife, santoku knife, slicing knife, and a paring knife, plus a cover for each! Promising review: \"I love these knives! I’ve had them for a year now and I haven’t had to sharpen them. Good grip, durable, and easy to handle. I hand wash them because we don’t have a dishwasher but they’re very easy to clean. I love the blade covers. It makes them safe for putting them in a drawer. I love not having a big knife block on my counter. Lightweight. They have not rusted.\" — Nvs Get the 12-piece set from Amazon for $18.99 (also available in a 10-piece set). 15. A spice drawer organizer so you can finally have the neatly arranged, easy-to-find collection of spices you've always wanted. These nonslip liners are made from a soft foam that can be trimmed to fit any drawer. Think of how much faster you'll cook dinner when you don't need to hunt for the smoked paprika! Amazon YouCopia is a woman-owned small biz that makes ingenious home and kitchen storage solutions. Promising review: \"This is one of my favorite things I've ever purchased from Amazon! I think this will be my go-to gift for all of my friends who love cooking as much as I do! Freeing up cabinet space and having something that can so easily be rinsed off in the sink makes this a for sure buy! \" — momonono Get a 10-foot roll from Amazon for $16.99 (also available in beige and two other sizes). 16. An oil stain remover that pulls out stains caused by oil, brake fluid, and other petroleum-based products from porous floor surfaces (like concrete, pavers, parking lots, etc). It's basically like skincare for your driveway! www.amazon.com Promising review: \"The scene: me with a hot glove carrying a drip pan full of au jus. Thumb goes into hot liquid. Pan is dropped, and greasy meat juice is all over our patio brick. In freezing temps. I use a putty knife to get some out, but there the stain remains six months later. Even muriatic acid didn’t cut it. Ordered this. Tried a spot. Let it dry overnight. Swept it. Stain is almost gone. I apply it to the rest of the stain and let it set. But this time it rains and turns it gooey. Fortunately, new power washer and I join forces with Chomp, and within a half hour, it’s totally gone. Amazing product. 1,000% satisfied. \" — Teddy Roosevelt Get it from Amazon for $17.97 (available in two sizes). 17. A set of gold cable organizers you can stick to your desk or nightstand to hold those cords that are always falling to the ground or getting tangled. Unlike those bulky (and tbh ugly) organizers, these'll look like beautiful gold gems in your space. Brighttia / Etsy Brighttia is a New York-based Etsy shop established in 2018 that specializes in industrial and modern interior lighting and decor. Promising review: \"These brass cable organizers are beautiful and high quality. I’m using two of them to keep a plug-in sconce cord attached to the wall and to direct the cord to the electrical outlet. These little gold pieces add a touch of functionality and glamour to the sconces. Exactly what I was looking for.\" — Amy Margolis Get a set of four from Brighttia on Etsy for $22.98 (available in 12 colors). 18. A dishwasher magnet so everyone in the house knows NOT to put their dirty spoon in with the freshly cleaned silverware. Sometimes it's too hard to tell whether the dishwasher needs to be run or unloaded, and this just clears up all the confusion. Sally Elshorafa / BuzzFeed, www.amazon.com Promising review: \"What took them so long?? Every household should have one of these. Does your partner point to the dishwasher and ask you, 'Hey, are these good?' Mine did, almost daily. Not anymore, though! A breeze to install (our dishwasher is magnetic, but I'm really glad it came with adhesive pads — someday when we move, if we need them we have them!), and even though I bought it (mostly) as a joke, I use the heck out of it. Slides easily when it needs to.\" — Andrea Braun Get it from Amazon for $6.99 (available in six styles). 19. A bestselling ChomChom pet hair remover if you want to see what your clothes, furniture, and other fabric surfaces look like *not* covered in fur. It's reusable and works its magic without using anything sticky (so no residue)! This gadget went super viral based on its results — and that's when you know a product is good. Jenae Sitzes / BuzzFeed See the ChomChom roller in action on TikTok ! BuzzFeed Shopping editor Jenae Sitzes swears by this: \"The tens of thousands of 5-star Amazon reviews are reason enough to add the ChomChom to your cart immediately — but let me add my own personal review to the stack. I've been using the ChomChom for quite a while now, and I took the photos above to show just how quick, easy, and effective this roller is. It took 10 seconds to rid my velvet couch ottoman (yes, velvet...a terrible cat owner choice, I know) of the hair my two gray kitties are constantly leaving everywhere. It takes a bit of practice to get the hang of using this roller — at first, I thought you only brushed down in one direction, and was confused why it wasn't picking up hair. It's important to do a push-and-pull brushing in *both* directions so it actually pulls the hair inside , which does require you to apply a bit of pressure. Afterward, you'll just dump out the hair that's been trapped inside. The ChomChom is best for large flat surfaces like couches and beds.\" Get it from Amazon for $24.99 (available in three colors). 20. And a bottle of Angry Orange pet odor eliminator — I know you're busy, but you simply cannot sit any longer in a house that smells like cat urine. This breaks down stains and odors at their source, leaving your home smelling fresh and citrusy without using harsh ingredients. That one spot behind the couch that your cat won't stop peeing on doesn't stand a chance. 💪 www.amazon.com , www.amazon.com Promising review: \"This product is amazing!!!! We have a Rottweiler pup and a bichon pup, and our house was feeling the PAIN! I tried everything and used to tell my wife, 'With all the science and technology in the world, we still can’t come up with something that gets rid of the dog mark smell!' This product does everything and more. Just ordered another round. We were about to throw away some furniture due to the smell and now after use we can keep it. Saved me hundreds. Well worth the money. \" — clayton s tonkin Get it from Amazon for $17.96 (available in two sizes and packs of two or three). 21. A standing weeder that uses a simple lever system to make weeding easy. It has a bamboo handle and four steel claws to really dig into those roots and pull them OUT. Your back deserves a break from playing tug of war with stubborn weeds. Amazon Grampa's Gardenware Co. is an Oregon-based, family-owned small business. Promising review: \"Oh my god, I friggin' love this tool. I bought this on a whim given we bought our first house and know nothing about caring for a yard. Boy has it come in handy. Our new house had a ton of weeds in the front yard and this tool helped me get most of them out in no time. In fact, the process of yanking out the weed was strangely satisfying! I don't think anyone can say that weeding is fun but this tool made it as close to fun as you can get , especially when you see a long root along with the weed you pulled.\" — JG Get it on Amazon for $39.99 . 22. Some foaming garbage disposal cleaning packets to clean out all the gunk from your roommates who just don't understand the concept of throwing food in the garbage instead of down the sink. Just insert a packet into the disposal with hot water trickling to the side, then turn on the disposal and watch it fizz up — soon, those gag-worthy smells will be a thing of the past. Amazon Promising review: \"Saw on TikTok (don’t judge) and automatically added to cart. So easy to use, takes probably a minute to fully bubble up and clean, and you’re left with a clean sink! I use with other drain cleaning products, but would 100% recommend for weekly maintenance.\" — Jessica Hamilton Get a four-pack from Amazon for $7.90 (available in a pack of two). 23. And while you're at it, some dishwasher tablets that break down lime and mineral buildup to properly clean your dishwasher (you know, the machine that cleans your dishes ) without *any* effort on your part. Just pop in a tablet and run the dishwasher as normal — it sure beats having to climb in there yourself and scrub. www.amazon.com Promising review: \"After using this product, I am happy to report that my $5 investment saved me over $500. I was ready to replace my dishwasher due to super cloudy glasses, residue, and dishes just not getting clean. Then, I became aware that the water softener was no longer doing its job so I had the rental company replace it. Dishwasher performance improved somewhat. I decided to do two more loads before deciding to purchase a new one. Then I saw a product test review for Affresh. I was ordering some stuff from Amazon anyway so I added that to my order. When it came, I tossed one of the tablets into the bottom of the full machine per the instructions and ran the regular cycle. I did not expect the results I got! The glassware that I thought was permanently etched and ruined came out like new. Same with cutlery. The difference is unbelievable. I will use this faithfully every month, as recommended. \" — Sheila Get a pack of six tablets from Amazon for $7.49 . 24. A three-pack of heavy duty scissors because it is TIME to upgrade those dull blades that can barely cut through paper. Reviewers love how comfortable they are to hold and how they *stay* sharp. www.amazon.com Promising review: \"Aside from these being a very inexpensive and aesthetic-looking set, they have an excellent, smooth, molded grip that feels good in the hand. The blades are thick, tight, and strong. They are built to last decades. I absolutely love them! Being a teacher, I use them several times daily, all throughout the year. You will NOT be disappointed, (unless for some odd reason you get a defective pair) I promise! 😃⭐️⭐️⭐️⭐️⭐️\" — gr8female Get a three-pack from Amazon for $9.99 (available in eight color sets and packs of 24 or 36). 25. Bioré blackhead removers to help remove all the gunk and buildup that's clogging up your pores. After having it on for about 10 minutes, you'll get to enjoy the satisfying feeling of pulling out all the little clumps and marveling at your smooth, cleared-out pores. www.amazon.com , www.amazon.com Promising review: \"I wear makeup (powder/foundation) a few times a week and these strips never disappoint! Been using them since high school! The amount of junk and buildup that comes off is so satisfying to see! It can be irritating when removing, especially if you have sensitive skin. Don’t put any moisturizers or oils on afterward; otherwise, you’ll get a pimple or two! 😬\" — Christina S. Get a pack of 24 from Amazon for $16.19 (available in four styles and five pack sizes). 26. An electric makeup brush cleaner because deep down, you know your brushes are long overdue for a thorough cleanse. It has three adjustable speeds so you can wash and dry your makeup brushes in literal minutes instead of hand washing them and then waiting hours (or even days) for them to fully dry. www.amazon.com , www.amazon.com This kit includes: the electric brush spinner, a cleaning bowl, eight brush collars, a brush cleaner dock, a charging cable, and a user guide. To use it, you just put water and/or some brush cleaning solution in the bowl, attach the brush to the electric spinner, spin the brush in the liquid until cleaned, and then spin the brush in the air to quickly dry it. Promising review: \"So, I don’t write reviews. You never really know who wrote them if they are good and if they are bad…was it a fluke? I have to say I LOVE THIS PRODUCT!! I prefer to apply my makeup with brushes and when they would get caked with product I would throw them away and buy new. Well that got expensive-quickly. I tried this product on a whim…and boy am I glad!! I wash, rinse and dry in the morning and they are dry and ready for use by lunch if I need a touch up. It does take a few minutes but SO WORTH it!! They more I use it, the faster I am getting. My brushes look new after and feel so much better on my skin. My makeup even goes on nicer. From a non-review-writing-make-up-loving girl...buy it. You will love it!!\" — Sally B Get it from Amazon for $26.99 (available in two colors). 27. Clear shelf dividers to keep your closet from looking like a thrift store donation bin. These make sure everything stays neatly folded and doesn’t topple over, creating one big mess. Plus, keeping your stacks of clothes organized and separate makes it easier to find what you need faster! Say goodbye to digging through messy piles. www.amazon.com Promising review: \"Love these acrylic shelf dividers! They make my closet look so neat and organized. I used them to divide shelves that hold my folded workout tops. I used a folding helper tool like the ones retail stores use, which gives my folded clothes a uniform width/look, and by using two dividers on each shelf, I can fit three stacks perfectly on my 30-inch wide shelves. I am ordering more to add to my shelves with sweaters! \" — Aimee Lonergan Get them from Amazon for $22.99+ (available in two sizes and in various pack sizes). 28. A supremely soft microfiber pastel duvet cover set because the one you've been using for the past five years is all pilled and covered in stains. This one even has corner ties inside to prevent the filling from bunching, so you won't have to deal with re-floofing it every three days! And it's not a heavy hit to your wallet either. Amazon, Amazon Promising review: \"I took a chance with this duvet cover. Couldn’t beat the price! If I could give the quality and comfort of this duvet cover and pillowcases 10 stars, I would!! Definitely a great buy at an extremely affordable price. The quality exceeded my expectations. It is so soft, true to size and color, wrinkle-free, and has a well-made zipper at the bottom. There are also ties on the inside to keep your duvet in place. I absolutely LOVE everything about this cover. Can’t wait to get home in my bed after a long, exhausting work shift on my feet. My furbaby loves it too! Thanks Amazon for simplifying my life! ❤️\" — Theresa Get a set from Amazon for $24.99+ (available in sizes twin–oversized king and in 30 colors). 29. A Bissell multi-purpose portable cleaner , which uses a strong suction and powerful spot remover to lift dirt and stains from floors, carpets, upholstery, and more. It’s super portable, so you can easily carry it around to clean messes all over the house, and it's ridiculously effective on stains — take it from the over 70,000 5-star reviewers who agree. www.amazon.com , www.amazon.com Promising review : \"Was ready to throw out my couch. Bought covers for my upholstered dining chairs. This machine brought all my upholstered furniture back to life. My dog puked on my rug, and this cleaned it right up and left no stain.\" — Kristen White Get it from Amazon for $123.59 (available in three styles). 30. A set of floating bookshelves because your book collection that's been sitting on the floor deserves to be properly displayed. These hold up to 15 pounds, and reviewers say they are super easy to install. Now all your books can look like they've been perpetually Wingardium Leviosa-ed! www.amazon.com Promising review: \"These are so much fun! We ordered the small size, which fits standard hardback books (approximately 5–7 hardbacks in my experience). They're a great way to add some extra storage to our very small home, and we've placed them in our hallway so people ask us about them all the time. I'd highly recommend!\" — LaBuenaVidaMere Get a set of three from Amazon for $23.65 (available in two sizes). 31. A set of adjustable clip holders to turn any bra into a racerback, so the straps don't stick out or fall off your shoulder. Just attach the clips to both straps in the back, and voila! — no one can see your bra straps from the front. Amazon Promising review: \"My bra straps spent more time off my shoulders than on them. I have bras that fit perfectly, but the straps are too wide-set or something. I'm so glad I bought these little bra strap clip holders because they've solved the problem. I've used them for three days now, and my straps have not fallen off of my shoulders even once in that time. Amazing! I love them! I put a clip holder on my bra and then put the bra on like a T-shirt — over my head, put my arms in, then fasten it as usual in the back — pretty easy. The length of the clip holders are adjustable. I have fully extended them to fit across the back of my 38DD bras. At first it felt a bit odd because it was different, but it doesn't take long to adjust to the feel of it. The strap clip holders do the job, and they are pretty cheap, so give them a try. \" — Polly Esther Get a set of three from Amazon for $5.97+ (available in eight sets with different colors). 32. A medication tracker you can attach to any of your pill bottles so you don't accidentally take your antidepressants twice in one day. www.amazon.com Take-n-Slide is a small business that makes wonderfully innovative medication trackers. Promising review: \"I absolutely love this product! I have a couple of daily medications and oftentimes I forget whether I’ve taken them and/or whether I’ve taken the second dose. Recently I inadvertently took a double dose because I couldn’t remember whether I had taken the medication or not. This product solves the problem. There is even a satisfying feeling I get when I 'click' the tabs. Genius little invention. \" — Tiffany Maggard Get a pack of five from Amazon for $19.99 (available in two colors). 33. An adorable ombre bath mat that's super plush and fluffy, so you'll feel like you're stepping onto a cloud instead of the old mop-like texture of your current worn-out bath mat. This one's also quick-drying, so it won't be all soggy five hours after your shower. Amazon, www.amazon.com Promising review : \"This rug is very pretty. It absorbs water well. It’s stays in place nicely. I think it’s a good value for the money. It’s easy to clean and is even washable. I have two other colors in this rug, and they are very durable after two years and still look great.\" — Sherri Dale Get it from Amazon for $19.54+ (available in 27 colors and 15 sizes). 34. A compact cutlery organizer with stacked, angled compartments that take up *much* less room than traditional silverware organizers. You can free up more space for those larger cooking utensils that take up an entire drawer or are sitting on your counter. Amazon, www.amazon.com See this \"life-changing\" drawer organizer on TikTok. BuzzFeed Shopping editor Chelsea Stuart has used the cutlery organizer to make her kitchen feel more organized. She says: \"Just got this, and it has freed up SO much space in our cutlery drawer that we can now store teas, small Tupperware, etc. vs. before it was just a mess of utensils.\" Promising review: \"I had never seen this before I bought it, and holy crap it changed my life. So. Much. Room. There is so much room left in my drawer now that I moved stuff from another drawer and I have an entirely empty drawer in my kitchen now. Now only HALF the drawer is silverware and the other half is spatulas and cooking utensils. It is great. It also seems very sturdy. Highly recommend.\" — van31050 Get it from Amazon for $8.99 (available in two sizes and an expandable style). 35. An exfoliating scrub mitt that buffs away dead skin, leaving your body feeling soft, smooth, and refreshed (just in time for warmer weather!). It's made from plant-based materials that won't irritate your skin, and it's quick-drying so it won't accumulate moisture and collect bacteria. It even has a little loop for hanging (so you don't have to awkwardly drape it over your shower caddy). www.amazon.com It's recommended to use it 2–4 times a month so you don't over-exfoliate! Promising review: \"My skin is 100% softer and feels far smoother thanks to this product!!! The difference was noticeable after ONE use, its true. All the grime, rolled up skin, flakes and chucks — shudder, that was on me??? Everything other customers are saying about how disgusting it is when you see how much dead skin sloughs off is true. I disagree that it only comes off after the first use though — I have continued to see improvement over the time I've used it, about six weeks, and even some age-related and sun damage discoloration is gone. These are the BEST, a MUST-HAVE, holy grail exfoliating mittens . I DEFINITELY recommend this! Did I say I recommend this 100%? I do!\" — Kindle Customer. g'ma Get it from Amazon for $10.99 (also available in a set of two). Reviews have been edited for length and/or clarity.", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://www.buzzfeed.com/imansakrani/things-youve-put-off-buying", "source": "Buzzfeed", "published_at": "2025-04-12T17:01:02"}, {"id": 22, "title": "Trump administration says it will exclude some electronics from reciprocal tariffs", "content": "Trump administration says it will exclude some electronics from reciprocal tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS The \"worm\" logo is on the left, the classic \"meatball\" logo is on the right. 28 minutes ago Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge Read full article: Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge JSO generic night 3 hours ago Teenage motorcyclist killed in crash on Gate Parkway Read full article: Teenage motorcyclist killed in crash on Gate Parkway . 5 hours ago A cool start, leading into a gorgeous day! Read full article: A cool start, leading into a gorgeous day! News4Jax shines at Florida News Awards 13 hours ago News4JAX shines at Florida News Awards Read full article: News4JAX shines at Florida News Awards DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Business Trump administration says it will exclude some electronics from reciprocal tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.news4jax.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WJXT News4JAX", "published_at": "2025-04-12T17:00:42"}, {"id": 23, "title": "How to keep your old computer running for as long as possible", "content": "How to keep your old computer running for as long as possible | Popular Science Old computers can still have their uses. Image: FRANCESCO CARTA/Getty Images Get the Popular Science daily newsletter💡 Email address Sign up Thank you! Terms of Service and Privacy Policy. You want to squeeze as much life from a laptop or desktop computer as possible. Doing so can save a substantial amount of money over time, and stops you from contributing to mountains of e-waste . At the same time, dealing with an old, sluggish computer is a frustrating experience. If apps and websites are taking ages to load, it can seriously impact your productivity. At a certain point, the temptation to upgrade to a shiny, speedy new computer proves irresistible. A middle ground exists, which is to make sure your laptop or desktop lasts as long as possible. There are multiple tricks you can try when it starts to show its age—tricks that could mean it stays usable for much longer than you expected. Cut down on the clutter You’ll find several programs starting up with Windows or macOS. Screenshot: Apple One way to stretch the life of your computer is to reduce its load. Uninstall any apps you’re not actively using, and keep your apps trim in terms of extensions and add-ons. We’ve covered how to uninstall programs on Windows and macOS , and it’s not difficult to do. Limiting the number of programs starting up with your computer can help too: It means fewer apps running in the background, freeing up more memory and other system resources. You can take care of this with a few clicks on both Windows and macOS . The more storage space you have the better. It gives your computer and its operating system room to breathe and get organized, and can improve performance. Uninstalling apps should help with this, but also be on the lookout for files that you no longer need or can move somewhere else. Choose some upgrades Some well-chosen upgrades can breathe new life into an old computer. While this is going to cost you money, it won’t cost as much as a full upgrade would—and it could mean you get several years of extra use out of your device. The right upgrade will depend on your system’s specs, how much you have to spend, how easy the system is to upgrade, and how comfortable you are with opening up your computer. This is mostly for Windows PCs and for desktops, though a few limited laptop upgrades are sometimes possible. Upgrading the RAM or the storage on your computer are usually the best upgrades for getting the most bang from your bucks. It could be something as straightforward as buying an external hard drive to move files over to, for example. Install another operating system There are plenty of lightweight Linux distros to choose from. Screenshot: Lubuntu In the interests of doing more with older components, you can install a fresh operating system to replace Windows or macOS, one that’s less demanding on your aging computer. This will wipe everything on your system though, so be sure to back up all of your important files and folders first. Linux is always a popular and completely free option, and it comes in many different flavors (known as distros). Some of them, such as Lubuntu , are designed to be as lightweight as possible. Have a browse around the web and you’ll find many options to pick from, as well as detailed guides to how to make the switch. Then there’s ChromeOS Flex , which essentially turns your Windows or Mac computer into a Chromebook. You’re just running a web browser with a few extras, so older computers should be up to the challenge. As with Linux, this is free to do, and it’s perfect if you spend most of your computing time in a web browser anyway. Use your computer for something else Then there’s the option of using your computer for something else , rather than an all-purpose machine. One option is using your aging laptop or desktop as a media server: It doesn’t have to do anything except stream audio and video to other devices on your network. Plex and Emby are two programs that can help. Or how about turning your ancient computer into a dedicated writing machine? This could work if your machine is so old that it’s no longer getting security updates, so shouldn’t really be connected to the web. Set up a word processor and you’re good to go (you will need a USB drive to get your writing shared elsewhere, however). Repurposing your laptop or desktop doesn’t save you from the cost of an upgrade, because you’ll still need to buy another computer, but it does cut down on e-waste and does mean your hardware stays useful for longer. And when you do finally need to get rid of a computer, make sure you do it responsibly . More deals, reviews, and buying guides The PopSci team has tested hundreds of products and spent thousands of hours trying to find the best gear and gadgets you can buy. SEE MORE GEAR Trending Environment The Great Pacific Garbage Patch isn’t a just a floating trash pile The Great Pacific Garbage Patch isn’t a just a floating trash pile By RJ Mackenzie Environment Wind chill isn’t what you think it is Wind chill isn’t what you think it is By Maggie Galloway More in Tech Hacks How to turn your laptop into a desktop computer How to turn your laptop into a desktop computer By David Nield How to add Google Drive to your computer (and why you should) How to add Google Drive to your computer (and why you should) By David Nield How to use the Signal app to keep your chats secure How to use the Signal app to keep your chats secure By David Nield How to use Windows Safe Mode to get out of computer trouble How to use Windows Safe Mode to get out of computer trouble By David Nield It’s time to declutter your messy macOS It’s time to declutter your messy macOS By David Nield How to use tasks and reminders inside ChatGPT How to use tasks and reminders inside ChatGPT By David Nield How to spot when your hard drive will fail before it does How to spot when your hard drive will fail before it does By David Nield How to customize Google Chrome to make it your own How to customize Google Chrome to make it your own By David Nield SEE MORE More in DIY How to fully back up your Android device How to fully back up your Android device By David Nield How to reset the YouTube algorithm How to reset the YouTube algorithm By Justin Pot Windows and macOS can free up storage space for you—here’s how Windows and macOS can free up storage space for you—here’s how By David Nield How to get MS-DOS up and running on Windows or macOS How to get MS-DOS up and running on Windows or macOS By David Nield How to use Apple Intelligence to sort your emails How to use Apple Intelligence to sort your emails By David Nield How to mirror your iPhone on your Mac How to mirror your iPhone on your Mac By David Nield How to factory reset a Mac How to factory reset a Mac By Justin Pot How to make sure all your software and apps are up to date How to make sure all your software and apps are up to date By David Nield SEE MORE", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.popsci.com/diy/how-to-keep-an-old-computer-running/", "source": "Popular Science", "published_at": "2025-04-12T17:00:00"}, {"id": 24, "title": "Trump enacts tariff exemptions for computers, smartphones, and more", "content": "Trump exempts computers, smartphones, and more from tariffs | Tom's Hardware Skip to main content (Image credit: Shutterstock) Amidst the flurry of tariffs imposed by the Trump administration over the last few weeks, we finally have some exemptions that should significantly impact the tech sector. While the initial reciprocal tariffs will remain for imports, U.S. Customs and Border Protection shared some new exemptions on tech-related goods. The update was announced yesterday evening and follows various tariff increases, particularly on Chinese imports. The exemptions include many products we're excited to see get some relief. The complete list is available in the official bulletin, but it includes computers, smartphones, semiconductor chips, and other tech goods like flat panel TVs, solar cells, and flash drives. The most recent tariff increase from Trump was 145% on Chinese goods. This sent waves across the tech industry, as many realized the significant impact it would have on many tech products that we rely on, including laptops, desktops, CPUs, semiconductor chips, and any PC component. Large companies like Apple, HP, Dell , and more preemptively imported extra stock before the tariff announcement to skirt some of the impact. You may like Tech enthusiasts brace for Trump tariff price hikes on new components Nvidia may avoid recent tariffs on its AI servers — 60% of Nvidia servers pass through Mexico, may be exempt from Trump tariff flurry These exemptions should benefit industry leaders and consumers alike, who have been anticipating serious price hikes on imported products. This should offset the price increases for customers and manufacturers who rely on imports for construction materials. The United States imports around 66% of its tech goods from China, which caused significant concern when tariffs were first announced and subsequently raised on Chinese imports. We recently reported expectations that consoles, monitors, and laptops would be among the most impacted. Many tariffs initially imposed on April 5th will be reduced for 90 days, but tariffs on China have continued to increase . This exemption list is the first we've seen concerning the tariff situation with China. That said, tariffs will remain in place for all other imports not included in the exemption list. The situation is subject to change, but we'll report any significant updates on the tariff situation as things progress, so be sure to check back regularly for more information. Stay On the Cutting Edge: Get the Tom's Hardware Newsletter Get Tom's Hardware's best news and in-depth reviews, straight to your inbox. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors See all comments (12) Ash Hill Contributing Writer Ash Hill is a contributing writer for Tom's Hardware with a wealth of experience in the hobby electronics, 3D printing and PCs. She manages the Pi projects of the month and much of our daily Raspberry Pi reporting while also finding the best coupons and deals on all tech. Read more Tech enthusiasts brace for Trump tariff price hikes on new components Nvidia may avoid recent tariffs on its AI servers — 60% of Nvidia servers pass through Mexico, may be exempt from Trump tariff flurry Are gaming GPUs subject to new U.S. tariffs? It isn't entirely clear yet China fires back at Trump’s tariff increases with 125% levies on U.S. goods PC prices up at least 20%: Trump Tariffs may hurt U.S. system integrators most Trump says that chip tariffs are starting 'very soon' Latest in Tech Industry Pat Gelsinger turns to particle accelerators for a new way to make chips, joins xLight Trump exempts computers, smartphones, and more from tariffs Chinese chip giants say they don't care about U.S. tariffs — many don't sell to the U.S. anyway due to existing sanctions China fires back at Trump’s tariff increases with 125% levies on U.S. goods China's new semiconductor rule spares Taiwan fabs, punishes Intel, GlobalFoundries & Texas Instruments Elon Musk’s xAI allegedly uses 'illegal' generators to power Colossus supercomputer facility Latest in News Charred RTX 4070 fell victim to a PSU without protection feature Asus launches the flagship ROG Crosshair X870E Extreme, starting at $1,400 Pat Gelsinger turns to particle accelerators for a new way to make chips, joins xLight AMD's latest ROCm 6.4 release continues to lack RDNA 4 support Old-school Creative Sound Blaster cards repaired and demoed Trump exempts computers, smartphones, and more from tariffs 12 Comments Comment from the forums Seems like a good move initially to reduce some of the price hikes. Reply Are you sure that it includes PC components , not just fully-assembled PCs? Also, I expect cases, heatsinks, and radiators are still be affected by the 25% steel & aluminum tariffs, which did not get suspended. Lastly, the \"de minimis\" exemption on small (sub-$800) packages ends May 2nd. That will hit anything shipped directly from abroad (AliExpress, Temu, some sellers on Amazon & ebay, etc.). I'm not sure exactly how that's going to work, but I think you'll be assessed a customs fee that you pay in order to pick up or receive your package. But, it's the recipient who pays. So, don't expect it to be incorporated into sellers' prices. Reply \"The complete list is available in the official bulletin\" No it's not. Reply What it must feel like hopping on a ride at Rollercoaster Tycoon while the player is still editing the tracks. Reply bit_user said: Are you sure that it includes PC components , not just fully-assembled PCs? https://hts.usitc.gov/search?query=8542 Reply Giroro said: \"The complete list is available in the official bulletin\" No it's not. Sure it is, but you have to look up what all those headings/sub correspond to here: https://hts.usitc.gov/ Reply sadly, the only groups that will benefit from these exemptions will be the big businesses. they wont reduce their prices, theyll simply pocket the price difference, while consumers continue to pay inflated prices Reply This tariff exemption move is good for consumers and big tech companies, but it also severely undermines the whole point of the tariffs . I'm completely confused on what the objective and strategy is now. I also get the impression that the big tech executives have too much influence when they can create special exemptions for their businesses. Reply thestryker said: https://hts.usitc.gov/search?query=8542 So, what's that column labelled \"2\", which says 35% ? Reply bigdragon said: This tariff exemption move is good for consumers and big tech companies, but it also severely undermines the whole point of the tariffs . Yeah, I can imagine more and more exemptions getting created, as that 145% rate on Chinese imports begins to bite and retailers & consumers start to recoil at the prices of things. As for tech products, recall that the same thing happened last time around. There was initial panic about motherboards & graphics cards getting hit, but then they were exempted for a time period that kept getting extended. bigdragon said: I'm completely confused on what the objective and strategy is now. I think the objective hasn't really changed. The strategy is what's now in doubt. bigdragon said: I also get the impression that the big tech executives have too much influence when they can create special exemptions for their businesses. Well, yes but I'm sure their case played well, with AI being seen as a strategic priority. Also, it's not just tech executives... Reply View All 12 Comments Show more comments", "sentiment": "POSITIVE", "sentiment_score": 0.6, "url": "https://www.tomshardware.com/tech-industry/trump-enacts-tariff-exemptions-for-computers-smartphones-and-more", "source": "Tom's Hardware UK", "published_at": "2025-04-12T16:59:52"}, {"id": 25, "title": "Smartphones and computers are now spared from Trump's reciprocal tariffs", "content": "Smartphones and computers are exempt from Trump's reciprocal tariffs : NPR Accessibility links Skip to main content Keyboard shortcuts for audio player Smartphones and computers are exempt from Trump's reciprocal tariffs The exemption comes amid worries of how President Trump's steep new tariffs will affect American tech companies that rely on supply chains in China, like Apple. Business Smartphones and computers are now spared from Trump's reciprocal tariffs Updated April 12, 2025 2:02 PM ET Originally published April 12, 2025 12:58 PM ET Juliana Kim Versions of the new Apple iPhone 16 are displayed at an Apple store in in Manhattan Beach, Calif., on April 8. Jay L Clendenin/Getty Images hide caption toggle caption Jay L Clendenin/Getty Images The Trump administration has amended its list of imports that will be affected by sweeping global tariffs in order to exempt certain electronics, including smartphones and computers. Politics China put steep tariffs on U.S. exports. Farmers are worried The updated guidance was published Friday night by U.S. Customs and Border Protection. The exemption will apply to President Trump's steep \"reciprocal tariffs\" imposed across dozens of countries, which have since been paused until early July as well as the 145% levies currently in place on China. That was the only country excluded from the reciprocal tariff pause. The exemption is effective for products that entered the U.S. or left warehouses starting on April 5. The White House issued a presidential memo about the exemption on Saturday. Sponsor Message When asked about the reasoning behind the exemption, White House press secretary Karoline Leavitt said in a statement: \"President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops.\" Leavitt added, \"At the direction of the President,\" companies including Apple, TSMC and Nvidia \"are hustling to onshore their manufacturing in the United States as soon as possible.\" The electronics exemption is a major development in the tariff war with China, which has imposed a 125% tariff on U.S. goods . Prices for electronics from China, a key sector, had been expected to spike . Politics Where do tariffs stand? A look at what's in place and what's on pause Among the items that will now be spared from Trump's steep tariffs include smartphones, computers, semiconductors, and flat panel display modules. But the updated guidance did not address any changes to the existing 20% tariff on Chinese goods in response to China's involvement in the fentanyl trade. According to the U.S. International Trade Commission , China has long been America's chief source for electronic products, with Mexico, Taiwan, Vietnam, and Malaysia rounding out the top five. There was also concern for American tech giants that rely on supply chains in China, like Apple. Before the updated guidance, Apple was expected to experience major setbacks as a result of the tariffs, Dan Ives, global head of technology research at Wedbush Securities, told CNBC earlier this week. Tariffs smartphones Facebook Flipboard Email Sponsor Message Sponsor Message Become an NPR sponsor", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.npr.org/2025/04/12/nx-s1-5363025/apple-iphone-tariff-exemption-china", "source": "NPR", "published_at": "2025-04-12T16:58:13"}, {"id": 26, "title": "NYC helicopter that plunged into Hudson River had mechanical issue months before fatal wreck", "content": "NYC helicopter that plunged into Hudson River had mechanical issue months before fatal wreck Free Republic Browse · Search General/Chat Topics · Post Article Skip to comments. NYC helicopter that plunged into Hudson River had mechanical issue months before fatal wreck ny post ^ Posted on 04/12/2025 9:56:21 AM PDT by BenLurkin The ill-fated Bell206L-4 LongRanger IV aircraft, owned and operated by New York Helicopter, experienced a mechanical issue with its transmission assembly last September, according to Federal Aviation Administration data. Records show the doomed chopper was built in 2004 and had already logged 12,728 hours of flight time when it was forced into repair. An investigation is underway to determine what caused the aircraft to drop out of the sky and plunge into the river. The probe will comb through the pilot’s experience, the still-incomplete wreckage, and the Big Apple company that runs the sightseeing tours. Investigators will also review the maintenance work that was done on the doomed aircraft, including the completion of two recent safety airworthiness directives the FAA issued on Bell 206L model helicopters. The federal agency issued the first directive in December 2022 and called for the inspection and possible replacement of the models’ main rotor blades due to “delamination” — an issue with the internal layers of the blade separating due to material fatigue, damage or other defects. The problem, if not fixed, could potentially cause the rotor blade to fail. A second directive, issued in May 2023, required the testing and possible replacement of tail rotor shafts on eight models, including the one involved in Thursday’s deadly wreck, according to the FAA, which issued the alert after a chopper lost a tail-rotor drive due to a joint failur (Excerpt) Read more at nypost.com ... TOPICS: Local News KEYWORDS: Click here: to donate by Credit Card Or here: to donate by PayPal Or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794 Thank you very much and God bless you. Navigation: use the links below to view more comments. first 1-20 , 21-40 , 41 next last 1 posted on 04/12/2025 9:56:21 AM PDT by BenLurkin [ Post Reply | Private Reply | View Replies ] To: BenLurkin (experienced a mechanical issue with its transmission) I was gonna say, that kind of failure could actually break a helicopter 🚁 apart 2 posted on 04/12/2025 9:58:36 AM PDT by SaveFerris (Luke 17:28 ... as it was in the Days of Lot; They did Eat, They Drank, They Bought, They Sold ......) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin I've been in a helicopter once. A company in Orlando offered short rides around the city to see Disney World and the other attractions. I survived...but was so scared from start to finish that I needed a change of underwear when we landed. Never again! 3 posted on 04/12/2025 10:00:05 AM PDT by Gay State Conservative (Import The Third World,Become The Third World) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin Why the so-called ‘Jesus nut’ could be a key piece of evidence in Hudson River helicopter crash https://nypost.com/2025/04/12/us-news/jesus-nut-could-be-key-clue-in-hudson-river-helicopter-crash/ 4 posted on 04/12/2025 10:01:01 AM PDT by Libloather (Why do climate change hoax deniers live in mansions on the beach?) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin According the AI in a Google query, models newer than 2016 cost $1.9 million. Brand new up to $2.5. A well-maintained model from 1993 can be as “low” as $800,000. I can’t begin to imagine how much a private touring package for five passengers would cost. Fuel, insurance, maintenance… 5 posted on 04/12/2025 10:06:34 AM PDT by BradyLS (DO NOT FEED THE BEARS!) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin The tail rotor support frame was completely missing. The helicopter fell like a stone. No rotation of the cabin from the main rotor torque. 6 posted on 04/12/2025 10:11:42 AM PDT by Blood of Tyrants (Time to dump out the Treasury drawer and throw out all the junk that is wasting our money.) [ Post Reply | Private Reply | To 1 | View Replies ] To: BradyLS “I can’t begin to imagine how much a private touring package for five passengers would cost.” Try google ... https://www.viator.com/New-York-City-tourism/d687-r6517263011-s109979651?&m=28353&supag=6517263011&supsc=kwd-296539032931&supai=691599225024&supap=&supdv=c&supnt=nt:g&suplp=9012375&supli=&supti=kwd-296539032931&tsem=true&supci=kwd-296539032931&supap1=&supap2=&synthetic_keyword=nyc%20helicopter%20tour&gad_source=1&gbraid=0AAAAAD-gbd7Ja_-DGD8Dh-qVVkFaSEkCL&gclid=Cj0KCQjwnui_BhDlARIsAEo9GuvwiL2gx2jYk3jURmQsDSv8ocZC18RPyteJAX9H9VMlChg_oV0fin8aAqf_EALw_wcB&gclsrc=aw.ds 7 posted on 04/12/2025 10:13:49 AM PDT by TexasGator (1.) [ Post Reply | Private Reply | To 5 | View Replies ] To: TexasGator LOL! 👍 You’re right, of course! If I can find out one, I can find out the other! 8 posted on 04/12/2025 10:15:07 AM PDT by BradyLS (DO NOT FEED THE BEARS!) [ Post Reply | Private Reply | To 7 | View Replies ] To: SaveFerris 40,000 parts flying in close formation, 9 posted on 04/12/2025 10:15:28 AM PDT by Blood of Tyrants (Time to dump out the Treasury drawer and throw out all the junk that is wasting our money.) [ Post Reply | Private Reply | To 2 | View Replies ] To: Blood of Tyrants it’s hard to tell from the video’s I saw. It appears that the craft split up into three pieces. I speculate that the main rotor blades separated first and then the tail rotor split off. I think they call it ‘The Jesus Nut’ that holds the main rotor to the mast in most helicopters. As far as I know, they still haven’t found the other parts. Bet that was a wild ride at the end. 10 posted on 04/12/2025 10:18:33 AM PDT by Samurai_Jack (This is not about hypocrisy, this is about hierarchy!) [ Post Reply | Private Reply | To 6 | View Replies ] To: Blood of Tyrants Yeah with a LOT of power / torque ...... 11 posted on 04/12/2025 10:20:09 AM PDT by SaveFerris (Luke 17:28 ... as it was in the Days of Lot; They did Eat, They Drank, They Bought, They Sold ......) [ Post Reply | Private Reply | To 9 | View Replies ] To: Libloather I think the main rotor came off, shearing the tail rotor assemble. No rotation of the cabin at all from the torque of the main rotor or counter torque from the tail rotor. 12 posted on 04/12/2025 10:26:10 AM PDT by Blood of Tyrants (Time to dump out the Treasury drawer and throw out all the junk that is wasting our money.) [ Post Reply | Private Reply | To 4 | View Replies ] To: BenLurkin Analysis of the video of the crash shows the rotor and transmission separated from the helicopter. The rotor/transmission was autorotating so the Jesus nut isn't really a suspect nor is mast bump. The most likely failure was a sudden and violent jam in the transmission that took it from normal rotation speed to zero in a very short amount of time. That would cause huge counter torque that likely stressed the tail rotor/boom assembly to the failure point. Also break away of the the transmission/rotor assembly from the fuselage indicates shearing from both mounting points on top of the cabin. Blancolerio has a very detailed explanation of this scenario too. https://www.youtube.com/watch?v=U8Q8XuqlyMQ&t=323s 13 posted on 04/12/2025 10:29:10 AM PDT by pfflier [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin The “Jesus Nut” fell off, it’s the main nut that holds the top rotary wing on. If it fails, falls off, prepare to meet the Man in person. That’s why it’s called that. 14 posted on 04/12/2025 10:34:45 AM PDT by SkyDancer ( ~ Am Yisrael Chai ~) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin Everything to do with a helicopter is 3-5x more expensive than an airplane of similar capabilities. Purchase, maintenance, fuel costs, rental, ... everything. As I often say, vertical flight is hideously expensive. STOL is a far less expensive proposition in every case. But “short” isn’t all that short. A Helio-Courier can take off in 350 feet, and a Pilatus Porter in 650, and those are exceptional cases (for any airplane that can carry a significant load). VERTOL is only economically feasible if there’s no other option. 15 posted on 04/12/2025 10:36:42 AM PDT by Paal Gulli [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin It’s a 20 year old chopper. I’m sure it’s had plenty of repairs. This is just kind of silly. I repaired my car last month, if some other part breaks in October it doesn’t mean anything about last month’s repair. Things break, it’s an imperfect world. 16 posted on 04/12/2025 10:40:35 AM PDT by discostu (like a dog being shown a card trick) [ Post Reply | Private Reply | To 1 | View Replies ] To: Libloather Since the rotors and the transmission separated as a complete unit I doubt the Jesus nut will be found to be the issue. 17 posted on 04/12/2025 10:44:18 AM PDT by AlaskaErik (There are three kinds of rats: Rats, Damned Rats, and DemocRats.) [ Post Reply | Private Reply | To 4 | View Replies ] To: SkyDancer \" \"That’s why it’s called that.\" It's called that because if it falls off, only Jesus can save you. 18 posted on 04/12/2025 10:47:42 AM PDT by Paal Gulli [ Post Reply | Private Reply | To 14 | View Replies ] To: BenLurkin This story is everywhere and it is heartbreaking. But a side thought, I really think it best not to take chances with your life for a thrilling ride and to me that is exactly what a helicopter is. The chance it could do this is there. I don’t care how slim the chance is, it IS there. It is not the same as a car or a train. To go up in the air in one of those things is no way out if something goes wrong. People do this kind of thing all the time and never think of it in this way. Hike way up on a dangerous cliff to say ‘I climbed a cliff’ and fall off, go way under the ocean in a submarine...remember that one! Why don’t people way the odds on this kind of thing. Big deal. You see from a height. I’ll do it watching tv. It’s too dangerous to risk myself and certainly not my loved ones. 19 posted on 04/12/2025 10:48:46 AM PDT by Beowulf9 ( ) [ Post Reply | Private Reply | To 1 | View Replies ] To: discostu \"It’s a 20 year old chopper.\" The Soviet-made Mil Mi-8 is the most common helicopter in he world. Scads of them are more than 50 years old and still flying regularly, probably with no more maintenance than the owner applies to his Lada. 20 posted on 04/12/2025 10:58:59 AM PDT by Paal Gulli [ Post Reply | Private Reply | To 16 | View Replies ] Navigation: use the links below to view more comments. first 1-20 , 21-40 , 41 next last Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management. All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works. Free Republic Browse · Search General/Chat Topics · Post Article FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794 FreeRepublic.com is powered by software copyright 2000-2008 John Robinson", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://freerepublic.com/focus/f-chat/4310610/posts", "source": "Freerepublic.com", "published_at": "2025-04-12T16:56:21"}, {"id": 27, "title": "Donald Trump Exempts Smartphones, Chips & Computers From Tariff Madness, Social Media Congratulates Tim Cook aka Tim Apple For Kissing The Ring Early", "content": "Tim Cook Clowned On X After Trump Exempts Smartphones Technology Donald Trump Exempts Smartphones, Chips & Computers From Tariff Madness, Social Media Congratulates Tim Cook aka Tim Apple For Kissing The Ring Early Written by Bernard \"Beanz\" Smalls Published on April 12, 2025 Share Share this link via Or copy link Copy Copied HipHopWired Featured Video CLOSE Source: Getty Images / Tim Cook / Apple / Donald Trump Donald Trump recently boasted that he “knew what the hell he was doing” after stupidly issuing global tariffs, effectively tanking the global market, but his latest move proves he has no clue what he is doing. After caving on his global tariffs and issuing a 90-day pause after billionaire CEOs and his MAGA allies whispered the ear that was allegedly shot off that their bottom lines are being affected, he is caving once again. He is exempting smartphones, chips, and computers from his stupid tariffs. Oh, and that includes those same electronics from his favorite punching bag, China, Bloomberg reports. Related Stories Cue The ‘Curb Your Enthusiam’ Theme: Cheryl Hines Snubbed By Donald Trump At UFC 314, X Can’t Stop Laughing Adin Ross Clowned On X For Defending Donald Trump’s Tariffs After Losing “Eight Figures” Donald Trump Caves, Calls For 90-Day Pause On Tariffs, Stocks Surge, Social Media Smells “Market Manipulation” According to the financial website, late last night, US Customs and Border Protection (CBP) updated its guidance to exempt smartphones, laptops, hard drives, computer processors, and memory chips from the tariffs. The website also reports machines used by Taiwan Semiconductor Manufacturing Co. to make semiconductors will also be exempt. The Electronics Companies Reacted Swiftly To The Threat of Trump’s Tariffs There is no word on what pushed Trump to make this decision, but it follows the swift response from numerous electronics companies to his blanket tariffs. Nintendo unprecedentedly delayed Switch 2 preorders in the US . Apple reportedly filled a plane with 600 tons of iPhones from India ahead of the tariffs going into effect this week. OnePlus also raised the price of its latest smartwatch without sharing a reason for the decision, but it wouldn’t be a stretch to assume it was related to Trump’s blatant abuse of tariffs. So much for Trump’s economics team’s talk about bringing iPhone manufacturing back to the US. The story is still developing, but please feast your eyes on the reactions to Trump looking silly in his trade war and Apple CEO Tim Cook seemingly benefiting from kissing the ring early in the gallery below. 1. Facts 2. 3. 4. 5. 6. 7. 8. 9. 10. 11. 12. 13. 14. 15. 16. 17. 18. 19. 20. More from Hip-Hop Wired Kanye West AKA Ye Wore All-Black KKK Hood Fit & Swastika Chain In Bizarre DJ Akademiks Interview Judge Rules In Favor Of Central Park 5 Against Donald Trump In The Mix: 10 Biracial Rappers Who May Surprise You [PHOTOS] 'Marvel Rivals' Emma Frost & Her Thick Thighs Bring Out High Levels of Virtual Thirst Uncle Scam: Trump Administration Facing Insider Trading Allegations Kai Cenat Previews New Drake And Lil Yachty Song 50 Cent Suggests Lil Meech Is Suffering From Drug Abuse Elon Musk Called A Loser On His Own Platform After Spending Millions In Wisconsin Judicial Election MORE FROM HIP-HOP WIRED 13 items News 10 items Gaming 15 items Politics 20 items Technology News News Trending Stories News Uncle Scam: Trump Administration Facing Insider Trading Allegations 11 items Gaming ‘Marvel Rivals’ Emma Frost & Her Thick Thighs Bring Out High Levels of Virtual Thirst drake Kai Cenat Previews New Drake And Lil Yachty Song Music Grand Wizard Kanye West Disses Drake On “Heil Hitler” Song News Travis Scott On Where He Stands With Kanye West, “That’s My Kid’s Uncle” 7 items News Dreamville Festival 2025: The Final Recap News Mother Of Alleged Big U Murder Victim Says He Killed Her Son 10 items Games Elon Musk Hilariously Trolled During ‘Path of Exile 2″ Stream, He Also Died While Fighting Tutorial Boss Sign Up For The Hip-Hop Wired Newsletter Thank you for subscribing! This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Subscribe We care about your data. See our privacy policy . Hip-Hop Wired Quick Links Legal Subscribe Close", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://hiphopwired.com/playlist/tim-cook-clowned-donald-after-trump-exempts-smartphones-from-tariffs/", "source": "Hip-Hop Wired", "published_at": "2025-04-12T16:49:37"}, {"id": 28, "title": "Apple iPhone 16, iPhone 16 Pro And iPhone 15 Prices Cut In New Deals", "content": "Apple iPhone 16, iPhone 16 Pro And iPhone 15 Prices Cut In New Deals Apple iPhone 16, iPhone 16 Pro And iPhone 15 Prices Cut In New Deals By David Phelan Follow Author Share Save Comment BETA This is a BETA experience. opt-out here Innovation Consumer Tech Apple iPhone 16, iPhone 16 Pro And iPhone 15 Prices Cut In New Deals By David Phelan , Senior Contributor. Forbes contributors publish independent expert analyses and insights. I write about lifestyle tech Follow Author Apr 12, 2025, 12:45pm EDT Share Save Comment Updated April 12 with more details of offers and deals. Amazon has new price cuts for iPhones which take select models right back to their Spring Sale lows. The discounts apply to the the iPhone 16, iPhone 16 Plus, and the iPhone 16 Pro versions, too. In fact, all the phones in the iPhone 16 series are represented apart from the newest of all, the iPhone 16e, which is the most affordable of the range. What’s more, there are bargains to be had if you’d like the iPhone 15 or iPhone 15 Plus, as well. Apple iPhone 16 and iPhone 16 Plus prices are down at Amazon. Getty Images Amazon U.K. has discounted the iPhone 16, iPhone 16 Plus, iPhone 16 Pro and iPhone 16 Pro Max by £100 or more. The deals highlighted in this post were independently selected by the Contributor and do not contain affiliate links. Forbes Apple Intelligence For iPhone To Add Google Gemini In Weeks, Report Claims By David Phelan Let’s start with the iPhone 16. The entry-level model has 128GB storage and comes in four colors, of which three are discounted in this storage level. Choose between pink, teal and white to find the iPhone with 13% off. That takes the price down by £101, from £799 ($1,019) to £698 ($890). Here’s the link for the iPhone 16. MORE FOR YOU Microsoft’s Free Upgrade Offer For 500 Million Windows Users Top Fed Official Confirms The Bank Is Ready To Bail Out Trump ‘God Of Chaos’ Asteroid: It’s Exactly Four Years Until The Rarest Space Event Of Our Lives If you’re mad about the Ultramarine color, and I couldn’t blame you, there are savings available if you choose the 512GB version. The regular price for this is £1,099 ($1,402) but it has a 9% discount, which also works out at £101 off, making it £998 ($1,273). The same price applies for the pink, teal and white finishes. The fifth color, black, is not worth having at the current Amazon price of £1,202.79 for the 128GB storage model. The iPhone 16 with 256GB storage is also not available. Fancy a bigger screen? The iPhone 16 Plus is discounted by 11%, taking its regular £899 ($1,147) sticker down by £101 (spotting a pattern here?) to £798 ($1,018). You only get to choose the white finish at this price, please note. Here’s the iPhone 16 Plus link . There’s more choice for the 256GB storage option, a 10% discount of £101 brings the £999 ($1,275) price down to £898 ($1,146). All colors except black available. The full range of colors is discounted on the largest storage of 512GB. Down from £1,199 ($1,530) by 8% or, you guessed it, £101, the new price is £1,098 ($1,401) and you can choose between black, pink, teal, ultramarine and white. If you can’t resist the three cameras and titanium frame of the iPhone 16 Pro, these are discounted, too. Here’s the link. All four colors are available for the 128GB storage models. That means Desert Titanium, Black Titanium, Natural Titanium and White Titanium are all 10% off, that means the regular £999 ($1,308) price is knocked down by £100 ($131) to £899 ($1,178). And you’ll notice the magic spell of £101 off has been broken on this model, though only just. Forbes Apple’s Stealthy New Music Upgrade For Windows PCs Beats Microsoft By David Phelan Same for the 256GB model, which also sees £100 ($131) off, across the board. Here it’s a 9% discount, taking the £1,099 ($1,439) sticker down to £999 ($1,308). All four colors available. Step up to 512GB storage and something eerily predictable happens: all four colors available with £100 ($131) off. This means an 8% price cut, so the regular £1,299 ($1,701) price drops to £1,199 ($1,570). The same £100 ($131) cut means the regular £1,499 ($1,963) price for the 1TB storage option is £1,399 ($1,832). The biggest phone of all is the iPhone 16 Pro Max with a 6.9-inch display. Check this link and you’ll see a wholly unsurprising discount in place. That’s right, there’s £100 ($131) off the 256GB model — the lowest-capacity storage option for the Max — which reduces the price from £1,199 ($1,570) to £1,099 ($1,439), with all colors ready to ship. The 512GB version also (can you believe it?) shows a £100 ($131) price cut. That’s a 7% discount and brings the regular £1,399 ($1,832) sticker to £1,299 ($1,701. All colors available. The 1TB option, regularly £1,599 ($2,094) down by £100 ($131), as you may have guessed. This 6% price cut means you’ll pay £1,499 ($1,963). Lastly, there’s the iPhone 15 and iPhone 15 Plus. Last year’s standard iPhones may not have all the love expended on the iPhone 16 and 16 Plus, which arguably took the regular phones closer to the Pro models than before, but they’re still worth considering, especially when the prices are reduced as here. Apple will sell you the iPhone 15 with 128GB storage for £699. On Amazon ( here’s the link ), all five colors are available for £598. That’s 14% off and our old friend the $101 discount reappears. The five colors, by the way, are yellow, green, pink, blue and black. Trade up to 256GB and instead of the regular £799 price you can find all five for £698. The larger-display iPhone 15 Plus, usually selling for £799 with 128GB storage, has dropped to £698, that’s 13% off but only in green and pink. The 256GB storage has dropped from £899 to, yes, that’s right, £798, which is an 11% discount. You can choose between blue and black for this deal. The 512GB storage option is available for this larger phone, wih the same £101 discount, taking the price from £1,099 to £998. Choose between black and, no, that’s it, just black. Incidentally, if U.S. readers see the price translations and feel the Brits are paying well over the odds compared to prices in the States, remember that U.S. prices are quoted pre-tax and U.K. ones have all sales taxes included, so the disparity isn’t as steep as it looks. And if price rises cut in Stateside because of tariffs, then iPhones could even be cheaper on the other side of the pond one day. Forbes Apple iPhone 17 Pro Design Unlike Current Rumors, New Leak Claims By David Phelan Follow me on Twitter or LinkedIn . Editorial Standards Forbes Accolades LOADING VIDEO PLAYER... FORBES’ FEATURED Video", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://www.forbes.com/sites/davidphelan/2025/04/12/apple-iphone-16-and-iphone-16-plus-prices-slashed-in-new-sale/", "source": "Forbes", "published_at": "2025-04-12T16:45:00"}, {"id": 29, "title": "18-Ct 1.6-Oz Larabar Bars Variety Pack (Blueberry Muffin, Lemon Bar, Apple Pie) 2 for $21.35 w/ Subscribe & Save + Free Shipping", "content": "[S&S] $13.29*: 18-ct Larabar Variety Pack (Blueberry Muffin, Lemon Bar, Apple Pie) at Amazon (2 for $21.33) 18-Ct 1.6-Oz Larabar Bars Variety Pack (Blueberry Muffin, Lemon Bar, Apple Pie) 2 for $21.35 $38 Help the community know if this is a good deal. 51 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Amazon Slickdeals Forums Hot Deals frontpage Posted by phoinix | Staff • Yesterday Apr 12, 2025 8:01 AM Item 1 of 5 Item 1 of 5 frontpage Posted by phoinix | Staff • Yesterday Apr 12, 2025 8:01 AM 18-Ct 1.6-Oz Larabar Bars Variety Pack (Blueberry Muffin, Lemon Bar, Apple Pie) w/ Subscribe & Save + Free Shipping 2 for $21.35 $38 Amazon 51 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 12 Comments 9,761 Views Get Deal at Amazon Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Save Share Deal Details Amazon has 18-Count 1.6-Oz Larabar Fruit & Nut Bars Variety Pack (Blueberry Muffin, Lemon Bar, Apple Pie) on sale 2 for $37.98 - 25% when you 'clip' the coupon on product page - Save $10 when you buy $35 of select items - 5% off when you check out via subscribe & save = 2 for $21.33 . Shipping is free . Thanks to Deal Hunter phoinix for finding this deal. Note : Must add 2 to cart for promotion to apply. You must be logged into your account. Coupons are typically one use per account. You have the flexibility to manage your Subscribe & Save subscription at any time after your order ships. View Subscribe & Save filler items and our current Subscribe & Save Frontpage deals to unlock up to an extra 15% savings when you have 5 or more items in your current monthly subscription. Product Details : Blueberry Muffin Ingredients: Cashews, Dates, Apples, Blueberries, Vanilla Extract. Lemon Bar Ingredients: Dates, Almonds, Cashews, Lemon Juice Concentrate, Lemon Juice Solids, Lemon Oil. Apple Pie Ingredients: Dates, Almonds, Apples, Walnuts, Raisins, Cinnamon. Editor's Notes Written by SubZero5 | Staff About this deal: This price is slightly more than the previous +86 FP deal . About this product: 4.4 out of 5 stars rating at Amazon based on over 12,700 customer reviews About this store: Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Original Post Written by phoinix | Staff Product Info Rating: (4.4 out of 5 stars) Reviews: 12,763 Amazon Reviews Manufacturer: GENERAL MILLS SALES INC. Product SKU: B0BMS16JLR UPC: 21908132969 ASIN: B0BMS16JLR Brand: LÄRABAR Item Dimensions LxWxH: 2.6 x 9 x 5 inches Item Weight: 0.8 Pounds Manufacturer: GENERAL MILLS SALES INC. Community Notes This collaborative space allows users to contribute additional information, tips, and insights to enhance the original deal post. Feel free to share your knowledge and help fellow shoppers make informed decisions. Add Entry About the Poster phoinix | Staff Joined in Dec 2010 Follow Give Rep Message 33,637 Deal Posts 35,208 Comments Posts 125,158 Reputation Points 34,392 Votes Submitted Deal Details Product Info Community Notes About the Poster Amazon has 18-Count 1.6-Oz Larabar Fruit & Nut Bars Variety Pack (Blueberry Muffin, Lemon Bar, Apple Pie) on sale 2 for $37.98 - 25% when you 'clip' the coupon on product page - Save $10 when you buy $35 of select items - 5% off when you check out via subscribe & save = 2 for $21.33 . Shipping is free . Thanks to Deal Hunter phoinix for finding this deal. Note : Must add 2 to cart for promotion to apply. You must be logged into your account. Coupons are typically one use per account. You have the flexibility to manage your Subscribe & Save subscription at any time after your order ships. View Subscribe & Save filler items and our current Subscribe & Save Frontpage deals to unlock up to an extra 15% savings when you have 5 or more items in your current monthly subscription. Product Details : Blueberry Muffin Ingredients: Cashews, Dates, Apples, Blueberries, Vanilla Extract. Lemon Bar Ingredients: Dates, Almonds, Cashews, Lemon Juice Concentrate, Lemon Juice Solids, Lemon Oil. Apple Pie Ingredients: Dates, Almonds, Apples, Walnuts, Raisins, Cinnamon. Editor's Notes Written by SubZero5 | Staff About this deal: This price is slightly more than the previous +86 FP deal . About this product: 4.4 out of 5 stars rating at Amazon based on over 12,700 customer reviews About this store: Don't have Amazon Prime? Students can get a free 6-Month Amazon Prime trial with free 2-day shipping, unlimited video streaming & more. If you're not a student, there's also a free 1-Month Amazon Prime trial available. Original Post Written by phoinix | Staff Deal Score +51 Good Deal Bad Deal You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other Get Deal at Amazon Price Intelligence Give Feedback Model: Larabar Fruit Variety Pack - 18ct/28.8oz Deal History Deal History includes data from multiple reputable stores, such as Best Buy, Target, and Walmart. The lowest price among stores for a given day is selected as the \"Sale Price\". Sale Price does not include sale prices at Amazon unless a deal was posted by a community member. Graph List Last 30 Days Last 60 Days Last 90 Days All Time Sale Price Slickdeal $NaN Today Sort: Most Recent Post Date Sold By Sale Price Activity 01/07/25 Amazon $13 frontpage 10 01/07/25 Amazon $19 0 12/26/24 Amazon $13 frontpage 5 12/02/24 Amazon $13 frontpage 6 07/18/24 Amazon $13 2 07/08/24 Amazon $13 1 05/08/24 Amazon $13 2 04/01/24 Amazon $221.10 frontpage 18 02/17/24 Amazon $28 frontpage 18 02/13/24 Amazon $11 0 01/14/24 Amazon $14 frontpage 8 05/28/23 Amazon $13 frontpage 22 03/03/23 Amazon $13 frontpage 10 Show More Current Prices Sort: Lowest to Highest | Last Updated 4/13/2025, 02:07 AM Sold By Sale Price Target $18.99 Leave a Comment To participate in the comments, please log in. Log In Sign Up Top Comments Sonnysunshine17 Got a press play10 discount of $10 off $35 when I changed quantity to two, came out to $18 for two boxes, that's 50 cents a bar. Thanks OP 12 Comments Oldest Sign up for a Slickdeals account to remove this ad. Sonnysunshine17 Yesterday Apr 12, 2025 11:41 AM 793 Posts Joined Nov 2015 Yesterday Apr 12, 2025 11:41 AM Sonnysunshine17 Yesterday Apr 12, 2025 11:41 AM 793 Posts Our community has rated this post as helpful. If you agree, why not thank Sonnysunshine17 Got a press play10 discount of $10 off $35 when I changed quantity to two, came out to $18 for two boxes, that's 50 cents a bar. Thanks OP 9 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply Dwoprus Yesterday Apr 12, 2025 5:09 PM 247 Posts Joined Dec 2021 Yesterday Apr 12, 2025 5:09 PM Dwoprus Yesterday Apr 12, 2025 5:09 PM 247 Posts Quote from Sonnysunshine17 : Got a press play10 discount of $10 off $35 when I changed quantity to two, came out to $18 for two boxes, that's 50 cents a bar. Thanks OP yeah I also got $17,53 total. Dang good deal! Like Like Helpful Funny Not helpful Reply Copy Comment Link SnakePlisken Yesterday Apr 12, 2025 5:19 PM 37,067 Posts Joined Dec 2005 This comment has been rated as unhelpful by Slickdeals users. Show Comment samfromny Yesterday Apr 12, 2025 5:34 PM 784 Posts Joined Nov 2020 Yesterday Apr 12, 2025 5:34 PM samfromny Yesterday Apr 12, 2025 5:34 PM 784 Posts Quote from SnakePlisken : Simply awful tasing. Gave them to the dogs Do you not love your dogs? Last edited by samfromny April 12, 2025 at 10:58 AM. 2 1 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link BillD2175 Yesterday Apr 12, 2025 6:45 PM 3 Posts Joined Jan 2013 Yesterday Apr 12, 2025 6:45 PM BillD2175 Yesterday Apr 12, 2025 6:45 PM 3 Posts Items (2): $39.36 Shipping: $2.99 Free Shipping: -$2.99 CouponSavings: -$4.92 Press Play 10: -$10.00 Subscribe &Save: -$1.97 Total before tax: $22.47 Estimated tax: $0.44 Order total: $22.91 Best I can get Last edited by BillD2175 April 12, 2025 at 11:47 AM. 1 Like Like Helpful Funny Not helpful Reply Copy Comment Link jackc6900 Yesterday Apr 12, 2025 7:33 PM 1,676 Posts Joined Oct 2010 Yesterday Apr 12, 2025 7:33 PM jackc6900 Yesterday Apr 12, 2025 7:33 PM 1,676 Posts $17.53 for me for 2. Nice deal on 36 bars. Like Like Helpful Funny Not helpful Reply Copy Comment Link 1 Reply balloonshark Yesterday Apr 12, 2025 8:40 PM 5,451 Posts Joined Nov 2012 Yesterday Apr 12, 2025 8:40 PM balloonshark Yesterday Apr 12, 2025 8:40 PM 5,451 Posts No coupon for me. Oh well! Like Like Helpful Funny Not helpful Reply Copy Comment Link Sign up for a Slickdeals account to remove this ad. mumuu0 13h ago Apr 13, 2025 3:39 AM 300 Posts Joined Aug 2015 13h ago Apr 13, 2025 3:39 AM mumuu0 13h ago Apr 13, 2025 3:39 AM 300 Posts dammit used the 25% coupon on another larabar bar product. does anyone know if i cancel that order, will I get the 25% coupon back Like Like Helpful Funny Not helpful Reply Copy Comment Link somelousyluck 9h ago Apr 13, 2025 7:24 AM 1,142 Posts Joined Jun 2009 9h ago Apr 13, 2025 7:24 AM somelousyluck 9h ago Apr 13, 2025 7:24 AM 1,142 Posts Quote from SnakePlisken : Simply awful tasing. Gave them to the dogs I agree but my husband will eat the blueberry & apple & feels their not as bad as eating other snacks Like Like Helpful Funny Not helpful Reply Copy Comment Link somelousyluck 9h ago Apr 13, 2025 7:26 AM 1,142 Posts Joined Jun 2009 9h ago Apr 13, 2025 7:26 AM somelousyluck 9h ago Apr 13, 2025 7:26 AM 1,142 Posts Quote from jackc6900 : $17.53 for me for 2. Nice deal on 36 bars. For me too. Was very happy especially since my only my husband will eat them😊 Like Like Helpful Funny Not helpful Reply Copy Comment Link forsavings 3h ago Apr 13, 2025 2:06 PM 158 Posts Joined Dec 2014 3h ago Apr 13, 2025 2:06 PM forsavings 3h ago Apr 13, 2025 2:06 PM 158 Posts Sweet, worked for me. First time using subscribe and save so it took me a few tries to see the advertised price. These are the cleanest ingredient bars I've come across aside from home made ones Last edited by forsavings April 13, 2025 at 07:10 AM. Like Like Helpful Funny Not helpful Reply Copy Comment Link Related Searches Grocery Snacks, Nuts & Chips Coupon Online Only Subscription Amazon $15 $35 57% off Crocs Women's Classic Geometric Slide 2.0 (7-9, White Geo) $15.00 + Free Shipping 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 4 $9.98 $15 33% off 6-Pack Element by Altman Plants Multicolor Succulent, Live Indoor House Plants with Grower Pots , 2 inch $9.98 + Free S&H w/ Walmart+ or on $35+ 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $20 $50 60% off Atari 50: The Anniversary Celebration Expanded Steelbook Edition (Nintendo Switch) $19.99 + Free Shipping w/ Prime or on $35+ 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $9.59 $15 36% off 165-Piece LEGO Harry Potter: Chamber of Secrets Flying Ford Anglia Car Set $9.59 + Free Shipping w/ Prime or on $35+ 8 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $6.74 $20 66% off Monopoly Knockout Board Game $6.74 + Free Shipping w/ Prime or on $35+ 9 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 $95 $145 34% off Hoka Men's Clifton 9 Running Shoes (Blanc De Blanc/Virtual Blue) $95 + Free Shipping 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 1 $70 $100 30% off Z-Man Games A Feast For Odin Board Game (1-4 Players) $70.49 + Free Shipping 4 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 2 $20 $40 50% off Disney Dreamlight Valley Cozy Edition (PlayStation 5) $19.99 + Free Shipping w/ Prime or on $35+ 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 0 Select PayPal Accounts: Additional 30% Savings on Instacart purchases 6 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 11 $9.80 $19 48% off $9.80: IRIS USA Large Cat Litter Box with Scatter Shield and Scoop, Black at Amazon 5 There is no voting data on this thread You have chosen to downvote this deal. Not a good price Not a good product Poor Merchant Reputation Unable to replicate deal Incorrect Information Spam, Self Promotion Repost Other 2 Feedback", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slickdeals.net/f/18246151-s-s-13-29-18-ct-larabar-variety-pack-blueberry-muffin-lemon-bar-apple-pie-at-amazon-2-for-21-33?utm_source=rss&utm_content=fp&utm_medium=RSS2", "source": "Slickdeals.net", "published_at": "2025-04-12T16:44:56"}, {"id": 30, "title": "iPhones, Macs, and Other Apple Devices Exempted From Trump Tariffs", "content": "iPhones, Macs, and Other Apple Devices Exempted From Trump Tariffs - MacRumors Skip to Content Front Page Roundups Guides How Tos Reviews Buyer's Guide Upcoming Products Forums Archives Tips / Contact Us Podcast Instagram Facebook Twitter Mastodon YouTube Notifications RSS Newsletter iPhones, Macs, and Other Apple Devices Exempted From Trump Tariffs Saturday April 12, 2025 9:44 am PDT by Juli Clover Apple and other electronics manufacturers have received a break from Trump's reciprocal tariffs, with the U.S. Customs and Border Protection agency sharing a long list of products excluded from the levies last night. iPhones, Macs, iPads, Apple Watch, and other Apple devices will not be subject to the 125 percent tariffs that have been put in place on imported Chinese goods, nor will Apple have to pay the 10 percent reciprocal tariffs that are in place for goods from other countries. All manner of electronic devices have been exempted, including computer components such as GPUs from Nvidia, semiconductors and the equipment used to make them, SSDs, displays, many TVs, and more. Some other electronic devices including video game consoles like the Nintendo Switch 2 are still subject to the tariffs. As Bloomberg points out, the exemptions could be temporary and the Trump administration could be planning for new, lower tariffs on electronics and other goods from China. The order also does not exempt companies from the 20 percent \"fentanyl\" fee imposed on China, which was an earlier penalty, so there is still a fee that Apple will need to pay. With the back and forth over tariffs and the 90-day pause Trump put in place in some countries, Apple stock has been volatile for the last week and has dropped more than 20 percent before recovering somewhat. As of market close yesterday, Apple's stock was down 11 percent from early April. Update : This article previously stated that AirPods and HomePod were not covered by the exemptions, but it appears they in fact are. Note: Due to the political or social nature of the discussion regarding this topic, the discussion thread is located in our Political News forum. All forum members and site visitors are welcome to read and follow the thread, but posting is limited to forum members with at least 100 posts. [ 370 comments ] Get weekly top MacRumors stories in your inbox. Popular Stories Report Reveals Internal Chaos Behind Apple's Siri Failure Thursday April 10, 2025 7:15 am PDT by Hartley Charlton A new report from The Information today reveals much of the internal turmoil behind Apple Intelligence's revamped version of Siri. Apple apparently weighed up multiple options for the backend of Apple Intelligence. One initial idea was to build both small and large language models, dubbed \"Mini Mouse\" and \"Mighty Mouse,\" to run locally on iPhones and in the cloud, respectively. Siri's... Read Full Article • 343 comments 10 Products Still Coming From Apple in 2025 Friday April 11, 2025 4:14 pm PDT by Juli Clover Apple may have updated several iPads and Macs late last year and early this year, but there are still multiple new devices that we're looking forward to seeing in 2025. Most will come in September or October, but there could be a few surprises before then. We've rounded up a list of everything that we're still waiting to see from Apple in 2025. iPhone 17, 17 Air, and 17 Pro - We get... Read Full Article • 49 comments Waiting for the Perfect MacBook Pro? 2026 Might Be the Year Thursday April 10, 2025 4:19 am PDT by Tim Hardwick Apple in October 2024 overhauled its 14-inch and 16-inch MacBook Pro models, adding M4, M4 Pro, and M4 Max chips, Thunderbolt 5 ports on higher-end models, display changes, and more. That's quite a lot of updates in one go, but if you think this means a further major refresh for the MacBook Pro is now several years away, think again. Bloomberg's Mark Gurman has said he expects only a small... Read Full Article • 113 comments The MacRumors Show: New iOS 19, iPhone 17, and Apple Watch Ultra 3 Leaks Friday April 11, 2025 7:13 am PDT by Hartley Charlton On this week's episode of The MacRumors Show, we catch up on the latest iOS 19 and watchOS 12 rumors, upcoming devices, and more. Subscribe to The MacRumors Show YouTube channel for more videos Detailed new renders from leaker Jon Prosser claim to provide the best look yet at the complete redesign rumored to arrive in iOS 19, showing more rounded elements, lighting effects, translucency, and... Read Full Article • 13 comments iOS 19 Leak Reveals Alleged New Design With Rounder App Icons, Floating Tab Bar, and More Monday April 7, 2025 3:13 pm PDT by Joe Rossignol YouTube channel Front Page Tech is back today with another video that provides a closer look at iOS 19's alleged design changes. The video contains re-created renders of iOS 19, which are allegedly based on real footage of the software update, provided by sources within Apple. Overall, iOS 19 is expected to have a more glass-like, visionOS-inspired design, with added translucency for user... Read Full Article • 243 comments Apple Store in Chicago Area Permanently Closing Later This Month Wednesday April 9, 2025 9:56 am PDT by Joe Rossignol Apple will be permanently closing its store at the Northbrook Court shopping mall in the Chicago suburb of Northbrook on April 26, the company has announced. Apple has added the following notice to the store's web page:Thank you Northbook. Apple Northbrook is closing on April 26 at 7pm. We're still here for you. Please visit apple.com/retail to find your nearest store.Apple Northbrook opened ... Read Full Article • 35 comments iOS 18.5 Includes Two Changes So Far Wednesday April 9, 2025 9:09 am PDT by Joe Rossignol Apple released the first beta of iOS 18.5 last week, and so far the software update includes only two minor changes. The changes are in the Mail and Settings apps. In the Mail app, you can now easily turn off contact photos directly within the app, by tapping on the circle with three dots in the top-right corner. In the Settings app, there is some new AppleCare+ information. For ... Read Full Article NYT: Apple's AI Struggles Began with 2023 Chip Budget Dispute Friday April 11, 2025 4:33 am PDT by Tim Hardwick Apple's current struggles with Apple Intelligence and Siri began in early 2023 when AI head John Giannandrea sought approval from CEO Tim Cook to purchase more AI chips for development, according to a new report from The New York Times. Cook initially approved doubling the team's chip budget, but CFO Luca Maestri reportedly reduced the increase to less than half that amount, and instead... Read Full Article • 114 comments Apple's 18.8-Inch Foldable Device to Enter Mass Production in Late 2026 Thursday April 10, 2025 1:33 am PDT by Tim Hardwick Along with an iPhone \"Fold,\" Apple is believed to be working on a larger foldable device that's somewhere around 19 inches, and one analyst suggests it could arrive as soon as late next year alongside Apple's rumored foldable iPhone. In a new research note covering likely post-tariff scenarios for Apple, investment firm GF Securities' lead analyst Jeff Pu says that both 18.8-inch and... Read Full Article • 46 comments Top Rated Comments cbaca51 1 day ago at 09:52 am Trump folded quick ? Score: 99 Votes ( Like | Disagree ) nfl46 1 day ago at 10:00 am Will he change his mind by Monday morning?? My goodness. This dude is making stuff up as he goes…noooo plan, whatsoever! This is insane! Score: 73 Votes ( Like | Disagree ) JohnC1959 1 day ago at 09:58 am lol. Trump being Trump. But also people being people. People panic, which causes problems, but the reason for their panic never bears fruit. Trump makes rash decisions that are destructive. People start to lose money. Influential people step in and tell Trump he's going to lose support if he doesn't make some changes. Rinse and repeat. Score: 67 Votes ( Like | Disagree ) DotCom2 1 day ago at 09:55 am Don't get toooooo over-joyed. Things could change in a heartbeat. That's Trump for ya! Score: 52 Votes ( Like | Disagree ) vegetassj4 1 day ago at 10:03 am Will he change his mind by Monday morning?? My goodness. This dude is making stuff up as he goes…noooo plan, whatsoever! This is insane! No you have it wrong. He is playing reverse 12 dimensional chess, and 5 dimensional Go in alternating dimensions. Only a STABLE GENIUS can ponder the level of GENIUSNESS. Score: 50 Votes ( Like | Disagree ) TigerNike23 1 day ago at 09:54 am If I’m Tim Apple, I use this moment to ramp up iPhone production in India and possibly adding iPhone production capabilities in Vietnam. Trump is not stable from a business standpoint, so take this as a reprieve to cover your behind for the next tariff hike. Score: 43 Votes ( Like | Disagree ) Read All Comments Next Article Amazon Takes Up to $70 Off New M4 MacBook Air, Available From $949 Guides iOS 18.4 Features Priority Notifications, visual intelligence for iPhone 15 Pro, new emoji, and more. Apple Intelligence Guide Apple Intelligence is what Apple is calling its artificial intelligence feature set. Here's everything we know. Image Playground Guide Image Playground is Apple's dedicated image creation app that can build cartoon-like pictures based on text descriptions. iPhone Mirroring Not Working? If you're experiencing issues with iPhone Mirroring, follow these steps to get it working again. • iPhone 16 vs 16 Pro • iPhone 16 and iPhone 16 Pro: How to Use All the New Features • 50 macOS Sequoia Features • watchOS 11: All the New Features and Changes • What's New in iOS 18 Messages • iOS 18 Photos Changes • New AirPods Features in iOS 18 • 21 Time-Saving iPhone Tips • 14 macOS Tips to Make Your Life Easier • One AirPod Not Working? See more guides Upcoming WWDC 2025 June 9–13 Apple's annual developer conference where it will unveil iOS 19, macOS 16, and more. iOS 19 June 2025 Preview Biggest design overhaul since iOS 7, new Apple Intelligence features, and more. M4 Mac Pro Mid–Late 2025 New M4-generation chips and additional upgrades. iPhone 17 September 2025 Apple's next-generation iPhone models with a new \"Air\" or \"Slim\" model replacing the current Plus model. • iPhone 17 Pro • iPhone 17 Air See full product calendar Other Stories How to Mute Lengthy Email Threads on iPhone 3 days ago by Tim Hardwick iOS 18.5 Includes Two Changes So Far 4 days ago by Joe Rossignol Hard Reset or Force Restart Your iPhone 16e 4 days ago by Tim Hardwick Mastering the Mac App Switcher: Essential Tips and Hidden Tricks 4 days ago by Tim Hardwick How to Make Scroll Bars Always Visible in macOS 4 days ago by Tim Hardwick", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://www.macrumors.com/2025/04/12/apple-tariff-exemptions/", "source": "MacRumors", "published_at": "2025-04-12T16:44:02"}, {"id": 31, "title": "I walked 5,000 steps with the Apple Watch 10 vs Garmin Instinct 3 — and there's a clear winner", "content": "If you click 'Accept all', we and our partners, including 239 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+702 chars]", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_e2335f83-9c2f-4808-83fa-4fa69734e0b3", "source": "Yahoo Entertainment", "published_at": "2025-04-12T16:31:00"}, {"id": 32, "title": "US Exempts Tech Imports In Tariff Step Back", "content": "US Exempts Tech Imports In Tariff Step Back | IBTimes Business US President Donald Trump raises a fist as he steps off Air Force One at Palm Beach International Airport in Florida on April 11, 2025, while heading to spend the weekend at his Mar-a-Lago resort AFP The Trump administration has announced a series of major exemptions to its punishing global tariffs -- an apparent step back in an escalating trade war with China. A notice late Friday by the US Customs and Border Protection office said smartphones, computers and other electronics would be excluded from the import levies President Donald Trump rolled out a week ago. The move came as retaliatory Chinese import tariffs of 125 percent on US goods took effect Saturday, with Beijing standing defiant against its primary trade competitor. The exemptions will benefit US tech giants like Apple that make iPhones and other premium products in China, and will generally narrow the impact of the staggering 145 percent tariffs Trump has imposed this year on Chinese goods entering the United States. Washington and Beijing's escalating tariff battle has raised fears of an enduring trade war between the world's two largest economies and sent global markets into a tailspin. The fallout has sent particular shockwaves through the US economy, with investors dumping government bonds and the dollar tumbling. Nevertheless, Trump insisted Friday on his Truth Social platform that \"we are doing really well on our tariff policy,\" even after Beijing announced its latest hike. Daniel Ives, senior equity analyst at Wedbush Securities, called the US exemptions \"the best news possible for tech investors.\" \"US tariff exclusions will apply to computers, smartphones, and chip-making equipment which takes (away) a huge black cloud overhang for now over the tech sector,\" he added in a note. Without these exemptions, he said, \"the US Tech industry would be taken back a decade and the AI Revolution thesis would have been slowed significantly.\" Many of the exempted products, including hard drives and computer processors, generally are not made in America. While Trump has referred to tariffs as a way to bring manufacturing back to the United States, analysts say it will likely take years to ramp up domestic production. Trump has specifically targeted China with his \"reciprocal\" tariffs meant to address practices Washington deems unfair. And even with Washington and Beijing going toe-to-toe, the White House insists Trump remains \"optimistic\" about a deal with China. His Chinese counterpart Xi Jinping gave his first major comments on the tensions Friday, with state media quoting him as saying his country was \"not afraid.\" Economists warn that the disruption in trade between the tightly integrated US and Chinese economies will increase prices for consumers and could spark a global recession. China's Commerce Minister Wang Wentao told the head of the World Trade Organization (WTO) that US tariffs will \"inflict serious harm\" on poor nations, according to a ministry statement released Saturday. \"The United States has continuously introduced tariff measures, bringing enormous uncertainty and instability to the world, causing chaos both internationally and domestically within the US,\" Wang told WTO chief Ngozi Okonjo-Iweala in a call, the statement said. Beijing also indicated Friday that it would ignore any further levies by Trump because it said it no longer makes economic sense for importers to buy from America. China also said it would file a lawsuit with the WTO over the latest round of levies. Meanwhile, Taiwan's government on Saturday said it held first tariff discussions with the United States and expected more talks to build \"strong and stable\" trade ties. Taiwan's President Lai Ching-te on Friday said the island was on \"the first negotiating list of the US government\" as he looks to shield its exporters from a 32-percent tariff. © Copyright AFP 2024. All rights reserved. IBT Fast Start - Let the best of International News come to you Sign up and stay up to date with our daily newsletter. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Service and Privacy Policy . Join the Discussion MOST POPULAR IN Business ​Modere Shuts Down After 23 Years of Clean-Living Innovation​ Trump Admin Cancels $5.1B Pentagon IT Contracts With Accenture, Deloitte Google Layoffs Hit Hard: Android and Pixel Departments Streamlined, What's Behind the Cuts? US Fed Officials See Higher Inflation Ahead As Consumer Confidence Plunges Trump's Trade Whiplash Sends Dollar Into Tailspin US-China Trade War: Amazon's Products Expected to Rise as Chinese Sellers Suffer 145% Tariff Trump Tariffs Unnerve Locals In Irish 'Pharma' Hub Chinese Manufacturers In Fighting Spirits Despite Scrapped US Orders Asset Flight Challenges US Safe Haven Status Stocks, Dollar Sink And Gold Hits Record As Trump Tariff Panic Returns Tesla Opens First Showroom In Oil-rich Saudi Iran, US Raise Stakes Ahead Of Key Talks In Oman End Of The Line For Hong Kong's Democratic Party US Auto Union Praises Some Trump Tariffs Trump's Tariff Pause Made All These Businessmen Even Richer DoorDash Robot Deliveries Launch in Los Angeles, Chicago—But There's a Catch US Senators Ask SEC For Trump Insider Trading Probe Jolted By Trump, EU Woos New Partners From Asia To Latin America Cash-strapped Nigerians Turn To YouTube For Entertainment Trump Envoy Suggests Allied Zones Of Control In Ukraine Promoted in Business 1 M&As In Distress 2 How a Solana Price Analysis Helps Investors Make Informed Trading Decisions 3 COCHIC: Patrizia Angela Casubolo's 15-Year Journey Of Reinvention, Sustainability And Impact Through Luxury Accessories 4 Entrepreneur Jose Menendez Shares Inspiring Journey of Achieving the Immigrant Dream 5 Thought Leader Amit Ojha Throws Light on the SaaS Silos in Businesses and Envisions for a Connected Future MOST POPULAR IN Business 1 ​Modere Shuts Down After 23 Years of Clean-Living Innovation​ 2 Trump Admin Cancels $5.1B Pentagon IT Contracts With Accenture, Deloitte 3 Google Layoffs Hit Hard: Android and Pixel Departments Streamlined, What's Behind the Cuts? 4 US Fed Officials See Higher Inflation Ahead As Consumer Confidence Plunges 5 Trump's Trade Whiplash Sends Dollar Into Tailspin 6 US-China Trade War: Amazon's Products Expected to Rise as Chinese Sellers Suffer 145% Tariff 7 Trump Tariffs Unnerve Locals In Irish 'Pharma' Hub 8 Chinese Manufacturers In Fighting Spirits Despite Scrapped US Orders 9 Asset Flight Challenges US Safe Haven Status 10 Stocks, Dollar Sink And Gold Hits Record As Trump Tariff Panic Returns 11 Tesla Opens First Showroom In Oil-rich Saudi 12 Iran, US Raise Stakes Ahead Of Key Talks In Oman 13 End Of The Line For Hong Kong's Democratic Party 14 US Auto Union Praises Some Trump Tariffs 15 Trump's Tariff Pause Made All These Businessmen Even Richer 16 DoorDash Robot Deliveries Launch in Los Angeles, Chicago—But There's a Catch 17 US Senators Ask SEC For Trump Insider Trading Probe 18 Jolted By Trump, EU Woos New Partners From Asia To Latin America 19 Cash-strapped Nigerians Turn To YouTube For Entertainment 20 Trump Envoy Suggests Allied Zones Of Control In Ukraine Get up to Speed with IBT’s Fast Start Stay up to date with our daily newsletter Sign Up Now IBT VIDEO", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.ibtimes.com/us-exempts-tech-imports-tariff-step-back-3769837", "source": "International Business Times", "published_at": "2025-04-12T16:27:14"}, {"id": 33, "title": "BLEACH: Brave Souls hits 100 Million downloads worldwide", "content": "BLEACH: Brave Souls hits 100 Million downloads worldwide | GoNintendo Front Page The Blog BLEACH: Brave Souls hits 100 Million downloads worldwide That's a lotta souls 12 April 2025 by quence 0 KLab Inc., a leader in online mobile games, announced that its hit 3D action game Bleach: Brave Souls has reached a total of 100 million downloads worldwide. To celebrate this milestone, the 100 Million Downloads Special Gift and the 100 Million Downloads Special: Free Brave Souls Summons: Mix that offers one free x10 Summons every day for up to ten days will be available as a huge thank-you to the community for supporting the game. In addition, check out the “10th Anniversary Special! Brave Souls News Live!” that is scheduled to be streamed on Saturday, April 19 from 18:30 (JST/UTC+9)! The 10th anniversary ambassador announced in the Year End Bankai Live, Masakazu Morita (voice of Ichigo Kurosaki), will deliver 10th anniversary information to viewers live. Also, don’t miss the “10th Anniversary Special! Brave Souls News Live!” RP campaign, as well as a campaign where the participant that has their post read live receives a prize! Be sure to keep an eye on Bleach: Brave Souls, as it is jam-packed with campaigns to celebrate the 100 million downloads milestone and the 10th anniversary year. 100 Million Downloads Special Gift Event Period: Sunday, April 13 0:00 to Saturday, May 31 23:59 (JST/UTC+9) All players that log in during the event period will receive awesome gifts to celebrate Bleach: Brave Souls reaching 100 million downloads! Battle Ready ★6 Summons Ticket (100 Million) Crystals and Jewels of each size Super Rainbow Link Slot Potion And more Plus, don’t miss the 100 Million Worldwide Downloads Special Login Bonus and more starting from Saturday, April 19! 100 Million Downloads Special: Free Brave Souls Summons: Mix Event Period: Sunday, April 13 16:00 to Tuesday, April 29 15:59 (JST/UTC+9) One free x10 Summons every day for up to ten days! Also, don’t miss these other Summons starting from Saturday, April 19! 100 Million Downloads Special: Choose a ★6 Summons Free Thousand-Year Blood War Summons 100 Million Downloads Gift Campaign Campaign Period: Saturday, April 19 to Sunday, April 27 (JST/UTC+9) Follow the Bleach: Brave Souls official X account (@bleachbrs_en) and repost the “100 Million Downloads Gift Campaign” post for the chance to be one of 1000 winners to receive in-game item codes and Brave Souls original merch featuring new characters! Be sure to enter every day during the campaign period. Gifts Brave Souls Original Merch: 900 Winners Item Set (Equivalent to a Golden Pack): 20 Winners 258 Spirit Orbs: 80 Winners *The “Item Set (equivalent to a Golden Pack)” and “258 Spirit Orbs” can be exchanged for the matching items on the Bleach: Brave Souls Game Store using a code that will be sent via DM. The item code can only be used on the mobile version (Apple/Google Play) and the Steam version of the game. Please check the Brave Souls official X account (@bleachbrs_en) for more details. “10th Anniversary Special! Brave Souls News Live!” Announced! The “10th Anniversary Special! Brave Souls News Live!” has been announced to celebrate the 10th anniversary of Bleach: Brave Souls. Be sure to tune in to hear Masakazu Morita (voice of Ichigo Kurosaki), the 10th anniversary ambassador announced in the Year End Bankai Live, deliver exclusive information about the 10th anniversary year. Livestream Schedule Saturday, April 19, 2025 from 18:30 to 19:30 (JST/UTC+9) Program Details New characters will be revealed! And more 10th Anniversary Special! Brave Souls News Live! RP Campaign! Campaign Period: Saturday, April 19 to Friday, April 25 23:59 (JST/UTC+9) Follow the Bleach: Brave Souls official X account (@bleachbrs_en) and repost the “10th Anniversary Special! Brave Souls News Live!” post to enter to be one of 5 winners to receive a Brave Souls Original Acrylic Stand (10th Anniversary outfit Kon)! The Participant that has their Post with #BraveSoulsNews10th Read Live will Receive a Prize! Event Period: Saturday, April 19 from around 18:20 to the end of the livestream (JST/UTC+9) Share any thoughts about the livestream on X by using the hashtag #BraveSoulsNews10th. The participant that has their comment read out during the livestream will receive Brave Souls Original merch chosen by Masakazu Morita himself. More info will be revealed during the livestream, so don’t miss it! [ GamesPress ] Comment History Loading... Close Add Comment Sign in or, Sign up Comments (0) No comments yet. Be the first! Comment Upvoting Details Loading... Close", "sentiment": "POSITIVE", "sentiment_score": 0.9, "url": "https://gonintendo.com/contents/47413-bleach-brave-souls-hits-100-million-downloads-worldwide", "source": "GoNintendo", "published_at": "2025-04-12T16:27:00"}, {"id": 34, "title": "Trump Exempts Phones, Computers, Other Electronics From Reciprocal Tariffs", "content": "Trump Exempts Phones, Computers, Other Electronics From Reciprocal Tariffs | The Epoch Times AD Support Us SHARE Business & Markets Economic Policies Trump Exempts Phones, Computers, Other Electronics From Reciprocal Tariffs Tech companies like Apple stand to gain relief from the exemption. Copy Facebook X Truth Gettr LinkedIn Telegram Email Save Apple iPhone 16 on display at an Apple store in New York on April 4, 2025. Michael M. Santiago/Getty Images By Naveen Athrappully 4/12/2025 Updated: 4/12/2025 Print X 1 0:00 President Donald Trump exempted a range of everyday products, specifically in the electronic category, from reciprocal tariffs while importing into the United States. Items excluded from reciprocal tariffs include smartphones, computers, servers, laptops, tablets, motherboards, processors, memory modules, machines used for manufacturing semiconductor devices, integrated circuits, flat panel displays, and related devices, according to updated guidance from the U.S. Customs and Border Protection published on April 11. The items will be exempt from tariffs imposed on countries by Trump, and the 145 percent tariff imposed on China, which is the major manufacturer and supplier for all these components. The tariff relief will be a boost for tech companies like Apple, whose shares had fallen since Trump announced the implementation of tariffs on April 2. Apple’s stock price declined nearly 23 percent as it fell from $223.89 on April 2 to $172.42 on April 8. The company’s market capitalization loss amounted to almost $640 billion. It has since recovered partially, trading at $198.15 at the time of publication. Other items included in the announcement are routers, modems, network switches, SSD storage devices, USB drives, SD cards, display modules like LCD, OLED, computer monitors, certain transistors, solar cells, LEDs, microchips, microprocessors, memory chips, and more. Related Stories Beijing Attempting to Offset Tariffs With Yuan Devaluation, Say Analysts 4/12/2025 China Hikes Tariffs on US Goods to 125 Percent 4/11/2025 Trump announced reciprocal tariffs in retaliation for trade barriers levied by countries importing U.S. goods. A baseline global tariff of 10 percent was enforced along with country-specific customized tariffs based on their trade stances towards the United States. Upon announcing the tariffs, Treasury Secretary Scott Bessent warned countries not to retaliate. China refused to comply, and hit back with tariffs of its own against the United States, starting a trade war, which has now culminated in a 145 percent tariff on the Asian manufacturing hub. China has again hit the United States with a 125 percent tariff. Meanwhile, Trump has paused tariffs for all other countries in order to negotiate better trade deals for the United States. Trump’s tariffs have also triggered volatility in U.S. and global markets, impacting bonds and treasury yields. Beijing is trying to counteract the adverse impacts of the trade tariffs via a depreciation of the Chinese yuan, analysts told The Epoch Times. On April 8, China’s central bank, the People’s Bank of China, set the yuan’s central parity rate at 7.2038, marking the first time since September 2023 that the rate has surpassed the 7.20 threshold. As of April 11, the exchange rate is approximately 7.291 yuan per USD. The forced depreciation of yuan is one of the reasons why Trump imposed harsher penalties on the regime, along with stealing IP, dumping products in foreign markets, and maintaining a large trade imbalance with the United States. Cindy Li contributed to the report. Share this article Share this article Leave a comment Naveen Athrappully Author Naveen Athrappully is a news reporter covering business and world events at The Epoch Times. Author’s Selected Articles Social Security Says Set to Improve Telephone Claim Processing Apr 13, 2025 IRS Says Over $1 Billion in Tax Refunds Unclaimed, Urges Taxpayers to Check Eligibility Apr 12, 2025 Celery Sold in Walmart Recalled Over Possible Listeria Risk Apr 12, 2025 Illegal Immigrants on Terror Watchlist Received Medicaid, Unemployment Insurance: DOGE Apr 12, 2025", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://www.theepochtimes.com/business/trump-exempts-many-electronic-products-from-tariffs-5840817", "source": "Theepochtimes.com", "published_at": "2025-04-12T16:26:00"}, {"id": 35, "title": "Apple, Nvidia score major wins with tariff exemptions on iPhones and other tech", "content": "Apple, Nvidia score major wins with tariff exemptions on iPhones and other tech Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Apple, Nvidia score major wins with tariff exemptions on iPhones and other tech marketwatch.com/story/apple-nvidia-score-major-wins-with-tariff-exemptions-on-iphones-and-other-tech-51dd615a?g=e4ad0a5b-0321-45a2-b157-9c77a73e200c This story appeared on marketwatch.com , 2025-04-12 16:11:20. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/afdd365efd072a50", "source": "Biztoc.com", "published_at": "2025-04-12T16:25:20"}, {"id": 36, "title": "Trump Exempts Apple, Nvidia, Super Micro, Other Tech Gear From Huge Tariffs", "content": "Trump Exempts Apple, Nvidia, Super Micro, Other Tech Gear From Huge Tariffs Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Trump Exempts Apple, Nvidia, Super Micro, Other Tech Gear From Huge Tariffs investors.com/news/technology/trump-exempts-apple-iphone-nvidia-super-micro-tech-gear-tariffs President Trump exempted the Apple iPhone from most tariffs, along with PCs, servers and a slew of other tech gear from Nvidia and others. The post Trump Exempts Apple, Nvidia, Super Micro, Other Tech Gear From Huge Tariffs appeared first on Investor's Business Daily. This story appeared on investors.com , 2025-04-12 16:14:33. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/51133e6fbe9b6bbf", "source": "Biztoc.com", "published_at": "2025-04-12T16:25:09"}, {"id": 37, "title": "Apple, Google, Cash App alums ditch Big Tech to build on bitcoin, fueled by VC money and friendly White House", "content": "Apple, Google, Cash App alums ditch Big Tech to build on bitcoin Skip Navigation Markets Business Investing Tech Politics Video Watchlist Investing Club PRO Livestream Menu Key Points Bitcoin Commons has become a launchpad for founders and engineers walking away from Silicon Valley jobs to bet on open-source code, off-grid mining, and decentralized finance. With Trump’s pro-bitcoin pivot, a new wave of startups is surging into the space, buoyed by regulatory optimism and moves like the Strategic Bitcoin Reserve. From privacy-preserving cloud startups to Lightning-powered payment rails, the Commons is where conviction meets code — and careers are risked in pursuit of a new kind of financial system. watch now VIDEO 5:56 05:56 Former Apple and Cash App engineers flock to Austin as Trump embraces bitcoin Crypto World AUSTIN — On a Friday morning last spring, Mark Suman called out sick from his job as a senior engineering project manager at Apple and made his way downtown to a place called the Bitcoin Commons, a sort of clubhouse for enthusiasts of the world's largest cryptocurrency, situated a few blocks south of the Texas State Capitol. At the time, Suman was, in his words, \"an active hobbyist,\" tinkering with the technology in his spare time. \"I actually played around with it a bit within Apple as well,\" he says. \"There's not a lot I can say, other than we were always exploring new technologies, and so I was playing around with some of the open-source bitcoin tools within Apple and doing some exploratory work.\" Suman was there for the annual 'Bitcoin Takeover' event. He had followed many of the speakers online and when he saw the gathering pop up on his feed, he took the day off to see it for himself. \"I was sitting in the crowd wanting to get into the space and really build something new and build something novel,\" Suman recalled. What happened instead was the beginning of a professional pivot: he struck up a conversation with a developer after a talk at the Commons, and was introduced to other coders who were winding down a project called Mutiny. Within a few months, Suman handed in his notice at Apple and with the developers he'd met, pivoted into something bigger — co-founding Open Secret, a startup reimagining how user data is stored in the cloud. Instead of relying on centralized databases, the company encrypts data to each individual user — even after it’s uploaded. So if there's a breach, there's nothing to steal, Suman explained. No honeypot. Parker Lewis speaks at the Bitcoin Commons, where he helps lead educational efforts around bitcoin adoption and policy. Rod Roudi/Bitcoin Commons The leap was not without stakes. \"There are plenty of sleepless nights,\" he said. \"I've got a family, I've got kids, I've got a kid off at university.\" He had spent years working on privacy infrastructure — tackling tough technical problems around user protection at scale — but saw a way to do it better with blockchain. \"Apple likes to talk a big game about privacy,\" he says. \"And having been there, I've seen very deep within a lot of their systems that they do care about privacy at every level.\" That vision — and the Commons — helped give him conviction. The builders there were all laser focused on creating something that mattered. Inside Austin's bitcoin clubhouse Bitcoin Commons sits on the second floor of the Littlefield Building at the corner of Congress Avenue and Sixth Street — where the broad boulevard to the Capitol collides with the noisy sprawl of Austin’s nightlife district. It’s an apt metaphor for the space itself. By day, it serves as a clean, open-plan coworking hub for bitcoin operators and builders. At night, it transforms into a gathering place for rogue developers and off-the-record meetups. Events here draw a blend of venture capitalists, open-source contributors, off-grid energy technicians, and Lightning engineers — developers who build software to make bitcoin faster and cheaper to use. On some afternoons, once happy hour hits, the kitchen in the back converts into a bar. \" Bitcoin is the most important technological innovation in any of our lifetimes, and it needs its due,\" said Parker Lewis, one of the stewards of the Commons and the author of a new book on bitcoin called \"Gradually, Then Suddenly.\" \"And so while bitcoin has no CEO and no marketing team, we here at the Bitcoin Commons and Bitcoiners all over the world help educate people about bitcoin, why it's important, what's being built, and present a vision for the future,\" continued Lewis. \"The vibe, it's always high signal,\" said Dan Lawrence, CEO of OBM, which manages energy use for industrial-scale mining farms. Lawrence said he was \"thankful\" that the U.S. government had become a little more pro-bitcoin under the new administration, but added, \"No matter what happens anywhere, everybody here is always going to bleed bitcoin.\" The \"Bitcoin Commons\" functions as a sort of clubhouse for the city's bitcoin believers. It puts on a mix of programming, including conferences and hackathons, as well as hosts a co-working space by day. CNBC This year, the Commons feels different — not because bitcoiners have changed, but because the world around them has. The mood is bullish. Strategic. Triumphant, even. Bitcoin 's price mirrored this optimism, surging to an all-time high of nearly $110,000 in January, coinciding with Trump's inauguration. By early April, it had retraced to the low $70,000s before rebounding to nearly $85,000 as of Saturday morning — volatility that underscores the market's sensitivity to political developments and investor sentiment. Just a year ago, the vibe in the Commons was cautious. Even bitcoin — the asset largely spared by securities law — felt the chill of an aggressive regulatory regime. Developers were being arrested around the world. Wallet providers were being pressured. Open-source projects landed on sanctions lists. The question then was, who would be next? Then came the election. Trump’s return to the White House brought with it a full-court press of pro-bitcoin policy moves . Within his first 100 days, he’d pardoned Silk Road founder Ross Ulbricht and three co-founders of the BitMEX crypto exchange , established a Strategic Bitcoin Reserve , and appointed a \"crypto czar\" to oversee the federal government’s digital asset efforts. Even skeptics found themselves nodding. \"I was in Nashville when Trump spoke,\" Suman recalled of the Bitcoin 2025 conference in Tennessee, where Trump made his first major address to the crypto industry. \"I wasn't planning on going. But you know, when someone like that is in town, you go see it.\" Suman says he feels Trump has delivered on his promises to the crypto community for the most part. Still, he remains cautious. \"I am not one who embraces politicians,\" Suman said. \"I'm kind of apolitical as far as which side. So I only trust them until I see how it's actually playing out in our life. So far, I think it's going well, but it could really change.\" Austin's \"Bitcoin Commons\" draws in an eclectic mix of people, including venture capitalists, bitcoin miners, and coders. CNBC Kevin Hurley, CTO at Lightspark, says Washington's stance toward crypto appears to be shifting, with regulators like the SEC taking a less combative approach — moving away from lawsuits and toward clearer capital markets rules . \"Hopefully now we're actually going to have some clarity on what is and what isn't a security, what can actually be done,\" he said. But even in a friendlier political climate, caution over government involvement remains a feature, not a bug, of the crypto community. Joe Kelly, CEO of Unchained — a startup that helps clients store bitcoin securely by holding their own private keys — said it's smart to be careful what you wish for when it comes to the U.S. government owning a lot of bitcoin. \"That can go other ways,\" he said. To date, the government's so-called Strategic Bitcoin Reserve has underwhelmed some digital asset advocates, since it's limited to bitcoin previously seized in enforcement actions — not newly purchased assets or sovereign investment. Still, the administration has directed the Treasury and Commerce Departments to explore budget-neutral ways to acquire more bitcoin. Kelly acknowledges a shift in the regulatory atmosphere, but he's also wary of premature celebration, even with big market wins like the launch of exchange-traded funds that allow investors widespread access to bitcoin. \"If something like the ETF had launched too soon, I think it could have distracted from the people building on the actual technology itself,\" Kelly said. \"We've had the fortune that for most of Unchained's life there wasn't an ETF,\" he added of the firm's efforts to educate investors on how to store their crypto. Becca Rubenfeld of Anchor Watch explains how federal shifts could allow bitcoin to be treated as an admitted asset by insurers — a potential breakthrough for institutional adoption. Rod Roudi/Bitcoin Commons The shift has had ripple effects across the industry, including insurance. Becca Rubenfeld, COO of Anchor Watch, says regulatory movement is opening the door for bitcoin to be treated like any other financial asset. Traditional insurers don't cover bitcoin directly — they insure the infrastructure around it. But if bitcoin becomes an admitted asset on insurance company balance sheets, that changes everything. \" Currently, the industry is extremely underserved,\" Rubenfeld told CNBC. \"But what Anchor Watch is doing is specifically insuring the asset itself. So we built a proprietary custody solution. And when customers use us for custody services, Lloyd's of London backed insurance is included in those services.\" The demand is growing. So is the pressure to build — and secure — the technical infrastructure that makes bitcoin work. Mike Schmidt of Brink discusses the critical need to support open-source developers who maintain bitcoin's core infrastructure. Rod Roudi/Bitcoin Commons Mike Schmidt, executive director of Brink, which funds open-source bitcoin developers through a nonprofit structure, emphasized the importance of supporting the engineers maintaining bitcoin's underlying infrastructure. \"Bitcoin needs engineers,\" he said. \"We have a $2 trillion asset. We have strategic reserves of bitcoin being held by countries, and there's just this small group of engineers that are keeping this thing together at the code base,\" Schmidt said. \"There's only maybe 40 full-time engineers working on this. So we want to make sure that the engineering growth can keep pace with its broader adoption.\" Lisa Neigut started as a back-end engineer at Cash App, where she worked on their internal bitcoin product, before moving to Blockstream and spending six years as an open-source developer on the Lightning Network. These days, she runs Bitcoin++, one of the largest technical conference series in the space, with six events planned across six countries this year. \"Bitcoin++ is focused on bringing together bitcoin developers and builders to talk about what they're working on — the frontier of bitcoin,\" Neigut said. \"You can get an idea of what bitcoin is going to look like tomorrow.\" That sense of momentum resonates with filmmaker Alana Mediavilla, who spent five years at Google working on films about big data and cloud infrastructure. She screened her new documentary, Dirty Coin, a feature-length project looking at bitcoin’s energy footprint and the people behind the infrastructure, at the Commons. Power supply for Whinstone's bitcoin mine in Rockdale, Texas. \"I had put in my time in the cloud space,\" she says. \"I understood what data centers were, I understood where it was going, and I also understood how much energy it takes to run these huge facilities that right now are running the backbone of our society.\" Her goal wasn't to necessarily defend bitcoin mining but to broaden the conversation. \"I just want to get everybody's data center literacy up to a certain point where we can continue to have conversations about it, because it's not going away.\" She describes the crowd in Austin as a coming together of people \"very committed to their craft\" — and in her view, driven more by shared ideals than by profit-seeking. \"People think that it's like a get-rich-quick,\" she said. \"Maybe those were the old days for bitcoin. Now, if you want 100x you should look at altcoins and meme coins and other stuff, but you're probably not going to get that with bitcoin.\" \"What brings them together is that they want to have better money, and they want to have a more fair world,\" she added. \"So the principles are solid. How we implement those principles — that's where the variety and spice of life comes in.\" Big money meets big ideas A surge of new funding is also reshaping bitcoin's builder economy. Venture investment in bitcoin-related startups soared in 2024 alongside the crypto market's rally. The number of pre-seed deals in the space climbed 50% last year, according to research from Trammell Venture Partners, an Austin-based VC firm focused on bitcoin-native startups. Across all early-stage funding rounds, nearly $1.2 billion has been invested in bitcoin companies since 2021. The renewed interest comes after years of technical upgrades to the bitcoin protocol and growing confidence in its long-term resilience. \"Serious people no longer question whether bitcoin will remain 15 or 20 years into the future,\" said Christopher Calicott, managing director at Trammell. \"So the next question becomes: Is it possible to build what the founder is trying to achieve on bitcoin? Increasingly, the answer is yes.\" PitchBook projects that crypto venture funding will surpass $18 billion in 2025 — nearly doubling the annual average from the previous two-year cycle. Much of that capital is flowing into bitcoin infrastructure and applications — payments, privacy tools, custody solutions — rather than the speculative trading platforms of previous cycles. Read more about tech and crypto from CNBC Pro This self-driving car technology stock could pop by more than 400%, say three analysts Looking for alternatives to Nvidia? Futurum CEO names 3 he's bullish on for 2024 Bernstein tech analyst's best idea for 2024 is to short Tesla Morgan Stanley picks 'alpha' opportunities in China tech - giving one 52% upside Turning ideals — and venture dollars — into reality still requires real-world infrastructure. And that's where entrepreneurs like Steve Barbour, the founder of Canadian firm Upstream Data, come in. He's spent years building off-grid mining containers for remote oilfields, but this spring, he's expanding operations into Wyoming, a bet he attributes directly to the Trump administration's rollback of energy regulations and renewed push for domestic production. Wyoming — home to both sprawling coal operations and some of the country's most permissive crypto laws — has emerged as a hub for bitcoin miners and the lawmakers who support them. The administration's latest executive orders loosen environmental restrictions and encourage more fossil fuel development — a boon for oilfield miners like Barbour, even as critics warn it could come at a steep climate cost. \"I'm extremely optimistic and bullish on Trump's administration,\" Barbour said. \"The EPA finally came out with a new stance on all these things they've been doing to just destroy the energy sector in America, which has affected us very negatively. I'm seeing a lot of things going the right way now with the decisions the Trump administration is making, and clearly they're trying to attract investment in America and manufacturing.\" Zaprite's Parker Lewis shares policy insights at the Commons, calling for federal legislation like the proposed Bitcoin Act to cement regulatory clarity. Rod Roudi/Bitcoin Commons Zaprite's Lewis, one of the Commons' most vocal policy thinkers, agrees that things are moving in the right direction — particularly around the government's decision to establish a formal national bitcoin reserve. While a crypto executive order is an important first step, \"codifying it with law will help drive further regulatory clarity that the U.S. is open for bitcoin,\" Lewis said. \"It will also be good for the country ... the biggest priority would be for the regulatory clarity piece, pushing Sen. Lummis' Bitcoin Act to codify and make permanent. \" Senator Lummis, a longtime advocate for the industry, is pushing legislation to codify bitcoin protections into federal law. Her proposed legislation outlines a plan for the U.S. to buy bitcoin with \"existing funds\" of the Treasury Department, which includes tax revenue. The idea, in part, is to position bitcoin as a strategic reserve asset — one that could appreciate over time and reduce reliance on debt. The senator has said that the ultimate goal is to reduce the federal deficit, as well as position bitcoin alongside gold and other hard assets as a way to strengthen the dollar over time. Without the Bitcoin Act becoming law, Lewis warns that today’s tailwinds could reverse with a single administration change. But while Washington debates bitcoin's role in the future of the U.S. economy, Suman was already betting his own on it. \"Why did I leave this really cushy job at Apple, where I was getting paid a lot and had stock and that kind of stuff, to come here, where my future is uncertain?\" he said. \"It's the possibility of building something new that I think is really needed in the world. And I hope that it pans out. ... If it doesn't, and we go down in a glory of fire, at least I will have tried something that I really believe in.\" Even after he accepted the offer to join Mutiny — later pivoting into Open Secret — things didn't calm down. \"That was right when a prominent group of developers were arrested,\" he recalled. \"They were developing an app called Samurai, and they got arrested. I had accepted my offer with Mutiny, but I had not yet left Apple.\" The gamble wasn't just career-based. It was emotional. Existential. \"Knowing that people were being arrested and there was a lot of uncertainty, I still dove in,\" he said. \"The guys said, 'Listen, if you're worried, we can just call this off and you can stay at Apple,'\" Suman recalled. \"But I said, 'No, I really believe in what we're building. Let's make this thing scale.'\" watch now VIDEO 5:31 05:31 Inside Austin's bitcoin underground Crypto World watch now watch now VIDEO 12:17 President Trump signs bill rolling back controversial Biden-era crypto tax rule: CNBC Crypto World Tanaya Macheel watch now watch now VIDEO 05:56 Former Apple and Cash App engineers flock to Austin as Trump embraces bitcoin MacKenzie Sigalos watch now watch now VIDEO 12:01 Kraken's Thomas Perfumo discusses bitcoin's shifting narrative Tanaya Macheel Read More", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://www.cnbc.com/2025/04/12/apple-google-cash-app-alums-ditch-big-tech-to-build-on-bitcoin.html", "source": "CNBC", "published_at": "2025-04-12T16:22:23"}, {"id": 38, "title": "Trump administration says some electronics will be excluded from reciprocal tariffs", "content": "Trump administration says some electronics will be excluded from reciprocal tariffs | PBS News", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.pbs.org/newshour/politics/trump-administration-says-some-electronics-will-be-excluded-from-reciprocal-tariffs", "source": "PBS", "published_at": "2025-04-12T16:21:29"}, {"id": 39, "title": "Olivia Munn Picks Black Pointed-Toe Shoes for New York Press Day", "content": "Olivia Munn Picks Black Pointed-Toe Pumps for 'Your Friends' Press Read Next: Teyana Taylor Laces Up Vans x Satoshi Nakamoto Pearlized Sneakers at Coachella’s Neon Carnival Subscribe Search Icon Close Open Menu Close Search Icon Open Search Search for: Search Icon Search for: Close Menu Follow Us Facebook Instagram LinkedIn Pinterest X YouTube Daily Newsletters Email address to subscribe to newsletter. Subscribe By providing your information, you agree to our Terms of Use and our Privacy Policy . We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. PMC Logo Footwear News is a part of Penske Media Corporation. © 2025 Fairchild Publishing, LLC. All Rights Reserved. FN and Footwear News are registered trademarks of Fairchild Publishing, LLC. Olivia Munn Picks Black Pointed-Toe Shoes for New York Press Day The shoes look like the Le Silla heels. By Mikelle Street Plus icon Mikelle Street More stories by Serena Williams Dons Black Dolce & Gabbana Keira Sandals for Wyn Beauty Pop-Up Read more Olivia Munn Picks Black Pointed-Toe Shoes for New York Press Day Read more Tyla, Becky G Get Wild in Animal Print Boots at 2025 Joint Coachella Performance Read more April 12, 2025 12:17 pm Olivia Munn is seen in Midtown on April 11, 2025 in New York City. The Hapa Blonde/GC Images Share Share on Facebook Post Share to Flipboard Pin it Show more sharing options Post to Tumblr Submit to Reddit Share on LinkedIn Share on WhatsApp Email Print This Page Olivia Munn is returning to her acting career. The performer is starring in a new Apple+ series named “Your Friends & Neighbors.” Munn stars opposite Jon Hamm. This week, she’s been in New York City doing press for the project. Styled by Yael Quint, Munn wore a wool over coat and tan wide leg trousers. The actress also carried a black leather clutch. Olivia Munn is seen in Midtown on April 11, 2025 in New York City. GC Images For shoes, Munn wore a pair of black pump shoes. The shoes are sharply pointed. In addition, they include a low-cut rounded vamp. The cut ensures that there is a bit of toe cleavage.The shoe is a single sole style and includes a tall thin stiletto. The stiletto is round and appears to be about four inches. Related Stories Tyla Flatters Her Feet in Glossy Le Silla Belen Sandals at the H&M&LA Music Festival Ryan Destiny Is Best Dressed at Fashion Trust U.S. Awards in Plunging Schiaparelli Gown & Gold Le Silla Pumps While it’s not exactly clear what brand the shoe is, it looks similar to the Le Silla Bella heel. That style contains all the same details including a pointed toe and a rounded vamp. The stiletto measures 4.7 inches which is the same height as the Christian Louboutin So Kate — Munn is not wearing the So Kate as the sole is not red. People often refer to single-sole stiletto styles at this height has uncomfortable because of the pitch they require. The pitch of a heel is the degree of incline the foot is positioned in. Watch on FN Olivia Munn is seen in Midtown on April 11, 2025 in New York City. GC Images Many brands have their own black patent leather pump shoes. There’s Le Silla but other companies include Celine , Schutz, Balenciaga, Jimmy Choo and the aforementioned Louboutin amongst others. Amongst the design tweaks, some brands create distinctive heel shapes while others adjust the vamp in various ways. Over the last few years, making the silhouette sharper and more angular has been popular. Black pointed-toe pumps are extremely popular. They are often seen as one of the most versatile heels in a woman’s closet. Available in a variety of heights, the shoe can serve wearers from jeans and t-shirt looks to glamorous fashion gowns. They range in price as they are offered by labels at all levels. Nicole Kidman, A’ja Wilson, Olivia Munn and More at the 2025 Time Women of the Year Gala [PHOTOS] View Gallery 12 Images Daily Headlines Subscribe More from Footwear News Fashion Teyana Taylor Laces Up Vans x Satoshi Nakamoto Pearlized Sneakers at Coachella’s Neon Carnival Fashion ‘Coachella Queen’ Paris Hilton Dons Patent Leather Givenchy Shark Lock Biker Boots at Neon Carnival Fashion Julia Fox Heads to Coachella in Rustic Knwls Hellz Knee-High Booties at ‘The Overcompensating House’ Fashion Meagan Good Dons Green Cutout Dress and Brown Lace Up Sandal Heels for NBCU Emmy Luncheon Fashion Serena Williams Dons Black Dolce & Gabbana Keira Sandals for Wyn Beauty Pop-Up Fashion Tyla, Becky G Get Wild in Animal Print Boots at 2025 Joint Coachella Performance Shopping with FN Shop The 10 Best Winter Sneakers That Keep Feet Warm and Dry in Harsh Weather Shop The Latest adidas Fear of God Athletics Basketball Sneakers Are Out Now — Here’s Why We’re Wearing Them On and Off the Court. Shop 10 adidas Gifts Our Shoe Editors Are Giving This Year Daily Headlines Email address to subscribe to newsletter. Subscribe By providing your information, you agree to our Terms of Use and our Privacy Policy . We use vendors that may also process your information to help provide our services. This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Most Popular Business A$AP Rocky x Puma Scores Coveted FNAA Collaboration of the Year Award Business Everyone Is Buzzing About Trump’s China Tariffs: Here’s How Under Armour, Wolverine, Steve Madden and Tapestry Are Preparing for 2025 Business More FNAA 2024 Winners Revealed: New Balance, Bjorn Gulden, Plus Other Standouts Get the Latest Issue Only $24.99 for one year! SUBSCRIBE More From FN Shoes Michael Jordan’s First-Ever ‘Pure Money’ Air Jordan 3 Reissue Will Be Released This Summer Shoes Bo Jackson’s Iconic Nike Air Trainer SC Sneaker Is Coming Back in Time for Summer PMC Logo Most Popular 1. Noah Wyle Was Nearing a 'Nervous Breakdown.' Then Came 'The Pitt': It's 'Infuriating We Can't Come to a Consensus' on Masks and Vaccines 2. The White Lotus Stars Aimee Lou Wood & Walton Goggins' Real-Life Relationship Is Raising Eyebrows 3. Toni Braxton Reportedly Married Birdman Last Year...And Filed For Divorce Days Later 4. Monumental Ruins Emerge Following Massive Myanmar Earthquake You may also like Brewers Navigate Life on the Edge, on and off the Field wwd Lori Harvey’s Latest Canadian Tuxedo Look at Pre-Coachella Party Is All About the Accessories: Vintage Chanel Necklace and More Luxury Items Jenna Dewan Reveals It ‘Meant Everything’ to Have Daughter Evie See This Moment at Coachella 2025 Loose Threads: Ralph Lauren, Levi’s and Blaumann Jeanshosen PMC Logo Footwear News is a part of Penske Media Corporation. © 2025 Fairchild Publishing, LLC. All Rights Reserved. FN and Footwear News are registered trademarks of Fairchild Publishing, LLC. Our Sites ad", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "http://footwearnews.com/fashion/celebrity-style/olivia-munn-black-pointed-toe-shoes-new-york-city-press-1234798578/", "source": "Footwear News", "published_at": "2025-04-12T16:17:02"}, {"id": 40, "title": "Next Godzilla x Kong Sequel Film Casts Alycia Debnam-Carey", "content": "Next Godzilla x Kong Sequel Film Casts Alycia Debnam-Carey - News - Anime News Network USA & Canada World USA & Canada Australia & New-Zealand India Southeast Asia Français Login forgot it? remember me or Login with Facebook Login with Twitter Register No account yet? Registering is free , easy , and private . Discuss in the forum, contribute to the Encyclopedia, build your own MyAnime lists, and more. × anywhere on the site in the encyclopedia in the forums × remind me tomorrow remind me next week never remind me Subscribe to the ANN Newsletter • Wake up every Sunday to a curated list of ANN's most interesting posts of the week. read more News Next Godzilla x Kong Sequel Film Casts Alycia Debnam-Carey posted on 2025-04-12 12:15 EDT by Adriana Hazra Debnam-Carey joins other new cast Matthew Modine, Kaitlyn Dever, Jack O'Connell, Delroy Lindo Image via Godzilla x Kong: The New Empire website © 2024 WARNER BROS. ENT. ALL RIGHTS RESERVED. GODZILLA TM & © TOHO CO., LTD. Entertainment news website Deadline reported on Wednesday that Alycia Debnam-Carey ( Apple Cider Vinegar ) will join the cast of the planned sequel to Godzilla x Kong: The New Empire , the newest part of Warner Bros. and Legendary Entertainment 's \"Monsterverse\" franchise . The most recently reported addition to the cast is Matthew Modine ( Oppenheimer , Stranger Things , Hard Miles , Zero Day ). The film also cast actress Kaitlyn Dever ( Dopesick, Booksmart , upcoming The Last of Us second season) and Jack O'Connell ( Unbroken , Ferrari ), who will play the brother of Dever's character. The Hollywood Reporter adds that Dan Stevens is returning from Godzilla x Kong: The New Empire as the monster veterinarian Trapper, and also reported that Delroy Lindo ( Get Shorty , Gone in 60 Seconds , upcoming Sinners film) is joining the cast. Lindo will reportedly play the boss of Dever's character. Grant Sputore ( I Am Mother ) will direct the film. Godzilla x Kong: The New Empire opened in the United States in March 2024. The film earned US$80 million in its opening weekend in the U.S., topping the box office for the weekend. The film opened in Japan in April 2024, and debuted at #2 in the box office. The film sold 306,000 tickets and earned 466,704,060 yen (about US$2.97 million in current conversion) in its first four days (the film opened on a long weekend). Godzilla x Kong: The New Empire is the highest-grossing movie in Warner Bros. and Legendary Entertainment 's \"Monsterverse\" series, with US$570 million earnings worldwide, beating the 2017 film Kong: Skull Island , which earned US$568.8 million. The film's domestic and international earnings are at US$196.3 million and US$373.7 million, respectively. The film is the highest-grossing \"Monsterverse\" title in 35 markets including Brazil, Colombia, France, India, Indonesia, Mexico, and the United Arab Emirates (UAE). The \"Monsterverse\" Hollywood franchise currently includes the 2014 Godzilla film, the 2017 Kong: Skull Island film, the 2019 Godzilla: King of the Monsters film, the 2021 Godzilla vs. Kong film, and Godzilla x Kong: The New Empire . The franchise also includes Monarch: Legacy of Monsters , Legendary Entertainment 's series featuring \"Godzilla and the Titans.\" The series debuted worldwide on Apple TV+ in November 2023, and will have a second season. Source: Deadline (Anthony D'Alessandro) discuss this in the forum (1 post) | bookmark/share with: News homepage / archives ⬈ ⬋ - + review Unnamed Memory Act.2 Anime Series Review Apr 13, 12:00 anime A rushed plotline and frenetic pacing barely leave you with a memory of this show worth naming. ― Many great fairy tales treat love as something no magical curse, giant tower, or fire-breathing dragon can tear apart. In worlds occupied by fairies and magic, love is the most real part of any fantasy; a passionate force that conquers all. Unnamed Memory Act 2 follows that precedent by having its leadin... review 9 comments Teppu Volume 1 Manga Review Apr 12, 12:00 9 comments manga Moare Ohta’s Teppu is a bonafide cult sensation, but is this print-on-demand release punching under its weight? ― In early December, Kodansha USA announced the establishment of their Kodansha Print Club program—a print-on-demand service that gives select digital-only titles the chance to shine in print. The publisher capped off this news by revealing the program's first trio of titles—Narumi Shigemat... news 45 comments Science Saru's The Ghost in the Shell TV Anime Reveals New Teaser Video, Main Staff Apr 11, 21:00 45 comments anime Moko-chan directs anime with scripts by Toh Enjoe ― Bandai Namco Filmworks revealed a new trailer and the main staff on Saturday for Science Saru's new Ghost in the Shell television anime series that is slated to debut in 2026. The new anime is titled Kōkaku Kidōtai The Ghost in the Shell (the English title is The Ghost in the Shell ). Moko-chan (storyboarder, key animator for DAN DA DAN, The Heike St... news 2 comments Tenkaichi: The Greatest Warrior Under the Rising Sun Manga Gets TV Anime Apr 11, 20:51 2 comments anime Kyōtarō Azuma, Yōsuke Nakamaru's alternate history of warriors battling to rule Japan ― The official X (formerly Twitter) account for artist Kyōtarō Azuma and author Yōsuke Nakamaru's Tenkaichi: The Greatest Warrior Under the Rising Sun (Tenkaichi: Nihon Saikyō Bugeisha Ketteisen) manga announced on Friday that the manga is receiving a television anime. 【祝❗️TVアニメ化‼️】テンカイチがアニメになります！！生き生きと動くキャラクター達と、躍動... feature 292 comments The Spring 2025 Anime Preview Guide Apr 11, 13:25 292 comments anime The spring anime season premieres are wrapping up. Read all our reviews and make sure to vote for your favorites in the Daily Streaming poll! ― Welcome to Anime News Network's Spring 2025 Anime Preview Guide! Here's how it goes: our team of critics writes up their impressions instantly, to be posted here as they go along. Each critic will cover as many shows as they can handle, giving you alternate ... review 8 comments Headhunted to Another World: From Salaryman to Big Four! Anime Series Review Apr 11, 12:00 8 comments anime It’s almost frustrating how easily this series could've been a comedic subversion of all things isekai and salaryman life, but it just isn’t. ― Especially relative to many of the other titles in the deluge of isekai anime we've gotten in the past few years, Headhunted to Another World: From Salaryman to Big Four! (henceforth Headhunted), sounds on paper like it should be such a fun series. I mean, Ju... column 15 comments This Week in Games - Space Snakes, Samurai Dates, and Tekken Patch Woes Apr 11, 10:00 15 comments games Hakuoki fans get a pleasant surprise while Tekken players are a little less lucky. Plus the unexpected return of an 80s classic character! ― Welcome back, folks! I wanted to take a moment to thank people for the warm reception to the interview with Story of Seasons ' series director Hikaru Nakano in last week's column. I was quite worried it would get overshadowed by the bigger news that week. Nakano ... survey Choose Your Anime Daily Streaming Reviews: Spring 2025 Apr 11, 09:00 anime Vote this weekend, and come back on Monday for the results! What anime do you want reviewed this season? column 18 comments This Week in Anime - GQUUUUUUX!!! Apr 10, 13:00 18 comments anime In a promising season, Mobile Suit Gundam GQuuuuuuX is a frontrunner. All eyes are on its stacked staff of anime luminaries, from Hideaki Anno to Kazuya Tsurumaki. Did its TV debut deliver the goods? ― In a promising season, Mobile Suit Gundam GQuuuuuuX is a frontrunner. All eyes are on its stacked staff of anime luminaries, from Hideaki Anno to Kazuya Tsurumaki. Did its TV debut deliver the goods? ... review 3 comments My Secretly Hot Husband Volume 1 K-Comic Review Apr 10, 12:00 3 comments korean The combination of “reborn in a fantasy world” with Beauty and the Beast works better than you might expect. ― You know the story: a person dies in modern Korea and is reborn in a fantasy world with their memories intact. Or maybe you know this story: a man's life is saved by a hideous beast and he's forced to promise one of his daughters to the monster in exchange. My Secretly Hot Husband is what ha... news 16 comments Date A Live Gets New Anime Project Apr 10, 10:23 16 comments anime Visuals unveiled for 12th anniversary ― Kadokawa announced on Thursday that the Date A Live series is getting a new anime project. The staff shared a visual to tease the project: The company also unveiled a visual for the anime's 12th anniversary, featuring the characters in summer dresses: There is also an event at the sixth floor of Volks Akihabara Hobby Paradise 2 from April 24-May 11 for the anni... column The ANN Aftershow - Shin's Sad Backstory Revealed in Sakamoto Days Apr 9, 21:00 anime Sakamoto Days wraps up a mini-arc all about Shin and the secret behind his psychic powers. There's also a new conspiracy cooking in Apothecary Diaries when the Empress Dowager asks Maomao for a favor! ― Shin's Sad Backstory Revealed in Sakamoto Days Sakamoto Days wraps up a mini-arc all about Shin and the secret behind his psychic powers. There's also a new conspiracy cooking in Apothecary Diaries w... All material Copyright © Anime News Network LLC. All rights reserved. served by mayu-chan Report a Problem × News Convention reports Newsfeed Interest Press Releases Views Features Reviews Columns New Anime Your Score for Recent Simulcasts Upcoming Anime List Upcoming DVD & Blu-ray Weekly Rankings Spring 2025 Preview Guide Daily Streaming Reviews Encyclopedia Forum My ANN Subscribe » My Anime My Manga Newsletter ANN:Connect About Our Team Contact us Staff openings Privacy policy Copyright policy Advertise with ANN FAQ Report a Problem Bugs & Technical Questions Forum", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.animenewsnetwork.com/news/2025-04-12/next-godzilla-x-kong-sequel-film-casts-alycia-debnam-carey/.223441", "source": "Anime News Network", "published_at": "2025-04-12T16:15:00"}], "timeline": [{"date": "2025-04-12T16:22:23", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T16:25:20", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T16:26:00", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T16:27:00", "score": 0.9, "sentiment": "POSITIVE"}, {"date": "2025-04-12T16:44:02", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T16:44:56", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:45:00", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T16:49:37", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:56:21", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:59:52", "score": 0.6, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:01:02", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:02:00", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:09:43", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:11:50", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:17:30", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:19:54", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:20:07", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:20:21", "score": 0.7, "sentiment": "POSITIVE"}]}