{"company": {"id": 1, "name": "Tesla", "aliases": ["TSLA", "Tesla Inc"]}, "stats": {"POSITIVE": 0, "NEGATIVE": 1, "NEUTRAL": 0, "TOTAL": 1, "AVG_SCORE": -0.7}, "mentions": [{"id": 0, "title": "The One Thing That Brought Trump Close to Reality This Week", "content": "Trump tariff pause: This week we learned there’s one thing that will make Trump rethink his plans, but it’s certainly not enough. Tweet Share Share Comment Photo illustration by Slate. Photo by Getty Images Plus. Sign up for the Surge , the newsletter that covers most important political nonsense of the week, delivered to your inbox every Saturday. Welcome to this week’s edition of the Surge, a newsletter about all things politics in the United States, a place that can now be considered an emerging market country. Hey, here’s some news: Your money is gone, forever. It’s called the “Art of the Deal.” At least we’ve still got Medicaid for bare-bones health ca—oops, maybe not? What a week for the American pocketbook. Democrats’ crippling addiction to nuance, meanwhile, is preventing some of them from saying the very easy sentence “Trump killed the economy.” And for ulcer-related reasons, we’re not even touching the court cases involving the Trump administration’s arbitrary kidnappings—read the Slate legal people for that. Much is going on. Can anyone—or any … thing—stop it? 1. The bond market If there’s anything that can get through to Trump … Last week, Donald Trump set in place a tariff plan that, if carried through, would at least cause a recession and at most put an end to our American-led economic and international order. He then played golf four days in a row. (Respect.) He and his team didn’t necessarily mind the stock market going down 10 or 15 percent—supposedly that would be the temporary pain. The more worrisome sign came when the bond market began to careen off the edge. One particular red alert was how the yield on 10-year Treasurys was shooting directly up, when typically, they should be a safe haven for investors in bear markets. That’s one of those existential signs that the rest of the world is thinking about moving on from you. Trump’s advisers publicly denied that the bond market had anything to do with the Wednesday decision to issue a 90-day “pause” on reciprocal tariffs. Privately, though, they said that was exactly the reason for the climb-down, and Trump himself conceded that markets were getting a little too “yippy” for his taste. Unfortunately, we’re afraid Trump needs to take another look at the bond market. Despite a one-day stock market rally after Trump’s “pause”—which still left tariffs at their highest levels in 100 years—everything resumed crashing by Thursday, with stocks and the dollar down and Treasury yields skyrocketing back up. This is the financial equivalent of someone (in this case, all other countries) breaking up with you via text. We know what we did. Advertisement Advertisement Advertisement Advertisement 2. Scott Bessent This goes well beyond positive reinforcement. We’re still shocked by the spin that Bessent and these other dorks have been issuing since the “pause” to claim that everything is going according to plan. What really happened here is that Trump, who thinks that tariffs are a direct tax that the U.S. puts on other countries, did something impossibly reckless, because he could, and then had to begin walking it back. But his deputies have been tasked with conveying these actions as if he had just played the world. “No one creates leverage for himself like POTUS,” Bessent posted. Commerce Secretary Howard “Good Times” Lutnick, sharing a screenshot of Trump’s Truth Social post announcing the pause, wrote about how he and Bessent sat beside Trump as he drafted “one of the most extraordinary Truth posts of his Presidency.” White House policy chief Stephen Miller wrote that “you have been watching the greatest economic master strategy from an American President in history.” The only thing more head-spinning than some of these lines is that there’s an audience that will believe it. 3. Mike Johnson Never a doubt. It was the House’s turn this week to pass the compromise budget blueprint that the Senate passed last week, providing the skeletal structure for—and finally allowing them to start real work on—Trump’s “one big, beautiful bill.” To recap, the “compromise” that GOP leaders of both chambers struck was that they will make the difficult decisions later: The House would write a bill with bigger spending cuts, the Senate would write a bill with fewer, and they’d come to some icky agreement irritating everyone in the end. (This could take several more months.) House conservatives, though, didn’t like this. They wanted to straitjacket the Senate into big spending cuts now. And so we had another situation this week in which 10 or 20 House conservatives said they would never, ever, ever vote for this blueprint. The ins and outs weren’t really worth paying attention to, because the holdouts’ posture presented three options: First, they could’ve voted to kill the blueprint, and with it, Trump’s agenda (they didn’t). Second, they could’ve tried to negotiate again with the Senate on the blueprint, reopening talks on this never-ending first step just before both chambers went into a two-week recess (they would never). Third, the House conservatives could claim they got some “assurances”—say, the speaker putting his job on the line —about how spending cuts would definitely come later, vote to move the process along, and avoid Trump’s wrath. That last option was always the only plausible one. The House passed the blueprint Thursday morning. Now it’s time for them to write the bill. Plus vulnerable House Republicans have locked themselves into voting for a bill with hundreds of billions of dollars in Medicaid cuts! Wishing everyone a good time. Advertisement Advertisement Advertisement Advertisement 4. Elon Musk and Peter Navarro The grand debates of towering statesmen. We haven’t heard much from Elon Musk of late. That’s partially because of how in the previous week, he made a Wisconsin judicial election a referendum on himself and biffed it. The day after that election, though, was “Liberation Day,” and the silence of Musk—the richest businessman in history, whose companies do a lot of international commerce—was revealing. It also didn’t last. Before long, Musk was sniping on social media at Peter Navarro, Trump’s top trade adviser and the devil on Trump’s shoulder urging on aggressive tariffs. He posted early last Saturday that Navarro’s Ph.D. from Harvard was “a bad thing, not a good thing,” and that Navarro “ain’t built shit.” Navarro responded in an interview a couple of days later that Musk was merely a “car assembler,” not a manufacturer, who imported Tesla parts from around the world. That really set Musk off. He called Navarro a “moron” and “dumber than a sack of bricks.” In the latter post, he tagged the account “@IfindRetards,” and ultimately, he referred to Navarro as “Peter Retarrdo.” All very interesting stuff. It’s worth emphasizing that these are two of the closest advisers to the president of the United States. Advertisement 5. Ken Paxton A big, expensive, stupid primary. Texas Attorney General Ken Paxton, a MAGA showman who led a lawsuit to overturn the 2020 election and had also been impeached, though not convicted, by the state Legislature after nearly a decade of criminal investigations, announced a long-awaited primary challenge to Sen. John Cornyn this week. The dynamic is simple enough to understand: Paxton sees an opening to outflank Cornyn on craziness, as Cornyn is a normal human being who occasionally works to pass bipartisan legislation or expresses disapproval of some of Trump’s actions. The two don’t hide their despair of each other. Cornyn this week described Paxton as “a con man and a fraud,” and added that “I am not going to turn over the Senate seat that was once held by Sam Houston to someone like him.” The only thing motivating Paxton, Cornyn said, is “vanity and personal ambition.” This primary is going to be expensive and nasty at every turn. Regrettably, it’s also going to force Cornyn, the sort of GOP senator you’d like to have as even a modest check on Trump here or there, to behave like a caveman for the next year. Exhibit A: In March, Cornyn posted a photo of himself pretending to read The Art of the Deal in the kitchen with the caption “Recommended.” Advertisement Advertisement Advertisement Advertisement 6. Gretchen Whitmer A big, expensive, stupid primary. The adorable Democrats who still think there’s going to be a presidential election in 2028 for them to run in were circling each other this week as they responded to Trump’s tariffs. The skirmish began on Wednesday, when Michigan Gov. Gretchen Whitmer offered a nuanced criticism of the trade war. She said she understood “the motivation behind the tariffs,” but that “you can’t just pull out the tariff hammer and swing at every problem without a clear, defined end goal.” When asked how she would have enacted them differently, though, she said “I don’t know” and “I haven’t really thought about that.” Now, sure: The politics of trade are sensitive in a state like Michigan. But since she is a prospective 2028 candidate, potential Democratic primary opponents took the opportunity to differentiate themselves. Pennsylvania Gov. Josh Shapiro—who also represents a state hit hard by free trade agreements— gave a much more blunt critique of the tariffs, accusing Trump of “threatening economic calamity,” “upending world markets,” “harming seniors” and “isolating America in the world.” Illinois Gov. J.B. Pritzker called the tariffs “Trump’s Tax on Working Families.” And Colorado Gov. Jared Polis responded directly to Whitmer, posting that “the ‘tariff hammer’ winds up hitting your own hand rather than the nail.” This wasn’t the only punishment Whitmer endured this week, though. She also met Trump in D.C. and was roped into an Oval Office press conference where Trump said she’d “really done an excellent job.” Then Trump proceeded to sign a few authoritarian executive orders, forcing Whitmer to issue a clarifying statement saying that she had no idea that was going to happen. About those executive orders … Advertisement 7. Chris Krebs Advertisement Advertisement Advertisement The executive orders are not getting more sane! Popular in News & Politics The One Thing That Brought Trump Close to Reality This Week This Content is Available for Slate Plus members only The Supreme Court’s Latest Trump Compromise Is Making the Justices Look Like Chumps This Content is Available for Slate Plus members only Everyone Who Could Have Stood Up to Donald Trump Has Failed. Except, Maybe, for the Most Unlikely One of All. This Content is Available for Slate Plus members only Trump’s Tariff Chaos Could Give Him a Surprising Problem at the Supreme Court We’re going to start with a very low bar here. At least President Trump’s most egregious, strongman-like executive orders seeking retribution have been targeting institutions. You know, universities, Big Law, what have you. Not anymore! Now he’s now going directly after individuals. On Wednesday, he released two executive orders “addressing risks” against Trump 1–era officials who disobeyed him. The first is against Chris Krebs, the former head of the Cybersecurity and Infrastructure Security Agency, whom Trump fired following the 2020 election for assuring the public that it was conducted securely. “Krebs, through CISA, falsely and baselessly denied that the 2020 election was rigged and stolen,” this actual memorandum from the president reads. The order doesn’t just strip Krebs of any security clearances (child’s play). It calls on the attorney general and homeland security secretaries to investigate him and report their findings to the president. A similar order was issued against Miles Taylor, the former Department of Homeland Security chief of staff who wrote a much-discussed anonymous column for the New York Times in 2018 titled “I Am Part of the Resistance Inside the Trump Administration.” On the law-firm front, even those decrees are getting more baseless—and why not? It’s working! —as Trump issued new sanctions on the firm that represented Dominion Voting Systems in its successful legal action against the muppets who defamed them. He also signed another order “Maintaining Acceptable Water Pressure in Showerheads,” which is probably a lot better. Or it’s bad. We don’t know—he signed a lot of executive orders this week to distract from how he had collapsed the economy. Get the best of news and politics Sign up for Slate’s evening newsletter. Thanks for signing up! You can manage your newsletter subscriptions at any time. You're already subscribed to the The Slatest newsletter. You can manage your newsletter subscriptions at any time. We encountered an issue signing you up. Please try again, or manage all your newsletter subscriptions here . Please enable javascript to sign up for newsletters. Email address: Send me updates about Slate special offers. By signing up, you agree to our Privacy Policy and Terms . Sign Up Tweet Share Share Comment Donald Trump Economy Elon Musk Stock Market The Surge Advertisement Advertisement Advertisement", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slate.com/news-and-politics/2025/04/trump-tariffs-pause-markets-still-bad.html", "source": "Slate Magazine", "published_at": "2025-04-12T09:45:00"}], "timeline": [{"date": "2025-04-12T09:45:00", "score": -0.7, "sentiment": "NEGATIVE"}]}