{"company": {"id": 2, "name": "Apple", "aliases": ["AAPL", "Apple Inc"]}, "stats": {"POSITIVE": 4, "NEGATIVE": 1, "NEUTRAL": 5, "TOTAL": 10, "AVG_SCORE": 0.25}, "mentions": [{"id": 13, "title": "For Health Apps, Questions Over Privacy and Efficacy", "content": "For Health Apps, Questions Over Privacy and Efficacy | naked capitalism Menu Home About Archives Bloggers Policies Documents Limited Partnership Agreements Contact Recent Items AI-Generated Images Can Exploit How Your Mind Works − Here’s Why They Fool You and How to Spot Them - 04/13/2025 - Conor Gallagher Links 4/12/2025 - 04/12/2025 - Yves Smith Trade in the Time of Trump - 04/12/2025 - Yves Smith For Health Apps, Questions Over Privacy and Efficacy - 04/12/2025 - Yves Smith US-Iran Negotiations: Why an Agreement Looks Unlikely - 04/11/2025 - Yves Smith Links 4/11/2025 - 04/11/2025 - Conor Gallagher Is the Trump Administration Mad Enough to Launch Drone Attacks Against Mexico? - 04/11/2025 - Nick Corbishley More Trump Punishment of the Poors: HHS Eliminates Office That Sets Poverty Levels Tied to Benefits for 80 Million People - 04/11/2025 - Yves Smith International Trade Suppression and the Demand for US Treasuries - 04/11/2025 - Yves Smith", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.nakedcapitalism.com/2025/04/for-health-apps-questions-over-privacy-and-efficacy.html", "source": "Nakedcapitalism.com", "published_at": "2025-04-12T10:08:28"}, {"id": 14, "title": "5 warning signs that your phone's been hacked - and how to fight back", "content": "5 warning signs that your phone's been hacked - and how to fight back | ZDNET X Tech Home Tech Security 5 warning signs that your phone's been hacked - and how to fight back Here are the biggest warning signs that your phone may be compromised and the secret codes that can tell you all about it. Written by Lance Whitney, Contributor April 12, 2025 at 3:00 a.m. PT Apple / Elyse Betters Picaro / ZDNET Your mobile phone is a treasure trove of personal and confidential information. That's why it's a prime target for hackers who want to compromise or steal your data. Through malicious apps and websites, phishing attacks, and other threats, an attacker can gain control of your device through spyware. But how can you tell if your phone has been hacked or tapped? Also: Biometrics vs. passcodes: What lawyers recommend if you're worried about warrantless phone searches Amy Clark, managing editor of consumer reviews site Techreport, has put together a helpful guide on the threat of phone hacking. The guide shares advice on how to tell if your phone may have been hacked and how to fight back against the hacker. Warning signs of a phone hack 1. Battery drains more quickly than usual . Any spyware installed on your phone is constantly running to snoop on your activity and send the data to the hacker. This means that your battery is going to drain faster than usual. Be aware of any unusual drops in your battery charge. Check your phone's battery settings to see if the level is falling more dramatically. 2. Your phone is running more slowly . Does your phone feel more sluggish than usual, or are apps crashing or freezing? Those could be signs that someone has hacked into your device. Keep track of how long it takes to launch apps or carry out other actions to gauge if the performance is lagging. 3. Unfamiliar logins . Social media sites will sometimes alert you if they detect an unusual login attempt, such as one from an odd time of day or a faraway location. A notice like this could indicate that someone has gained control of your mobile device and is trying to sign in with your account credentials. In that event, make sure you change the password for the affected account. 4. Available storage space has dropped . Even though spyware isn't visible, it does chew up storage on your phone. If you think you've lost free space, check your used storage under settings. Assuming you haven't installed any apps or added content recently, see if the amount of used space is higher than when you last checked. 5. Apps you didn't install . If you do spot an app that you don't remember installing, a hacker could be responsible. Review all the installed apps on your phone for any you don't recognize and remove them. How to combat a hack If you believe your phone has been hacked or tapped, how can you fight back? One inventive suggestion from Clark is to use a USSD code. Typically offered by your mobile carrier, USSD (Unstructured Supplementary Service Data) codes are short series of numbers that you can enter on your phone's keypad to check your payment balance, troubleshoot technical problems, and access special features. Even better, certain USSD codes can tell you if your calls are being redirected to a different phone number, a sign that your device has been hacked. Other codes can then stop the redirection. Also: 5 ways to avoid spyware disguised as legit apps - before it's too late As Clark explains, there are two types of call forwarding: conditional and unconditional. Conditional forwarding occurs when a certain condition is met, such as not answering the call or turning off your phone. Unconditional forwarding occurs regardless of the status of your phone. Using a USSD code is easy. Just open the Phone app on your phone, select the keypad, and enter the code. You may also have to press the Call button. Here are several helpful USSD codes recommended by Clark. *#06# - This code displays your phone's unique IMEI (International Mobile Equipment Identity) number. You'll need this code if you think your phone has been hacked and you want to file a report with your carrier or even the police. *#61# - This code will tell you if your missed calls are getting redirected to a different number, a sign of conditional forwarding. The information will indicate whether call forwarding or SMS forwarding is enabled and show you the receiving number. If so, this means that all missed calls and texts are being forwarded to the other number. ##61# - This code disables missed call forwarding. If you find that your calls are being redirected to another number, just enter this code to turn off call forwarding. Afterward, dial *#61# to confirm that the call forwarding has been turned off. I tried this code on one of my test Android phones that did have call forwarding enabled, and it successfully disabled it. *#62# - This code tells you if calls are being redirected when your phone is turned off or has no signal, another sign of conditional forwarding. You'll also see the number receiving your calls. ##62# - This code disables call forwarding if your phone is turned off or has no signal. *#21# - This code indicates if your calls are being unconditionally forwarded in all circumstances so that all calls are redirected. ##21# - This code disables unconditional forwarding. If you have to use this code, contact your mobile carrier to find out if they're aware of any suspicious activity associated with your phone's SIM. *#004# - This code displays all the call redirection settings on your device. The information includes all incoming calls, voicemail, and SMS messages and reveals if they're being redirected and to what number. This code is a handy catch-all as it covers both conditional and unconditional forwarding. ##002# - This code will disable all conditional and unconditional forwarding. Use this one to turn off everything, especially if some call forwarding is still active after you've tried the other codes. *2767*3855# or *#*#7780#*#* - Either of these codes will revert your phone back to factory conditions but they work only with Android devices. If you suspect that your phone is infected with malware or spyware, resetting your phone this way can erase the threat. Also: Why rebooting your phone daily is your best defense against zero-click attacks You can also manually reset an iPhone or Android phone. On an iPhone, go to Settings, select General, and then tap Transfer or Reset iPhone. At the next screen, choose the option for \"Erase All Content and Settings\" and follow the steps to reset your phone. On an Android phone, go to Settings, look for Reset Options or a similar setting, and then follow the steps to run a factory reset. Stay ahead of security news with Tech Today , delivered to your inbox every morning. Security How AI agents help hackers steal your confidential data - and what to do about it This new tool lets you see how much of your data is exposed online - and it's free How a researcher with no malware-coding skills tricked AI into creating Chrome infostealers That weird CAPTCHA could be a malware trap - here's how to protect yourself How AI agents help hackers steal your confidential data - and what to do about it This new tool lets you see how much of your data is exposed online - and it's free How a researcher with no malware-coding skills tricked AI into creating Chrome infostealers That weird CAPTCHA could be a malware trap - here's how to protect yourself Editorial standards Show Comments Log In to Comment Community Guidelines Related I changed 12 Android phone settings to dramatically increase battery life (and why they work) I clicked on four sneaky online scams on purpose - to show you how they work 5 simple ways to regain your data privacy online - starting today", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.zdnet.com/article/5-warning-signs-that-your-phones-been-hacked-and-how-to-fight-back/", "source": "ZDNet", "published_at": "2025-04-12T10:00:18"}, {"id": 15, "title": "I swapped my Windows laptop for a MacBook Air M4, and finally understand the hype", "content": "I swapped my Windows laptop for a MacBook Air M4, and finally understand the hype | ZDNET X Tech Why you can trust ZDNET : ZDNET independently tests and researches products to bring you our best recommendations and advice. When you buy through our links, we may earn a commission. Our process 'ZDNET Recommends': What exactly does it mean? ZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other relevant and independent reviews sites. And we pore over customer reviews to find out what matters to real people who already own and use the products and services we’re assessing. When you click through from our site to a retailer and buy a product or service, we may earn affiliate commissions. This helps support our work, but does not affect what we cover or how, and it does not affect the price you pay. Neither ZDNET nor the author are compensated for these independent reviews. Indeed, we follow strict guidelines that ensure our editorial content is never influenced by advertisers. ZDNET's editorial team writes on behalf of you, our reader. Our goal is to deliver the most accurate information and the most knowledgeable advice possible in order to help you make smarter buying decisions on tech gear and a wide array of products and services. Our editors thoroughly review and fact-check every article to ensure that our content meets the highest standards. If we have made an error or published misleading information, we will correct or clarify the article. If you see inaccuracies in our content, please report the mistake via this form . Close Home Tech Computing Laptops I swapped my Windows laptop for a MacBook Air M4, and finally understand the hype The M4 MacBook Air refines the ultraportable experience with modest but still impactful hardware upgrades and a lower starting price. Written by Kyle Kucharski, Editor April 12, 2025 at 3:00 a.m. PT ZDNET's key takeaways Apple's MacBook Air M4 is available now, starting at $999 for the 13-inch, and $1,199 for the 15-inch. The M4 Air supports up to two external monitors with the lid open, and scales up to 32GB of unified memory. There are still only two USB-C ports on the left side, and I wish there were a nano-texture display option. View now at Apple View now at Bhphotovideo View now at Best Buy more buying choices Before Apple announced the MacBook Air M4 in early 2025, rumors abounded on what new features the ultraportable would come with. Partly because it was the last of Apple's core line of devices to get the M4 chip, and partly because, well, last year's MacBook Air M3 was (and still is) one of the best laptops we've tested -- a future-proofed \" AI computer for the masses \" that could be seen as a successful culmination of Apple's design. Also: I recommend this Asus laptop to creative professionals and business users alike. Here's why At no point can the Apple machine stop producing, however, so with the MacBook Air M4, it was apparent it would be an incremental upgrade, refining what made last year's version great while offering a little bit more for less cost to the consumer. ZDNET RECOMMENDS Apple MacBook Air M4 The MacBook Air M4 comes with a bump up in hardware for a more affordable price. details View at Apple The MacBook Air M4, for example, starts at $999 for the 13-inch configuration with 16GB of memory -- $100 less than last year's M3. At the same time, the hardware expands on both the low and high end, with the lowest-tier configuration of the M4 equipped with a 10-core CPU and 8-core GPU, in contrast to the 8-core M3 chip from last year. Also: Why I bought a $5,300 Apple Mac Studio in the midst of tariffs news - and don't regret it On the other hand, the high-end configuration offers 32GB of unified memory, which was previously capped out at 24GB on last year's M3. This combination of improvements for base components and a lower starting cost is strategic positioning on Apple's part to incentivize the new devices and stay competitive in an increasingly crowded market. Kyle Kucharski/ZDNET The MacBook Air M4 is a fantastic device, but it's also a natural continuation of the product line, which some might see as a \"boring\" update. Depending on who you ask, that could be a good or a not-so-good thing. You can't fix what isn't broken, but I think there is some room here for a few more bold design choices. One of the most obvious is the MacBook Air M4's new colorway, Sky Blue, which is a very subtle blue; a very cautious decision when I was expecting something a little closer to Microsoft's Surface Laptop . All that being said, there are certainly some features on the M4 MacBook Air that set this year's ultraportable apart. Let's break them down. Triple-screen threat One of the most anticipated and sought-after features of the MacBook Air M4 is its ability to support two external monitors while the lid is open. This alone opens up new possibilities for work, productivity, and creative tasks and makes the MacBook Air more competitive with three working displays. Also: Lenovo ditched tradition by redesigning the latest ThinkPad - and I'm glad it did The laptop's own display still looks great, as well. Apple's Liquid Retina technology provides crisp, well-defined text, smooth, vibrant video, and support for 1 billion colors. Maxing out at 500 nits of brightness, the display on the Air M4 doesn't get as bright as the MacBook Pro, but it's still bright enough for the majority of use cases. I am a little surprised there isn't an option to upgrade the M4 Air with the nano-textured glass we saw on the M4 MacBook Pro , however. Maybe we're a bit spoiled now, but the glare is noticeable enough for me to wonder why, of all the possible things you can upgrade this laptop with, that isn't one of them. The other thing about the display I don't love is the notch for the camera, which results in a chunk of otherwise valuable screen real estate blacked out where the lens is located. If you keep the toolbar toggled on, it's something you can get used to, but with apps in full-screen it's definitely noticeable. Productivity powerhouse While on the topic of productivity, the MacBook Air M4 excels at more than just multiple displays. For one thing, videoconferencing on the Air is a joy. The webcam's hardware got an upgrade, from the 1080p FaceTime camera from last year to a 12MP camera on the M4 Air with Apple's new Center Stage feature. Also: I finally replaced my M1 MacBook Pro with a base model M4 - and the upgrades were worth it We first saw Center Stage on the MacBook Pro and iMac last fall, and its addition to the Air is one of the many features that bring the ultraportable a little closer to its older Pro sibling. If you're unfamiliar with it, Center Stage keeps you focused and centered in the frame no matter how you're positioned, handling the visual logistics of the call with minimal input from the user. Kyle Kucharski/ZDNET To me, it seems less like a standalone feature in its own right and more like the inevitable future of webcam technology. This is how webcams should work, and Apple's innovation here presents a polished experience that is equally enjoyable for work or personal calls on FaceTime. The combination of top-tier hardware, a seamless and well-integrated product, and quality-of-life features just makes the video call experience overall better on a Mac. Also: Worried about a $2,300 iPhone? How US tariffs are causing tech buyers to scramble I use a Windows device as my daily driver, and although I've used Macs for years in the past, I forgot how effortlessly the MacBook Air can handle multitasking through a combination of the Launchpad, split screen, and talking directly to Siri. Additionally, improvements to how windows are tiled are satisfying for those of us who like our desktops arranged in a particular way. Reliable, all-day battery The MacBook Air is still a battery-efficient device, and although Apple's Silicon line of processors set the standard for battery performance in ultraportable laptops, the rest of the market has had some time to catch up. That doesn't mean the MacBook Air has fallen behind, but it does have some competitors now. During my testing of the M4, I got over 14 hours of battery life with the device running a 4K video at half brightness, which is about where I expected it to be and about the same as last year's MacBook Air M3 . By contrast, Microsoft's Surface Laptop got over 15 hours during the same test, and Asus' Zenbook A14 came in closer to 20. The latter, of course, doesn't match the power on board the MacBook Air M4, but it is lighter, thinner, and packs a gorgeous display. That alone puts it in competition territory. Kyle Kucharski/ZDNET Yes, the MacBook Pro M4 will last longer as well, but the Air is thinner and lighter and much less variable: the difference in battery drain is minimal depending on what tasks you're putting it through (barring persistent, intense workloads). Also: I switched to the Apple Watch after a four-year hiatus - here's why it's near perfect now The bottom line is that for users who commute into the office a few times a week, you can reliably count on the MacBook Air M4 to last the whole day if you forget your charger, even if you're taking a few video calls. Benchmarking Putting all that hardware to the test, the MacBook Air M4 performed very well in our benchmarking, coming in very close to both the MacBook Pro M4 and MacBook Pro M3. As these devices leave their predecessors from just a few years ago in the dust, they get a little bit closer to each other. Cinebench 24 MC Geekbench 6.2.2 SC Geekbench 6.2.2 MC Apple MacBook Air M4 888 3,587 14,972 Apple MacBook Pro M4 1,000 3,823 14,849 Apple MacBook Pro M3 906 3,072 11,623 Apple MacBook Pro with M1 Pro 828 2,211 12,482 So what about the things I wish Apple did differently? Well, many of my gripes about the MacBook Air M4 are nothing new. For one, there are still only two USB-C ports, both of which are on the left-hand side of the device. If this felt limiting for you before, not much has changed. Also: M3 MacBook Air review: Apple's AI computer for the masses has arrived Second, Apple's devices remain some of the most locked-down when it comes to repairability, keeping consumers strictly bound to Apple's repair and service model by barring the use of salvaged components. The company has made strides toward a greener business model when it comes to production, but a loosening of the strict control over parts replacement would go even further. ZDNET's buying advice The MacBook Air M4 is still one of the most complete packages you can ask for when it comes to creativity, productivity, and everyday use. The M4 Air's sleek and lightweight form factor set the standard for ultraportables, and not much has changed with its design since, for better or for worse. If you have an iPhone and enjoy Apple's ecosystem of products, the MacBook Air is a solid choice as a main driver. If you already have a Mac that's more than a few years old, the MacBook Air M4 will feel like a significant upgrade. If you have an M2 Pro or M3, the leap will feel less noticeable. If you're coming from an older Windows device, well, you'll wonder how you ever took calls on your 720p webcam at all. Considering all of this, the MacBook Air M4 is a modest upgrade from its predecessor but pushes the line forward overall. In fact, with burgeoning Apple Intelligence features, the same camera technology as the MacBook Pro M4, upgraded hardware, and a lower starting price, the MacBook Air seems like the most logical choice for a new Apple laptop in 2025. Featured reviews The Lenovo ThinkPad streak is over: I tested a new model that bucks a decade-long trend (for the better) We saw Sony's 2025 Bravia TV lineup, including a flagship OLED model that blew us away I switched to $379 Android phone from my Pixel 9 Pro while traveling - and didn't regret it I am a hardcore Windows PC user, but the new Mac Studio has me rethinking everything The Lenovo ThinkPad streak is over: I tested a new model that bucks a decade-long trend (for the better) We saw Sony's 2025 Bravia TV lineup, including a flagship OLED model that blew us away I switched to $379 Android phone from my Pixel 9 Pro while traveling - and didn't regret it I am a hardcore Windows PC user, but the new Mac Studio has me rethinking everything Editorial standards Show Comments Log In to Comment Community Guidelines Related 3 Apple devices you definitely shouldn't buy this month (and 10 to get instead) Samsung's new flagship laptop rivals the MacBook Pro in all the right ways I never pay full price for PCs or Macs, thanks to these 7 money-saving tricks", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://www.zdnet.com/article/i-swapped-my-windows-laptop-for-a-macbook-air-m4-and-finally-understand-the-hype/", "source": "ZDNet", "published_at": "2025-04-12T10:00:15"}, {"id": 16, "title": "What You Need to Know About Your iPhone's Enhanced Visual Search", "content": "What You Need to Know About Your iPhone's Enhanced Visual Search - CNET X Tech Services & Software What You Need to Know About Your iPhone's Enhanced Visual Search This feature is turned on by default, but you can disable it if you're concerned about privacy. Zachary McAuliffe Staff writer Zach began writing for CNET in November, 2021 after writing for a broadcast news station in his hometown, Cincinnati, for five years. You can usually find him reading and drinking coffee or watching a TV series with his wife and their dog. Expertise Web hosting | Operating systems | Applications | Software Credentials Apple software beta tester, \"Helps make our computers and phones work!\" - Zach's grandparents See full bio Zachary McAuliffe April 12, 2025 3:00 a.m. PT 2 min read Apple/CNET Apple released iOS 18.4 on March 31, and that update brought bug fixes, new emoji and a new recipes section to Apple News . But when Apple released iOS 18 in September, one feature included in the update sends photo data from your iPhone to Apple's servers in an effort to help you better find pictures in your photo library. Apple calls this feature Enhanced Visual Search, and it's turned on by default. But you can turn the feature off in a few easy steps if you're concerend about privacy. Read more: Everything You Need to Know About iOS 18 Here's what you need to know about Enhanced Visual Search. Apple's Enhanced Visual Search privacy measures \"Enhanced Visual Search in Photos allows you to search for photos using landmarks or points of interest,\" Apple wrote online . \"Your device privately matches places in your photos to a global index Apple maintains on our servers.\" According to an Apple research post , parts of a photo that might contain a landmark are encrypted and sent to Apple's servers, so the whole picture is not sent. Your encrypted data is also one point amongst other pieces of junk data that aren't associated with any of your, or anyone else's, images. Once the data arrives at the Apple server, the server doesn't decrypt the data. It only works with the encrypted data. If the server establishes whether or not the encrypted photo data contains a corresponding landmark, the server then sends your device an encrypted response, which your device then decrypts. The company also wrote in the post it uses a third-party-operated Oblivious HTTP relay to hide your data's IP address. And each time your iPhone sends photo data to a server the data is given a new IP address. But some people have questioned if this is enough to protect your data. \"If my computer sends data to the manufacturer of the computer, then it's not private, or at least not entirely private,\" developer Jeff Johnson wrote online. \"A software bug would be sufficient to make users vulnerable, and Apple can't guarantee that their software includes no bugs.\" If you are concerned about Enhanced Visual Search sending your photo data to Apple's servers, here's how to turn the feature off. It's important to note that if you have an iCloud account to store photos or backup your iPhone data, your photos are still going to Apple's servers. Turning this feature off won't stop that. How to disable Enhanced Visual Search Apple/Screenshot CNET 1. Open Settings . 2. Tap Apps . 3. Tap Photos . 4. Tap the toggle next to Enhanced Visual Search . Now, your iPhone won't send encrypted photo data to Apple's servers to help you find photos on your iPhone. That also means searching for pictures on your iPhone will likely suffer. If you want to turn the feature back on, follow the steps above. For more on iOS 18, here's what to know about iOS 18.4 and iOS 18.3 . You can also check out our iOS 18 cheat sheet . Watch this: Apple's Big 'Vision' for Siri at WWDC25? The Future Could be Cameras 05:26 Services and Software Guides VPN Best VPN Best iPhone VPN Best Free VPN Best Android VPN Best Mac VPN Best Mobile VPN Best VPN for Firestick Best VPN for Windows Fastest VPN Best Cheap VPN Cybersecurity Best Password Manager Best Antivirus Best Identity Theft Protection Best LastPass Alternative Streaming Services Best Live TV Streaming Service Best Streaming Service Best Free TV Streaming Service Best Music Streaming Services Web Hosting & Websites Best Web Hosting Best Minecraft Server Hosting Best Website Builder Other Services & Software Best Dating Sites Best Language Learning Apps Best Weather App Best Stargazing Apps Best Cloud Storage Best Resume Writing Services New Coverage on Operating Systems", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.cnet.com/tech/services-and-software/what-you-need-to-know-about-your-iphones-enhanced-visual-search/", "source": "CNET", "published_at": "2025-04-12T10:00:03"}, {"id": 17, "title": "Say Goodbye to Seed Oils: These 17 Snacks Are Clean and Delicious", "content": "Seed Oil-Free Snacks That Still Taste Delicious Skip to content More Like This Nutrition Apr. 12, 2025 The Nutritionist’s Smoothie Formula: How to Build a Balanced Blend Nutrition Mar. 31, 2025 How to Snack Smarter While Traveling, According to a Nutritionist Health Mar. 24, 2025 A Nutritionist’s Guide to a Simple Spring Cleanse Protein Feb. 20, 2025 A Nutritionist Shares Her Favorite High-Protein Meals on a Budget We may receive a portion of sales if you purchase a product through a link in this article. Let it be known: There are myriad ways to architect your diet these days. What one person excludes, another prioritizes for the holistic health of them each. Even still, one thing most can agree on: Everyone loves snacks! For taking on the road, for curbing hunger pangs, or for something to savor while watching a show— healthy snacks are game-changers. Seed oils are the latest ingredient having a moment, and whether you’re on the seed oil-free train or just looking for a tasty, minimally-processed snack, keep reading. This is the list for you. But first, what are seed oils? Most of them you’ll already know: canola, corn, soybean, cottonseed, sunflower, and safflower are just a few. They’re inexpensive vegetable oils extracted from plant seeds often under intense, chemically-dependent conditions. They have a high smokepoint, high amount of omega-6 fatty acids, and are used frequently in cooking. Their ubiquitous usage is the reason why some say they can contribute to inflammation in the body, throwing the vital omega-6 to omega-3 fatty acid ratio off balance. The argument is that seed oils are everywhere and we’re eating too much of them. However, other sources say you can healthily work seed oils into your diet and small quantities of them are OK. The goal here, as is the case with any level of dietary awareness, isn’t to foster fear or obsession. Instead, this list is simply to inspire snacking in a way that feels good for your body and making mindful, healthy swaps if possible. When in doubt, choosing whole foods that are minimally-processed will always be your best bet. So let’s get into a few seed oil-free snacks that are clean, satisfying, and genuinely tasty. Favorite Seed Oil-Free Snacks This list is composed of snacks that lack the above seed-derived oils. Fruit-based oils, such as coconut, olive, or avocado, are better choices. Rich in antioxidants, these oils are thought to promote cardiovascular health and can serve as good sources of monounsaturated fats. They’re typically made by mashing and extracting through centrifugation, though they can also undergo a refining process. Look for organic, cold-pressed oils whenever possible to ensure the highest quality and most health benefits. SAVORY & CRUNCHY LesserEvil Organic Popcorn Made with organic coconut oil or ghee and available in many addictive flavors. Cue the movie night. LesserEvil Organic Popcorn $3.19 at Target LesserEvil Space Balls The cheesy childhood snack of your dreams, minus the junky ingredients. You definitely won’t be able to have just one. LesserEvil Space Balls $7.13 at Amazon Every Body Eat Cheese-less Snack Thins Thin but substantial, these pack a punch of flavor with just a little bit of heat to keep you coming back. Also excellent in Chive & Garlic or Sea Salt Chia. Every Body Eat Cheese-Less Snack Thins $6.33 at Amazon Siete Serrano Sea Salt & Vinegar Chips If you love a chip with pucker, this one has your name on it. If not, go for the smokey Chipotle BBQ or dairy-free Nacho flavors, both also cooked in 100% avocado oil. Siete Serrano Sea Salt & Vinegar Chips $3.94 at Walmart Manitoba Harvest Superseed Snack Clusters in Smoky BBQ Rich in fiber, balanced omegas, and plant-based protein, these are the ultimate travel snack that will actually leave you full. The zing of spice is a nice added bonus. Manitoba Harvest Superseed Snack Clusters $4.66 at Amazon EPIC Salmon Jerky A go-to source for portable protein, these are made from wild-caught Alaskan salmon and provide the perfect savory bite with a hint of maple sweetness. EPIC Salmon Bites $48.80 for a Pack of 8 at Amazon AshaPops in Vegan Cheese Think of a softer, fluffier popcorn kernel—that’s what these popped water lily seeds come close to. While not every flavor from the brand is seed oil-free, this finger-licking cheesy flavor (along with Himalayan Seat Salt) is. AshaPops in Vegan Cheese $9.05 at Amazon Gimme Roasted Seaweed Snacks in Avocado Sea Salt & Oil Strangely addictive roasted seaweed, high in iron, omega-3s, and B vitamins. Make sure to get either the avocado or olive oil options. Gimme Roasted Seaweed Snacks in Sea Salt & Avocado Oil $5.86 for a Pack of 2 at Amazon SWEET TOOTH FIXES Blue Stripes PB & Banana Whole Cacao Trail Mix Sweet, salty, chewy. This satisfying trail mix has it all in the right proportions, and will make you wonder why haven’t we been eating the whole cacao bean this entire time? Blue Stripes PB & Banana Whole Cacao Trail Mix $6.39 at Whole Foods Hu Chocolate Hazelnut Butter Bars No refined sugar, no seed oils, and paleo-friendly. Anyone who has tried a Hu bar knows the joy these bring, but the hazelnut butter feels extra decadent. Hu Chocolate Hazelnut Butter Bars $4.99 at Target Granarly Mardi Pardi Whiskey Granola Crunchy, chewy, and like no other granola you’ve ever tasted. Made with olive oil (and yes, bourbon whiskey), this is a true party: free of eight common allergens and vegan. Granarly Mardi Pardi Whiskey Granola $7.99 at Granarly Heavenly Organics Mint Chocolate Honey Patties Fans of mint and chocolate, watch out. These three-ingredient patties will ruin you for anything else. The dark chocolate really does it here. Shopping Block $12.89 at Amazon HOMEMADE WHOLE FOOD SNACKS Apple slices with almond butter (look for one with just almonds + salt). Hard-boiled eggs with flaky salt + chili oil (homemade with avocado or olive oil). Trail mix: walnuts, coconut flakes, dark chocolate chips + dried cherries. Dates , plain or sliced with a smear of nut butter inside. Sliced dried fruit (like figs or mango) with goat cheese + drizzle of honey. Tired of Netflix? Try These 70 Things to Do at Night Instead More Like This: More Nutrition Health Apr. 11, 2025 Tired of Netflix? Try These 70 Things to Do at Night Instead Guaranteed boredom busters. Books Apr. 10, 2025 10 New Thrillers You Won’t Be Able to Put Down These books deliver 5-star suspense. Healthy Habits Sep. 16, 2022 I Set a Goal to Walk 12,000 Steps a Day—Here’s How It Transformed My Health Transformative change, one step at a time. Health Apr. 05, 2025 How To Put Yourself Out There Without Using a Dating App ‘Cause you can still meet people IRL. Search the site", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://camillestyles.com/wellness/nutrition/seed-oil-free-snacks/", "source": "Camillestyles.com", "published_at": "2025-04-12T10:00:00"}, {"id": 18, "title": "All the Easter Eggs in Lady Gaga’s Headlining Set at Coachella", "content": "All the Easter Eggs in Lady Gaga’s Headlining Set at Coachella ​", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://people.com/lady-gaga-s-headlining-set-at-coachella-2025-11713387", "source": "PEOPLE", "published_at": "2025-04-12T09:54:35"}, {"id": 19, "title": "Lenovo Yoga Slim 7x Review: Thought OLED was overrated? Not with this laptop - it's one of the best-looking I've ever used", "content": "Lenovo Yoga Slim 7x Review: Thought OLED was overrated? Not with this laptop - it's one of the best-looking I've ever used | TechRadar Skip to main content (Image: © Future) TechRadar Verdict The Lenovo Yoga Slim 7x is a spectacular laptop built for AI using Qualcomm's Snapdragon Elite X CPU - Microsoft Copilot+ shines bright on the system, but not as bright as the 3K OLED display, which topples some of the best monitors for desktop PCs on the market. Pros + Phenomenal OLED display + Exceptional battery life + Powerful Snapdragon Elite X CPU + Wi-Fi 7 compatibility + Lightweight and slim Cons - Only USB-C ports - Decent gaming performance held back by 3K resolution - Touchscreen isn't ideal on an OLED panel - fingerprint marks Why you can trust TechRadar We spend hours testing every product or service we review, so you can be sure you’re buying the best. Find out more about how we test. Jump to: Two-minute review Price and availability Specs Display Battery Performance Design Verdict How I tested Lenovo Yoga Slim 7x: Two-minute review (Image credit: Future) The Lenovo Yoga Slim 7x offers plenty of benefits in almost every department, all powered by Qualcomm's Snapdragon Elite X processor: this is a laptop built with creativity in mind, coming with one of the best OLED displays you'll ever see, battery life that'll keep your charger out of use for almost an entire day, and perhaps most importantly fast multitasking experiences with up to 32GB of RAM (though its soldered, so you'll have to pick the model that's ideal for you). Its slim and sleek design, along with the 14-inch display size, allows the 90Hz OLED panel to blossom - believe it or not, this beats the excellent Alienware AW3423DWF QD-OLED ultrawide monitor at HDR with True Black HDR 600 certification compared to 400. Burn-in is, of course, still a concern - as with any OLED - but utilizing Windows 11 's helpful tools, such as automatically hiding the taskbar, will go a long way in preventing it. The Slim 7x isn't all perfect, though, as you'll only have access to USB-C ports. There's no USB-A port or even an audio jack, so the only solution for external connections that don't use USB-C would be a dock. You may like I tested the Acer Swift 14 AI for two weeks - if you need a new work laptop, this one is close to perfection I used the dual-screen Asus Zenbook Duo (2025) as my everyday laptop for a week, here's my verdict While gaming is possible with acceptable frame rates (since this isn't a gaming laptop), it's held back by the 3K (2944 x 1840) resolution, which I'll delve deeper into later on - don't buy this laptop if you're intent on serious gaming, especially at its native resolution. To give you a brief summary, I tested less demanding titles like Hades and Sifu , with the latter struggling to stay above 60fps at 1440p on low graphical settings - that should be enough of an indication that this system isn't built for gaming, but it can still hit surprisingly hard at lower resolutions. Besides this, it does exactly what it promises, providing enough power and speed for your creativity - the 12-core Snapdragon X Elite X1E-78-100 processor offers a nippy 3.4GHz clock speed, and after my testing within a handful of CPU-intensive applications, this easily joins the list of my favorite machines and certainly is among the best laptops of 2025 . Lenovo Yoga Slim 7x: Price & Availability How much does it cost? Starting at $1,049 / £1,249.99 / AU$2,609 When is it available? Available now Where can you get it? In the US, UK, and Australia Whilst its price ($1,049 / £1,249.99 / AU$2,609) might throw you off a potential purchase, the specifications make up for it in a variety of ways. I'll highlight the benefits of the gorgeous OLED screen on this laptop shortly, but considering the price of OLED panels in general when it comes to not just laptops but also gaming monitors and TVs, there's always going to be a premium to pay - this can't be faulted either, as it remains the best among all display types. It would also be a disservice not to mention the Qualcomm Snapdragon 12-core processor, especially when it comes to multitasking - running multiple applications and tabs simultaneously. The Snapdragon X Elite loses out to Apple 's M3 chip in single-core processes, but matches the Apple Silicon chip in multi-core workloads, providing a satisfying experience catering towards productivity. Lenovo Yoga Slim 7x: Specs Swipe to scroll horizontally Header Cell - Column 0 Lenovo Yoga Slim 7x Header Cell - Column 2 CPU Snapdragon(R) X Elite - X1E78100 Row 0 - Cell 2 GPU Qualcomm Adreno X1-85 GPU Row 1 - Cell 2 RAM Up to 32GB Row 2 - Cell 2 Display 14.5-inch, 3K OLED/DisplayHDR True Black 600 Row 3 - Cell 2 Operating System Windows 11 ARM64 Row 4 - Cell 2 Refresh Rate 90Hz Row 5 - Cell 2 Storage Up to 1TB Row 6 - Cell 2 Ports 3x USB-C Row 7 - Cell 2 Wireless Wi-Fi 7, Bluetooth 5.4 Row 8 - Cell 2 Battery 70Whr Row 9 - Cell 2 Weight 1.28kg Row 10 - Cell 2 Dimensions 325 x 225.15 x 12.9mm/12.80 x 8.86 x 0.51 inches Row 11 - Cell 2 Camera 1080P FHD IR Hybrid with Dual Microphone Row 12 - Cell 2 Lenovo Yoga Slim 7x: Display Now, starting with this laptop's display: the OLED panel present here is, hands down, the stand-out aspect. You may have wondered why I mentioned Dell 's Alienware QD-OLED ultrawide monitor earlier - I happen to own that display, and it's magnificent when using either DisplayHDR 1000 or True Black HDR 400, but the Yoga Slim 7x's display outdoes the latter. True Black HDR 600 is the second-best VESA certification that you can get with OLED screens, as you're getting 600 nits of brightness, all while maintaining infinite contrast and deep black levels. That's not to say that the AW3423DWF doesn't utilize its high-quality contrast while HDR 1000 is in use, but ABL (auto-brightness limiter) is far too aggressive, making gaming a frustrating experience in this mode. Just look at those deep black levels... incredible. If you're on an OLED screen, that is. (Image credit: Future) With the Slim 7x, True Black HDR 600 will make any of your games, movies, and shows look phenomenal - it's important to note, that I had to utilize the Windows HDR Calibration app (which can be found in the Microsoft Store) to adjust HDR as many of the colors can seem washed out when the mode is enabled and viewing HDR content. Once adjusted, it works like a charm, and I've managed to get some of my best viewing experiences ever with this display. It's another reason for me to tell you yet again that once you upgrade to OLED, there's no going back - the deep black levels are phenomenal with the infinite contrast ratio, and unless you're reading this on a similar OLED panel, images won't do them any justice. I've never been one to notice the imperfections of regular LED displays until I decided to snap up Dell's Alienware OLED. I've also tested Asus's PG49WCD OLED ultrawide, and neither came close to my experience with the Yoga Slim 7x. You also have the advantage of multiple color settings to switch between, thanks to the pre-installed X-Rite Color Assistant with P3, DCI-P3, Adobe RGB, sRGB, and Rec. 709 for SDR viewing (which is fantastic here). When using this, you'll need to disable HDR as X-Rite appears to be incompatible with it - this is relevant, as there was plenty of content I viewed that wasn't available in HDR. While True Black HDR 1000 (which was recently announced at CES 2025 ) OLED displays will likely surpass the Yoga Slim 7x, it shouldn't be a reason to stop you from getting your hands on it. Lenovo Yoga Slim 7x: Battery Beautiful keyboard... (Image credit: Future) Battery tests were extremely positive at higher percentages - my first test was at 47% at full brightness with HDR enabled while multitasking with multiple YouTube videos playing, and it lasted approximately 42 minutes before the issue came into play. My second test, had the battery at 80% with full brightness and HDR enabled, with the same level of activity, and it lasted for 2 hours and 34 minutes. These are fantastic results for a system that is put under strain at its maximum brightness level, but I've got even better news regarding my third test. (Image credit: Future) With my brightness levels set between 20 and 30 percent and HDR enabled while at 100% battery, the Yoga 7x took a full 2 hours and 8 minutes to start draining while multitasking. Yes, you read that right - it was at 100% battery for 2 hours. Putting the system under further stress with multiple videos at high resolutions running in the background and even a few benchmark tests, it took another 2 hours and 50 minutes to fall to 48% battery, lasting a total of 4 hours and 58 minutes without fully draining. Now, barring the issue of the immediate battery drain (which I'm hoping was an isolated issue with my review unit), this is truly exceptional for those out for a laptop capable of lasting them throughout the day. I've always been one to opt for a system that allows me to forget that my charger exists, at least for multiple hours - the Yoga Slim 7x does just that when you're reasonable with brightness levels and the amount of strain you put on the laptop. Lenovo Yoga Slim 7x: Performance Love me some Hades for sure... (Image credit: Future) There was no way I was testing this beautiful laptop without attempting to game on it and see just how far I could go with its performance across several games. Well, at least I tried. If you're contemplating a purchase of the Lenovo Yoga Slim 7x with the intention of using it for gaming, this isn't the laptop for you. While it can perform well in some games like Hades (which left me quite impressed), its drivers leave several games crashing - some would crash on startup, and if they could make it past the menu screen, the frame rates were not acceptable. A prime example of this was Capcom's Resident Evil 4 (you know you were going to see that at some point in this review), which would consistently crash on startup. Once using Qualcomm's upgraded graphics driver (which included GPU performance optimizations for several games), I made it past the main menu into the game - on the lowest preset at a 720p resolution, it could not push past 20 frames per second before eventually crashing again with a fatal D3D error, which points towards driver incompatibility. (Image credit: Future) On the bright side, though, Hades (while at the maximum 2944 x 1840 resolution) never once fell below 80 frames per second, even in the midst of intense combat. Where you'll run into issues when trying to game is with games that are somewhat demanding and that the X1E-78-100 processor can't handle at higher resolutions. You may think that lowering the resolution will suffice in multiple games, but the screen has a 16:10 aspect ratio, which isn't great for resolutions like 1920x1080 or 2560x1440 (which are some of the only options in games). Fortunately, performance in other areas provides a far more pleasant experience - multitasking is key for me when using any laptop, and the Slim 7x gave me zero issues when doing so. Thanks to the processor's 12 cores and 12 threads, keeping multiple tabs open hardly makes the system break a sweat (also making it essential for video editing and rendering). Lenovo Yoga Slim 7x Benchmark Tests Here's how the Lenovo Yoga Slim 7x performed in some of our benchmark tests and games: Geekbench 6.3 CPU Bench: Single-core/2,236; Multi-core/11,784 Geekbench 6.3 GPU/OpenCL Bench : 19,839 Geekbench 6.3 GPU/Vulkan : 23,571 Cinebench 2024 : Single-core/105; Multi-core/799 CrossMark : Overall: 1,294 ; Productivity: 1,109 ; Creativity: 1,577 ; Responsiveness: 1,137 Hades : Average 84fps Lenovo Yoga Slim 7x: Design (Image credit: Future) Considering the OLED display present here, the Lenovo Yoga Slim 7x is a very thin laptop - as the name should suggest - while also being very lightweight, weighing only 1.28kg. There's also an incredible backlight keyboard at your disposal, and one of the standout features here was the caps lock - yes, I know, it sounds minor, but a simple key press will display whether caps lock is enabled or disabled on screen. This eliminates any potential issues with caps lock when entering passwords (there are still some sites that won't let you show your password), which goes a long way when trying to stay productive. It's a big shame that there are only three USB-C ports available on this system, which means you'll be forced to use a dock if you plan on using your USB-A drive, ethernet cable, or HDMI to connect to an external display. I suspect the omission of said ports is to adhere to keeping the Slim 7x thin, but I digress. The lack of even a 3.5mm headphone jack just feels absurd in a modern laptop. (Image credit: Future) The speakers here are underwhelming, but there's always got to be a compromise for a system that has so many positives - you do, however, have access to multiple sound presets through the Lenovo Vantage app so you can adjust the sound to adapt to your games or movies. It's worth noting that this is a touchscreen display, but I never used this often throughout testing - touchscreen on a beautiful OLED display like this, just didn't seem appealing as I didn't want my fingerprint marks all over the screen, and it's not a 2-in-1 laptop (unlike some of the other Snapdragon laptops). What's great, though, is that there were little to no thermal issues even when there was a lack of room for ventilation, and it's safe to say that the Slim 7x satisfied me within its design region. Should I buy the Lenovo Yoga Slim 7x? Buy it if... You want a fantastic display The Lenovo Yoga Slim 7x has an outstanding OLED screen, with DisplayHDR True Black 600 providing exceptional viewing experiences. You want a laptop that has a long-lasting battery The Slim 7x truly can provide all-day battery life depending on your activity and screen brightness levels, keeping your charger stored away for a while. Don't buy it if... You're looking for a laptop capable of gaming While the Lenovo Yoga Slim 7x runs well in some games that are less demanding, it certainly isn't built to handle most AAA games. You prefer a 2-in-1 laptop While the Slim 7x is a touchscreen laptop, it doesn't work as well as fellow 2-in-1 Snapdragon laptops How I tested the Lenovo Yoga Slim 7x I spent two weeks testing the Lenovo Yoga Slim 7x, assessing its multitasking capabilities while also testing a variety of games. The Snapdragon(R) X Elite - X1E78100 excels at ensuring you get the best out of your activity, and this review unit included 16GB of RAM - 32GB may yield even greater results. Some of the other games I tested included Street Fighter 6 , Hitman: World of Assassination , Dragon's Dogma 2 , and Tekken 8 to see just how far it could go with performance, but most of them would crash. The issues with the instant battery drain prevented me from testing its battery life even further, but the results above indicate an incredible battery at reasonable settings. TOPICS Isaiah Williams Staff Writer, Computing Isaiah is a Staff Writer for the Computing channel at TechRadar. He's spent over two years writing about all things tech, specifically games on PC, consoles, and handhelds. He started off at GameRant in 2022 after graduating from Birmingham City University in the same year, before writing at PC Guide which included work on deals articles, reviews, and news on PC products such as GPUs, CPUs, monitors, and more. He spends most of his time finding out about the exciting new features of upcoming GPUs, and is passionate about new game releases on PC, hoping that the ports aren't a complete mess. You must confirm your public display name before commenting Please logout and then login again, you will then be prompted to enter your display name. Logout Read more I tested the Acer Swift 14 AI for two weeks - if you need a new work laptop, this one is close to perfection I used the dual-screen Asus Zenbook Duo (2025) as my everyday laptop for a week, here's my verdict Dell XPS 13 (9350, Intel Core Ultra 2nd Gen) review: still one of the best laptops money can buy I tested the Asus Zenbook A14 for two weeks and it's so light that I forgot it was in my bag I tested the Asus Vivobook Pro 16X - read what I thought about this amazing laptop. The best Ultrabooks 2025: best thin and light laptops I tried the Lenovo ThinkBook Plus Gen 5 Hybrid and found it very unique - and very expensive I’ve used the Lenovo Idea Tab Pro for over a month, and Apple should be worried about this Android iPad alternative I've reviewed dozens of gaming laptops, and the new Razer Blade 16 with Nvidia's RTX 5090 is one of the best I've ever seen I was blown away by the design the Samsung Galaxy Book5 360, but it’s not the quietest operator I spent two weeks with the Xiaomi 15 Ultra, and it's one of the best camera phones ever made I tested the Lenovo IdeaPad Slim 3 15IRU9 and found a no-frills laptop at a decent price Latest in Laptops This tariff-beating MacBook Air M2 deal at Best Buy gets you $300 off my favorite model, but it's selling quickly PC enthusiasts, be worried – Framework and Razer are halting laptop sales due to tariffs, and I fear what will come next Skip the latest model and save $250 on the powerful Apple MacBook Air M2 Dell launches a huge spring sale with up to $400 off – I've picked the 4 best laptop deals Love the MacBook Pro? A new model could be on the way, with some significant upgrades I was blown away by the design the Samsung Galaxy Book5 360, but it’s not the quietest operator Apple MacBook Air 15-inch (M4) review roundup – should you buy Apple's new lightweight laptop? How to check battery health of a laptop Microsoft Surface Laptop 7 vs. Apple MacBook Pro M4 14-inch: Mac and Windows go head to head once again Need a new MacBook Air? Well I've found 9 discounts you'll not want to miss, including a MacBook Air M4 Amazon deal These are the 16 laptop deals I'd recommend to anybody in the spring sales – including MacBooks and gaming laptops Trust me – don’t bother buying any other laptop while the M2 MacBook Air is at this incredible price for Amazon’s Spring Sale Latest in Reviews I enjoyed Black Mirror season 7, but I'm worried the anthology series is rapidly running out of ideas I’ve played Blue Prince for 70 hours and its roguelike room-based puzzles have consumed every waking moment of my life I reviewed the HP LaserJet M209dw - and this cheap printer is the best micro laser model I’ve tested I tested the Roborock Qrevo Master robot vacuum, and it takes all the hassle out of cleaning Vertere's DG X turntable is both sonically gifted and easy to use, and for 'serious' hi-fi, that's rare I tested the Nimo N155 barebones laptop - sounds like a great idea, but it isn’t sturdy enough for business deployment I tested the Google Pixel 9a, and it would be the perfect bargain phone if it wasn’t so dang ugly Alienware’s AW3425DWM 34-inch gaming monitor is so good, it's converted me from an ultrawide sceptic to a true believer Panda Dome review I tested this mini PC for NAS storage and streaming and here's why I think it's perfect as a home lab Hands on: I tried out the Scan 3XS GWP-ME A132C - read what I thought of this powerful workstation Hands on: I tested the PCSpecialist Onyx Ultra - see what I thought of this beast of a workstation LATEST ARTICLES 1 \"Weakening encryption would make European security worse\" – the VPN industry reacts to the EU's plan for end-to-end encryption backdoors 2 Reacher season 4: everything we know so far about the hit Prime Video show’s return 3 These are the top four electric sports cars I’ve driven – and they show electrification doesn’t mean boring 4 Lenovo Yoga Slim 7x Review: Thought OLED was overrated? Not with this laptop - it's one of the best-looking I've ever used 5 “We want to work with the best\" - Okta reveals new security tools designed to safeguard GenAI systems Close Please login or signup to comment Please wait... Login Sign Up", "sentiment": "POSITIVE", "sentiment_score": 0.9, "url": "https://www.techradar.com/computing/laptops/lenovo-yoga-slim-7x-review-thought-oled-was-overrated-not-with-this-laptop-its-one-of-the-best-looking-ive-ever-used", "source": "TechRadar", "published_at": "2025-04-12T09:50:53"}, {"id": 20, "title": "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts", "content": "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts Why did the S&P 500 drop today? What triggered Trump's tariff policy reversal? How will tariff exemptions impact tech stocks? Why are Treasury yields spiking now? What drove today's market volatility? How do trade wars disrupt supply chains? Why is US manufacturing slowing down? What fuels investor caution amid trade chaos? How does policy news affect corporate stocks? As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts nytimes.com/2025/04/12/us/politics/tariffs-china-iphones-panic-shopping.html Fearing increased prices because of tariffs on Chinese goods, shoppers have flocked to Apple stores to buy iPhones, deciding not to wait until the release of new models later this year. This story appeared on nytimes.com , 2025-04-12 09:02:07. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://biztoc.com/x/9f4691b50c7b3f3d", "source": "Biztoc.com", "published_at": "2025-04-12T09:15:33"}, {"id": 21, "title": "Tariff stakes sky-high for Samsung and Vietnam", "content": "Bangkok Post - Tariff stakes sky-high for Samsung and Vietnam Tariff stakes sky-high for Samsung and Vietnam Small Medium Large 1 Business General Tariff stakes sky-high for Samsung and Vietnam Biggest foreign investor in Vietnam makes 60% of its 220 million smartphones in the country PUBLISHED : 12 Apr 2025 at 16:06 WRITER: Reuters Small Medium Large 1 1 A Samsung Electronics factory in Bac Ninh province of Vietnam. Samsung is the largest foreign investor in Vietnam, where it employs about 160,000 people. (Photo: Reuters) HANOI - When Samsung Electronics chairman Jay Y Lee met Vietnam’s prime minister in July, he had a simple message to convey. “Vietnam’s success is Samsung’s success, and Vietnam’s development is Samsung’s development,” Lee told Pham Minh Chinh, pledging long-term investment to make the country its biggest manufacturing base for display products. Since the South Korean conglomerate entered Vietnam in 1989, it has poured billions of dollars into expanding its global manufacturing footprint beyond China. Many of its peers followed after US President Donald Trump placed tariffs on Chinese goods in his first term. The pioneering move has made Samsung Vietnam’s biggest foreign investor and exporter. About 60% of the 220 million phones Samsung sells each year globally are made in Vietnam, and many are destined for the United States, where Samsung is the second-biggest smartphone vendor behind Apple, according to the research firm Counterpoint. Now, that reliance on Vietnam threatens to backfire as Hanoi is racing to negotiate with the Trump administration to lower a punishing potential 46% tariff that has exposed the vulnerability of the Southeast Asian country’s export model. While Vietnam and Samsung won a reprieve this week after Trump paused the rate at 10% for 90 days, Reuters interviews with more than a dozen people, including at Samsung and its suppliers, show the company would be a primary victim should higher US tariffs take effect in July. “Vietnam is where we produce most of our smartphones, but the tariffs (initially) came out much higher than expected for the country, so there’s a sense of confusion internally,” said a Samsung executive, who like some others was granted anonymity to discuss a sensitive subject. Even if the two countries reach an agreement, Vietnam’s roughly $120-billion trade surplus with the US has put it in the crosshairs of a US administration targeting such imbalances. Hanoi hopes to get the duties reduced to a range of 22% to 28%, if not lower, Reuters has reported. Amid the uncertainty, Samsung and its suppliers are considering adjusting production, said four people familiar with the matter. That could involve increasing output in India or South Korea, though such steps would be costly and time-consuming, they said. Samsung declined to comment about how it is navigating the tariff threat. It has said previously it would respond flexibly to US tariffs with its global supply chain and manufacturing footprints. Vietnam’s foreign and industry ministries also didn’t reply to requests for comment. Samsung’s rival Apple faces an even bigger challenge at least in the short term, as Trump’s tariffs on Chinese imports have increased to 145%. Apple imports around 80% of iPhones sold in the US from China, according to Counterpoint. Apple did not reply to a request for comment. (Story continues below) Employees walk past the gate of the Samsung Electro-Mechanics factory in Thai Nguyen province in Vietnam. (Photo: Reuters) Losing low-cost appeal The tariff fear is the latest cloud over the manufacturing landscape in Vietnam, which had become a popular destination for companies looking to diversify amid China-US tensions. But the boom has contributed to power supply problems. Vietnam has also increased its effective tax rate on large multinationals in line with OECD-led global standards, which some companies complained came without adequate compensation for the loss of earlier tax incentives. Further, the influx of foreign companies tightened supply of skilled workers and increased wage costs, according to several South Korean firms based in Vietnam. One person described the situation as “very serious”. Mounting pressures could cost Vietnam investment appeal relative to other countries, according to some economists. “Vietnam’s loss could be India’s gain,” Nomura economists said in a note. India wants to move quickly on a trade deal with the US, a government official said on April 10. The two countries agreed in February to work on the first phase of a deal to be concluded late this year. Vietnam has already made concessions to the US, including increasing imports. It was among the first countries to announce the start of trade talks with the Trump administration after the moratorium on “reciprocal” tariffs. But foreign manufacturers are nervous. Ko Tae-yeon, chairman of Korea Chamber of Business in Vietnam, said that initially there was “panic” about Trump’s tariffs. Some had made plans to cut staff at local factories, he said, without specifying. In light of Trump’s pause, companies were now in “wait and see mode”, added Ko, who is director general of Heesung Electronics, a supplier of LG Display. Samsung has not made a decision on how to respond to the Vietnam tariffs given Trump’s changing approach, but one option is to produce some US-bound smartphone models at its factory in the South Korean city of Gumi, two of the people said. Four people said Samsung could boost production in India but it would first need to expand its smartphone supply chain there, as India can currently handle only around 20% of Samsung’s total output. BMI Research, a subsidiary of Fitch Solutions, estimates that electronics products account for roughly 45% of Vietnam’s exports to the US and major producers like Samsung would likely reduce production in anticipation of a decline in demand. Samsung also makes TVs, home appliances and device screens in Vietnam. Its exports amounted to around $54 billion last year, around 15% of Vietnam’s total, government estimates show. As Samsung weighs its options, worries are rippling through factory floors. “I am afraid they may cut everything,” said Nguyen Thi Hao, a 39-year-old worker at a Samsung plant in Thai Nguyen, north of Hanoi. KEYWORDS Tariffs Donald Trump China Vietnam Samsung Trade war Do you like the content of this article? COMMENT (1) RECOMMENDED LNG purchases may ease trade imbalance with US US Treasuries suddenly trading like risky assets China lifts tariffs on US goods to 125% Trump admits trade war 'cost' as markets hit PM wants to see pre-Covid tourism total soon TRENDING Try now", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://www.bangkokpost.com/business/general/3001792/tariff-stakes-sky-high-for-samsung-and-vietnam", "source": "Bangkok Post", "published_at": "2025-04-12T09:06:00"}, {"id": 22, "title": "Secret’s Out! iPhone 17 Pro Max Early Hands-On", "content": "Secret's Out! iPhone 17 Pro Max Early Hands-On - Geeky Gadgets Skip to main content Skip to secondary menu Skip to primary sidebar Skip to footer The iPhone 17 Pro Max represents a significant evolution in Apple’s flagship smartphone lineup, offering a combination of design innovation, hardware advancements, and performance enhancements. With its striking two-tone design, upgraded cameras, and a powerful new chip, the device aims to redefine the premium smartphone experience. However, its bold design choices and premium price tag may provoke mixed reactions among users, sparking debates about its appeal and practicality. The video below from Unbox Therapy gives us a look at the design of this year’s flagship iPhone. Watch this video on YouTube . Design: Aesthetic Evolution or Risky Departure? Apple has introduced a bold new design with the iPhone 17 Pro Max, featuring a distinctive two-tone back that reduces the glass area. This fresh aesthetic is paired with an aluminum frame, a departure from the titanium used in previous models. The aluminum frame not only makes the device lighter but also contributes to its durability and comfort during extended use. However, this change comes with a slightly thicker build, measuring 8.75mm in thickness, alongside dimensions of 71.44mm in width and 149.63mm in height. A subtle yet noticeable design update is the repositioning of the flash to the opposite side of the triangular camera module. This adjustment, while minor, reflects Apple’s focus on refining the device’s overall usability. The two-tone design may appeal to users seeking a fresh and modern look, but it could alienate those who prefer the sleek, uniform appearance of earlier models. On the other hand, the lightweight aluminum frame is likely to be welcomed by users who prioritize comfort and durability in their devices. Camera Upgrades: A Leap for Photography Enthusiasts The iPhone 17 Pro Max introduces substantial improvements to its camera system, catering to both casual users and photography enthusiasts. The front-facing camera now features a 24-megapixel sensor, offering sharper selfies and enhanced video quality for FaceTime, social media, and other applications. On the rear, all lenses are equipped with 48-megapixel sensors, making sure exceptional detail and clarity across a variety of lighting conditions. The triangular camera layout, a signature design element of the Pro Max series, has been optimized to support spatial video. This feature aligns with the growing demand for immersive content creation, particularly in augmented and virtual reality applications. The repositioned flash, while requiring some adjustment for users, highlights Apple’s attention to detail in enhancing the overall photography experience. These upgrades position the iPhone 17 Pro Max as a powerful tool for both everyday photography and professional content creation. Performance: Power Meets Efficiency At the core of the iPhone 17 Pro Max is a new chip designed to deliver faster processing speeds and improved energy efficiency. This advanced processor ensures seamless multitasking, smoother gaming experiences, and enhanced performance for demanding tasks such as video editing and augmented reality applications. The inclusion of a slightly larger battery, combined with optimized power management, promises extended battery life, allowing users to stay connected and productive throughout the day. Charging capabilities have also been significantly improved. The device supports faster wired charging of up to 35W, reducing the time required for a full charge. Additionally, reverse wireless charging enables users to power compatible devices, such as AirPods or other accessories, directly from their phone. These enhancements cater to users who value convenience and efficiency, making the iPhone 17 Pro Max a practical choice for those with busy lifestyles. Build and Features: Balancing Innovation with Familiarity The iPhone 17 Pro Max strikes a balance between innovation and continuity, retaining several hallmark features while introducing meaningful updates. MagSafe functionality remains a key feature, making sure seamless attachment of accessories such as wallets and chargers. The inclusion of a USB-C port marks a significant shift for Apple, aligning with industry standards and offering greater compatibility with a wide range of peripherals. This change is likely to be welcomed by users seeking faster data transfer speeds and improved versatility. Despite these updates, Apple has maintained the familiar button and SIM tray layout, providing a sense of continuity for long-time iPhone users. This thoughtful approach reflects Apple’s strategy of blending new features with familiar elements, making sure that the device appeals to both loyal customers and new adopters. Pricing and Market Position With a starting price of approximately $1,250 USD, the iPhone 17 Pro Max firmly positions itself in the premium smartphone segment. This pricing reflects the advanced technology, materials, and features integrated into the device. While the cost may deter budget-conscious buyers, it is likely to attract early adopters and loyal Apple enthusiasts who prioritize innovative technology and premium design. The device’s anticipated release is expected to generate significant interest, particularly among those who value innovation and are willing to invest in a high-performance smartphone. Its pricing strategy underscores Apple’s commitment to maintaining its position as a leader in the premium smartphone market. Reception and Future Impact The iPhone 17 Pro Max is poised to elicit a range of reactions from users and industry observers. While some may embrace its bold two-tone design and lightweight aluminum frame, others may view these changes as a departure from Apple’s traditional design language. However, the device’s upgraded cameras, enhanced performance, and new features are expected to win over many users, particularly those who prioritize functionality and innovative technology. In the broader context of smartphone innovation, the iPhone 17 Pro Max has the potential to influence future trends. Its focus on user-centric features, such as spatial video and reverse wireless charging, underscores Apple’s commitment to staying ahead in a competitive market. Despite initial skepticism, this device could set new benchmarks for premium smartphones, shaping the direction of the industry in the years to come. Stay informed about the latest in iPhone 17 Pro Max by exploring our other resources and articles. iPhone 17 Pro vs. iPhone 17 Air: Design and Features iPhone 17 Pro Max Leaks: Features, Specs, and More iPhone 17 Pro: Innovative Design and Camera Upgrades iPhone 17 Pro Leaks: Features, Design, and Release Date iPhone 17 Pro Features: What Makes It Worth the Upgrade Source & Image Credit: Unbox Therapy Share Tweet Pin Email Filed Under: Apple , Apple iPhone , Top News Latest Geeky Gadgets Deals Disclosure: Some of our articles include affiliate links. If you buy something through one of these links, Geeky Gadgets may earn an affiliate commission. Learn about our Disclosure Policy . Primary Sidebar Email Facebook Pinterest RSS Twitter Search the site ... Top News Guides Apple News Technology News Android News Footer About Us About Geeky Gadgets Advertise On Geeky Gadgets Archives Contact Geeky Gadgets Disclosure Policy Free Newsletter Geeky Gadgets Logo Privacy Policy Site Map Further Reading AI Apple iPad Apple iPhone Auto News Camera News Concepts & Design Design News Entertainment News Geeky Stuff Guides Mobile Phone News Reviews Sponsored Tablet News Geeky Gadgets Home Top News AI Apple Android Technology Guides Gadgets Hardware Gaming Autos Deals About", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.geeky-gadgets.com/iphone-17-pro-max-early-hands-on/", "source": "Geeky Gadgets", "published_at": "2025-04-12T09:01:43"}], "timeline": [{"date": "2025-04-12T09:06:00", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T09:15:33", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T09:50:53", "score": 0.9, "sentiment": "POSITIVE"}, {"date": "2025-04-12T10:00:00", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T10:00:15", "score": 0.8, "sentiment": "POSITIVE"}]}