{"company": {"id": 1, "name": "Tesla", "aliases": ["TSLA", "Tesla Inc"]}, "stats": {"POSITIVE": 2, "NEGATIVE": 9, "NEUTRAL": 10, "TOTAL": 21, "AVG_SCORE": -0.23333333333333334}, "mentions": [{"id": 1, "title": "Trump administration says it will exclude some electronics from reciprocal tariffs", "content": "Trump administration says it will exclude some electronics from reciprocal tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS The \"worm\" logo is on the left, the classic \"meatball\" logo is on the right. 13 minutes ago Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge Read full article: Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge JSO generic night 3 hours ago Teenage motorcyclist killed in crash on Gate Parkway Read full article: Teenage motorcyclist killed in crash on Gate Parkway . 5 hours ago A cool start, leading into a gorgeous day! Read full article: A cool start, leading into a gorgeous day! News4Jax shines at Florida News Awards 13 hours ago News4JAX shines at Florida News Awards Read full article: News4JAX shines at Florida News Awards DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Business Trump administration says it will exclude some electronics from reciprocal tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.news4jax.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WJXT News4JAX", "published_at": "2025-04-12T17:00:42"}, {"id": 2, "title": "Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded", "content": "Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded - The Economic Times Benchmarks Nifty 22,828.55 429.4 FEATURED FUNDS ★★★ ★★ Canara Robeco ELSS Tax Saver Regular - Growth 5Y Return 21.85 % Invest Now FEATURED FUNDS ★★★ ★★ HSBC Large Cap Fund Direct-Growth 5Y Return 20.75 % Invest Now Enter search text: Business News › News › International › US News › Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded The Economic Times daily newspaper is available online now. Read Today's Paper Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded SECTIONS Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded Global Desk Last Updated: Apr 12, 2025, 10:06:00 PM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis Nate Silver is back with his latest tracker which has claimed that billionaire adviser to US President Donald Trump, Elon Musk, has not so favourable view from Americans. Elon Musk. Elon Musk has been steadily losing popularity among Americans, according to claims made by pollster Nate Silver in his latest tracker. However, Silver's assessment has drawn sharp retort from Tesla CEO Musk who blasted the ratings as \"political propaganda war\". \"We just launched an Elon Musk popularity tracker to accompany our Trump approval tracker. Currently, he's at a −14 as compared with Trump's −5,\" Silver posted on Musk-owned X (formerly Twitter). Replying to Silver's tweet, Musk wrote, \"The inevitable outcome of having a political propaganda war waged against me while I have almost no countervailing campaign and, at times, digging my own grave way better than my enemies do.\" Silver \"Do Americans have a favorable or unfavorable view of Elon Musk\" tracker shows statistics from January 1, 2024 till April 1, 2025. The timeline comprises Musk's endorsement for then Republican Presidential nominee Donald Trump, US President elections, and Donald Trump's inauguration and subsequent decisions that Trump administration has taken. Earlier on Thursday, two U.S. House of Representatives lawmakers on Thursday asked the Transportation Department's top ethics official to detail how the agency is addressing Elon Musk's potential conflicts of interest given ongoing investigations of SpaceX and Tesla, companies run by the close ally of President Donald Trump. Live Events Meanwhile, Ireland's data privacy watchdog said on Friday it's investigating Elon Musk's social media platform X over its use of personal data to train his artificial intelligence chatbot Grok. The Data Protection Commission said it has opened an inquiry into \"the processing of personal data comprised in publicly-accessible posts\" that European users posted on X. FAQs Q1. Who is Tesla CEO? A1. Tesla CEO is Elon Musk. Q2. Who is President of USA? A2. President of USA is Donald Trump. (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Elon Musk Elon Musk news Elon Musk latest news Tesla Tesla news (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Elon Musk Elon Musk news Elon Musk latest news Tesla Tesla news (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Amtek’s Arvind Dham goes hospital hopping but ED gives a hot chase Delhivery-Ecom Express deal: A Big win for Delhivery but could Ecom Express have a longer runway? Why every large IT deal is going back to the drawing board Model Context Protocol: The secret handshake changing how businesses talk to AI The party’s over; what next? Why investors must keep in mind Marks’ ‘Pendulum Psychology’ of markets 1 2 3 View all Stories Videos N Nagendran apointed as Tamil Nadu BJP Chief Massive fire at aluminum unit in Nagpur’s Umred MIDC Tahawwur Rana in 18 day NIA custody after extradition Murshidabad protest turns violent, forces deployed President Trump optimistic about China trade talks Columbia student Mahmoud Khalil can be deported, US judge rules Trump says physical examination ‘went well' Gurugram storm horror: Pole falls on moving car Explosion near Hellenic train HQ in Athens, no injuries Trump discusses tariffs, Iran & health on Air Force One 1 2 3 Latest from ET Tariffs can boost manufacturing, but are India's factories ready? Trump spares phones, PCs, chips from reciprocal tariffs IPL | Sunrisers Hyderabad vs Punjab Kings Trending US News Dow Jones futures good april fools jokes Easter 2025 date Time social security changes Crypto market today March 5 Ash Wednesday Enter search text: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Name Reason for reporting: Foul language Slanderous Inciting hatred against a certain community Others Your Reason has been Reported to the admin. X To post this comment you must Log In/Connect with: The Economic Times or Fill in your details: Will be displayed Will not be displayed Will be displayed Share this Comment: Post to Twitter Stories you might be interested in Subscribe to our ET Investment Opportunities SUBMIT", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://economictimes.indiatimes.com/news/international/us/poll-shocker-for-elon-musk-nate-silvers-popularity-tracker-shows-his-approval-rating-plummets-by-14-points-heres-how-the-tesla-ceo-responded/articleshow/120237669.cms", "source": "The Times of India", "published_at": "2025-04-12T16:36:42"}, {"id": 3, "title": "Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect", "content": "tesla stock crash warning: Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect - The Economic Times Benchmarks Nifty 22,828.55 429.4 FEATURED FUNDS ★★★ ★★ Canara Robeco ELSS Tax Saver Regular - Growth 5Y Return 21.85 % Invest Now FEATURED FUNDS ★★★ ★★ HSBC Large Cap Fund Direct-Growth 5Y Return 20.75 % Invest Now Enter search text: Business News › News › International › US News › Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect The Economic Times daily newspaper is available online now. Read Today's Paper Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect SECTIONS Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect Global Desk Last Updated: Apr 12, 2025, 10:06:00 PM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis Tesla stock crash warning is making headlines after Swedish billionaire Christer Gardell predicted a shocking 95% drop could hit the company. In a bold interview with EFN, Gardell called Tesla’s valuation “incomprehensible” and pointed to slowing sales, Elon Musk’s political drama, and Cybertruck struggles as red flags. While Tesla leads in EV innovation, Gardell warns the bubble could soon burst. Swedish billionaire Christer Gardell warns Tesla stock may crash 95%. He says the valuation is unrealistic and linked to Elon Musk’s controversies, falling sales, and Cybertruck struggles Swedish billionaire and hedge fund manager Christer Gardell has issued a stark warning that’s now catching the attention of Tesla investors worldwide. According to Gardell, Tesla’s market valuation is “incomprehensible” and could plummet by up to 95% — and possibly sooner than many might expect. In a recent interview with Swedish finance channel EFN, Gardell didn’t hold back. He pointed to a mix of slowing sales, rising controversy around CEO Elon Musk, and what he sees as wildly overinflated stock value. Why is Christer Gardell calling Tesla’s valuation a ticking time bomb? Tesla's current market value sits in the hundreds of billions of dollars. But Gardell, who runs activist hedge fund Cevian Capital, says that figure doesn’t align with Tesla’s core business. “Tesla, especially now with the whole Musk circus going on everywhere, is probably the most expensive stock on the global stock exchanges right now,” Gardell said in the EFN interview, as reported by Teslarati . “It could go down 95% – and maybe it should go down 95%.” He clarified that it’s hard to predict an exact timeline — “It could happen in a month, six months, a year, three years, or five years,” he said. But in his eyes, a drop is coming. And when it hits, it could be steep. Live Events What’s driving fears of a Tesla stock crash? Tesla has moved beyond just being an electric carmaker. The company now deals in robotics and AI, which are both major growth areas. But Gardell emphasized that, at its core, Tesla is still an automaker — and compared to its peers, its stock is way out of proportion. According to Companies Market Cap , Tesla’s valuation is more than triple that of major auto giants like Toyota and Volkswagen. Yet, Tesla’s recent sales trends are not keeping up. Sales have dipped in key markets, and the controversial public presence of Elon Musk hasn’t helped. As political tensions around Musk grow — especially in the U.S. — some analysts worry that Tesla’s reputation could be taking a long-term hit. That’s not just bad PR; it could mean real consequences for investor confidence. On top of that, Tesla’s highly anticipated Cybertruck is underperforming. While Musk once projected annual sales of 500,000 units, current figures suggest it’s not even hitting 10% of that. To move the product, Tesla has been forced to adjust financing options and offer more attractive interest rates to buyers. Could a Tesla crash ripple through the EV market? Despite Tesla's struggles, the broader EV market continues to thrive. In fact, Q4 2024 saw a new record for EV sales in the U.S., according to Cox Automotive . People are still switching to electric vehicles in large numbers, attracted by long-term savings and environmental benefits. But here’s the concern: If Tesla's valuation tanks, will it scare investors away from other EV companies too? It's a real risk. Gardell's worry is that an overvalued company like Tesla might damage broader investor trust in green tech if it falls too hard and too fast. Still, it's not all bad news for EV buyers. As Tesla trims prices and tweaks financing to maintain demand, competitors may follow suit. That could lead to better deals for consumers, not just from Tesla but across the EV landscape. Should investors start looking beyond U.S. tech stocks? Gardell believes the stock market imbalance between the U.S. and Europe is reaching historic levels. “The difference between American stocks and European stocks has never been greater,” he told EFN. For cautious investors, this may be a moment to reconsider their strategy. European equities, in his view, are offering more realistic valuations. And with companies in Europe also expanding into the EV and clean energy space, there may be opportunities to invest in future-forward industries without the same bubble risk. FAQs: Why did Christer Gardell warn about a Tesla stock crash ? He said Tesla’s value is too high and could drop by 95%. How could Tesla’s stock affect the electric vehicle market? A crash could shake investor trust in EV companies. (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on tesla stock crash warning christer gardell tesla prediction tesla valuation too high elon musk stock impact tesla cybertruck low sales tesla ev market risk tesla stock investor alert Tesla stock crash Christer Gardell EV sales trends (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on tesla stock crash warning christer gardell tesla prediction tesla valuation too high elon musk stock impact tesla cybertruck low sales tesla ev market risk tesla stock investor alert Tesla stock crash Christer Gardell EV sales trends (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Amtek’s Arvind Dham goes hospital hopping but ED gives a hot chase Delhivery-Ecom Express deal: A Big win for Delhivery but could Ecom Express have a longer runway? Why every large IT deal is going back to the drawing board Model Context Protocol: The secret handshake changing how businesses talk to AI The party’s over; what next? Why investors must keep in mind Marks’ ‘Pendulum Psychology’ of markets 1 2 3 View all Stories Videos N Nagendran apointed as Tamil Nadu BJP Chief Massive fire at aluminum unit in Nagpur’s Umred MIDC Tahawwur Rana in 18 day NIA custody after extradition Murshidabad protest turns violent, forces deployed President Trump optimistic about China trade talks Columbia student Mahmoud Khalil can be deported, US judge rules Trump says physical examination ‘went well' Gurugram storm horror: Pole falls on moving car Explosion near Hellenic train HQ in Athens, no injuries Trump discusses tariffs, Iran & health on Air Force One 1 2 3 Latest from ET Tariffs can boost manufacturing, but are India's factories ready? Trump spares phones, PCs, chips from reciprocal tariffs IPL | Sunrisers Hyderabad vs Punjab Kings Trending US News Dow Jones futures good april fools jokes Easter 2025 date Time social security changes Crypto market today March 5 Ash Wednesday Popular in International Pentagon to terminate $5.1 billion in IT contracts with Accenture, Deloitte, others The Chosen Season 5: When will it release online? Here’s all about release on Prime Video, The Chosen’s official app and website Trump’s tariff buffer: Phones, PCs, chips spared from 'reciprocal' tariffs Mark Cuban urges Americans to hoard essentials before tariff shockwave hits; here’s what to stockpile while you still can Who was Agustín Escobar, the Siemens CEO who died in the Hudson River helicopter crash? Enter search text: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Name Reason for reporting: Foul language Slanderous Inciting hatred against a certain community Others Your Reason has been Reported to the admin. X To post this comment you must Log In/Connect with: The Economic Times or Fill in your details: Will be displayed Will not be displayed Will be displayed Share this Comment: Post to Twitter Stories you might be interested in Subscribe to our ET Investment Opportunities SUBMIT", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://economictimes.indiatimes.com/news/international/us/swedish-hedge-fund-billionaire-christer-gardell-issues-stark-tesla-warning-predicts-massive-valuation-crash-could-hit-sooner-than-investors-expect/articleshow/120236968.cms", "source": "The Times of India", "published_at": "2025-04-12T16:36:00"}, {"id": 4, "title": "These Georgia billionaires are some of the richest people in the world, according to Forbes", "content": "These Georgia billionaires are some of the richest people in the world, according to Forbes – WSB-TV Channel 2 - Atlanta Local These Georgia billionaires are some of the richest people in the world, according to Forbes By WSBTV.com News Staff April 12, 2025 at 12:29 pm EDT Expand Arthur Blank (L) and Dan Cathy (R) By WSBTV.com News Staff April 12, 2025 at 12:29 pm EDT ATLANTA — From sports teams to fast food to hardware, the Peach State is home to some folks with pretty deep pockets. And while many of us might not quite be billionaires just yet, a handful of Georgians already are. Forbes released its annual list of the world’s richest people earlier this week, with a total net worth between them all of $16.1 trillion. The richest man in the world saw his worth skyrocket in the last year. Tesla and SpaceX founder Elon Musk currently has a net worth of $342 billion, according to Forbes. Last year, he had a total of $195 billion, their data lists. [DOWNLOAD: Free WSB-TV News app for alerts as news breaks ] But the richest Georgians are the children of Atlanta-based Chick-fil-A founder Truett Cathy, who died in 2014. Bubba and Dan Cathy now run the fast food powerhouse together. The brothers and their sister, Trudy Cathy White, each have a net worth of $11.4 billion, which is slightly higher than last year’s $11.2 billion. Metro Atlanta-based Home Depot co-founder Arthur Blank has a current net worth of $9 billion, according to Forbes. Blank also owns the Atlanta Falcons and opened Children’s Healthcare of Atlanta - Arthur M. Blank Hospital in September . His fellow Home Depot co-founder, Bernie Marcus, passed away in November . TRENDING STORIES: Shooting suspect arrested after being hit by car outside Magic City 14-year-old boy shot, killed while standing outside his GA home Victims, suspect identified in Walmart employee shootings that left 2 dead, 1 injured Next on the list is Gary Rollins and his family, with an estimated worth of $6.9 billion. He ran Georgia-based pest control company Rollins, Inc. with his brother, Randall, who died in 2020. Rollins, Inc. is the biggest pest control company by revenue in North America, according to Forbes. Jim Kennedy is the chairman emeritus of media and automotive company Cox Enterprises. He inherited his stake in the Cox Family-owned business based in Atlanta from his mother when she died in 2007. Kennedy’s current net worth is $6.6 billion. [SIGN UP: WSB-TV Daily Headlines Newsletter ] Ben Chestnut founded the company that would become Mailchimp in Atlanta in 2001 as a side project. The Augusta native has a net worth of $5 billion. The final Georgian billionaire is the founder of Spanx, Sara Blakely. The Atlanta-based shapewear company has led Blakely to a $1.1 billion net worth. ©2025 Cox Media Group 0 View Comments Most Read 2-year-old dies after being shot in the head in southeast Atlanta neighborhood, police say Cherokee Co. man sentenced to years in prison for molesting 8-year-old girl over several months 73-year-old GA woman wanted for identity fraud Family tries to report 19-year-old missing, finds him shot to death in abandoned apartment Metro Atlanta murder suspects arrested hours away in coastal Georgia", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.wsbtv.com/news/local/these-georgia-billionaires-are-some-richest-people-world-according-forbes/6MN3C4NX75DDZE65NFG5FYO3RA/", "source": "WSB Atlanta", "published_at": "2025-04-12T16:35:44"}, {"id": 5, "title": "Everything we know about Elon Musk’s Tesla Roadster travelling through space at 16,000 mph", "content": "Everything we know about Elon Musk's Tesla Roadster travelling through space at 11,000 mph - Science - LADbible To make sure you never miss out on your favourite NEW stories , we're happy to send you some reminders Click ' OK ' then ' Allow ' to enable notifications Not now OK Love him or hate him, Elon Musk has been part of some pretty wild projects over the years. Having one of his own cars up in space is perhaps one of the most random. While the Space X founder has lost plenty on Tesla stock in recent months, with Donald Trump 's tariffs only leaving more holes in his pocket , he remains the world's richest man and probably doesn't blink twice when a couple of million evaporates from his bank account. The businessman has taken on more of a political role since Trump's return to the Oval Office. This has hardly done much for the 53-year-old's controversial image, and it seems as though the South African's best work has been beyond Earth's orbit, given the success of various space projects over the years. Running a space company and a car business simultaneously, if you've got a mind like Musk, it's likely you'd put two and two together and send a Tesla up to the stars - and that's exactly what he did in 2018. Advert The Tesla Roadster was ejected into space as a dummy payload for a Falcon Heavy test flight. It's fitted with a mannequin in a space suit called Starman - a tongue-in-cheek nod to the David Bowie classic. The Bowie song Space Oddity was also set up to play on repeat through the vehicle's sound system. The SpaceX team also chucked a Hot Wheels car and a copy of The Hitchhiker's Guide to the Galaxy inside for good measure. Elon Musk (Graeme Sloan for The Washington Post via Getty Images) Musk previously revealed exactly why he sent the Tesla Roadster skyward, saying that he hoped that humanity would end up living on other planets and that his 'descendants will be able to drag it [the car] back to a museum'. The chances of that may seem pretty low, but the more kids Musk has, the more those chances improve. Musk has also said that he wanted to put the 'silliest' thing he and his SpaceX team could think of out of Earth's orbit, and apparently they settled on a car. Gosh, Elon, your imagination knows no bounds! Anyway, after seven years in space travelling at speeds well above 10,000 mph, you might think that it's tricky to keep track of the Roadster, but fortunately, like nearly everything these days, there's a website for that. Advert The ‘Where is Roadster?’ site keeps track of the Tesla as it zooms through space. At the time of writing, it is currently 228,647,460 miles from Earth. However, it's travelling back towards its home planet at the lightning-fast speed of 16,106 mph. A real space oddity... (SpaceX via Getty Images) That means that its speed has increased by 5,000 mph in the last week alone. Maybe it's homesick and wants to get back in time for Christmas, learning an important lesson from the NASA astronauts who end up spending far too long away from Earth. So what happens when the space car does finally come back home? Well, Musk could land himself in real trouble if the Tesla does crash land back to Earth. As long as it steers clear of any humans or man-made objects and doesn't cause any damage, it seems as if the billionaire will get away with it. Hopefully it avoids the likes of Mount Kilimanjaro and Niagara Falls, too. Featured Image Credit: Tesla Topics: Elon Musk , SpaceX , Space James Moorhouse James is a NCTJ Gold Standard journalist covering a wide range of topics and news stories for LADbible. After two years in football writing, James switched to covering news with Newsquest in Cumbria, before joining the LAD team in 2025. In his spare time, James is a long-suffering Rochdale fan and loves reading, running and music. Contact him via [email protected] X @ JimmyMoorhouse Advert Advert Advert Choose your content: an hour ago 2 hours ago an hour ago Long-term health impacts of taking ketamine after two women left with serious bladder problems Experts warn ketamine can cause 'irreversible psychological impairment' as well as horrific effects on your physical health News an hour ago Man killed in major explosion which destroyed house A major incident was declared in Worksop last night News breaking an hour ago Counter terror police investigating after Manchester Arena bomb plotter ‘attacks three prison guards with hot cooking oil’ Hashem Abedi 'hurled hot cooking oil' at the officers and left two of them with 'severe stab wounds' News 2 hours ago Donald Trump reveals what will happen if countries don’t ‘make a deal for both parties’ on tariffs during 90-day pause Trump placed a 90-day pause on most of the tariffs for nearly every country News Elon Musk says it'll soon be 'possible' to travel from London to New York in just 30 minutes at mind-blowing speeds Elon Musk hit back at hacking group Anonymous after they issued warning about his plans for Twitter Reason why humans haven't orbited poles of Earth before as SpaceX crew make history NASA astronaut makes comment to Elon Musk and Donald Trump in first interview since returning from space", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.ladbible.com/news/science/elon-musk-space-science-tesla-latest-roadster-942872-20250411", "source": "LADbible", "published_at": "2025-04-12T16:34:53"}, {"id": 6, "title": "Today's news and jokes", "content": "Super Punch: Today's news and jokes Saturday, April 12, 2025 Today's news and jokes throwback to 6th grade https://t.co/fjwRETFt5q pic.twitter.com/5e2bPwe13n — Sam Alberti (@sam_alberti) March 8, 2025 Mass Games Womp-womp, they DOGE'd the tariffs. www.cnbc.com/2025/04/11/c... [image or embed] — David Dayen ( @ddayen.bsky.social ) April 11, 2025 at 10:52 AM Hours ago, @politico.com revealed that DOGE is working with DHS on automating mass deportation efforts — likely explaining why many US citizens, green card holders, and even a Canadian (in Canada) got threatening emails last night terminating “your parole” and telling them to leave the US in 7 days. [image or embed] — Aaron Reichlin-Melnick ( @reichlinmelnick.bsky.social ) April 11, 2025 at 7:53 PM The U.S. military shifted a Patriot battalion from the Indo-Pacific to the Middle East, requiring at least 73 flights, according to one commander. https://t.co/iS1dTzRptt — Axios (@axios) April 11, 2025 An unexamined side effect of encouraging every single American to be a hustle grindset small business owner is that a lot more Americans have now interacted with Chinese factories and know they're responsive and easy to work with. [image or embed] — Chris Person ( @papapishu.bsky.social ) April 11, 2025 at 9:56 AM Funniest trade war outcome would be Trump negotiates zero tariff free trade agreement with China and we’re flooded with BYD and Xiaomi EVs — Deva Hazarika (@devahaz) April 11, 2025 Soboroff bows out as L.A. fire recovery czar, with some parting shots - Los Angeles Times https://t.co/aNJJz6jLtO — Hector Becerra (@hbecerraLATimes) April 12, 2025 (\"He said he doesn’t know why he was shut out of city recovery planning, though it was 'possible' that the mayor’s office found him 'too aggressive.'\") This is startling: About 34% of applicants to California's Community College system were likely fake in the last calendar year, and have been scamming millions of dollars in state and federal financial aid. https://t.co/8BsiOeXtb9 — Emily Hoeven (@emily_hoeven) April 8, 2025 (\" A spokesperson from the Chancellor’s Office said that its fraud detection and prevention has caught more suspected scammers than ever during the application process and stopped them there. However, even with that getting better, financial aid fraud is getting worse\") https://t.co/qrLlNMyg4k — The Information (@theinformation) April 10, 2025 (Sites that game Google to try to grab traffic are in trouble because Google is trying to eliminate the need to click through search results) (But also this, \"OpenAI CEO Sam Altman has said the company could eventually take a cut of sales ChatGPT helps facilitate\") Gonna take this opportunity to say that I can personally deliver no script for as little as 7 million, and I know some other writers who can do it for as little as five million. [image or embed] — Paul Tobin ( @paultobin.bsky.social ) April 10, 2025 at 2:20 PM (\" Prime Video signed up [the creator] to a megabucks exclusivity deal in 2019 worth $20 million a year, but since then it has produced no shows or films from [her]\") Nearly 200 cows disappeared. The case remains cold. @jspetzlerphoto https://t.co/S7KknPepxN pic.twitter.com/vMp0t0TeHT — Washington Post Photo (@WashPostPhoto) April 10, 2025 (Long article about how the business works and why the investigation into presumed cattle rustling has struggled. \" Out in Montrose County , [the Montrose County Sheriff’s Office's administrative sergeant] is hoping the sheriff might let him purchase a horse to use for exploring the plateau once the snow melts. Any tire tracks will most likely be lost to moisture, any carcasses to predators or bugs. But Searcy figures he might come across a makeshift corral or some other sign. And maybe someone will talk.\") About as many people watched KRAVEN THE HUNTER on Netflix than THE ELECTRIC STATE on the same platform during their \"debut streaming\" week. [image or embed] — Peter Labuza ( @labuzamovies.com ) April 11, 2025 at 4:37 PM (And since it was a Sony movie, it wasn't even available on the ad tier) The number of private jets at Augusta Airport for the Masters is absurd. 🤯 (📹: Instagram/ bnatower) pic.twitter.com/KnTfdFb5dm — Golf Digest (@GolfDigest) April 10, 2025 Some stars on the PGA Tour are reminding members of the media that they won’t do anything they don’t want to do—including talking. @MMcCarthyREV has more ⬇️ — Front Office Sports (@FOS) April 10, 2025 ESPN's coverage of Thursday's first round of The Masters Tournament averaged 2.3 million viewers. That's a 28% drop from 3.2 million for last year's first round--when ratings magnet Tiger Woods was in the field. — Michael McCarthy (@MMcCarthyREV) April 11, 2025 Watching FP2 now, Fernando Alonso had a steering wheel issue and it came off while he was on track [image or embed] — CJ Fogler ( @cjzero.bsky.social ) April 11, 2025 at 12:21 PM Bill Kennedy has to interrupt his review explanation to shoo away Julius Randle who videobombs him anyway 😂😂 [image or embed] — CJ Fogler ( @cjzero.bsky.social ) April 11, 2025 at 7:53 PM Getty's went back into their archives and pulled more photos from this dance event! Can we match these dancers to the original photo? www.gettyimages.co.uk/detail/news-... www.gettyimages.co.uk/detail/news-... www.gettyimages.co.uk/detail/news-... [image or embed] — Aric Toler ( @aric.bsky.social ) April 10, 2025 at 7:33 AM (Tracing the group photo from Kubrick's The Shining) Garlic Octopus Roll in the Italian 2nd division at SSC Bari 💷 £4.50 pic.twitter.com/t38NHZjv6H — Sports Scran (@SportScran) March 7, 2025 The template pic.twitter.com/BJZdbokktZ — Neil Renic (@NC_Renic) March 5, 2025 I grew up off Coldwater Canyon, but among LA's storied canyon roads, Laurel, Topanga & Benedict are far more associated with literary, music, true-crime & pop-culture history. Thus I was thrilled to see \"Coldwater Canyon\" ominously cited in the film noir \"Too Late for Tears\"! pic.twitter.com/lJnAgfR7wR — L.A. Dork (@la_dorkout) March 8, 2025 “Cultural Inbreeding” is the term I like to use the most. There comes a point where the outsider perception of Dinosaurs post-1993 has become so Jurassic-Coded that the franchise has effectively become ill by the original's own success, Jurassic Park is a product of its time. https://t.co/67n30ZQSfC pic.twitter.com/TwbEMb3Hhu — Omar García (@GMaster1984) March 8, 2025 To me, scenes like this are what make animation believable. The real life observation of trying to get your dog to take it’s medicine, translated onto a fantastical dragon, creates a bridge between reality and fantasy that lets one accept all of the other fantasy as real. 🧵 https://t.co/g7YzVXZdWz — Kabir Kukathas 🐘 🍉 (@kubbabeer) March 7, 2025 @suzanspartan Elon’s Plan To Deport #tesla #elonmusk #mexican #selfdriving #plan #cybertruck #mexico #donttrustanyone ♬ TESLA - Clave Especial @atlarchiethecorgi besties forever 💘 #comfortdog #dogsoftiktok #momsoftiktok #cute #love #corgi #babyboy #11monthsold #corgisoftiktok #corgipuppy #boymom #dogmom ♬ original sound - ౨ৎ * More funny posts . Labels: funny Newer Post Older Post Home Contact me at jstruan at gmail.com. Sign up for the newsletter As an Amazon Associate I earn from qualifying purchases. Please support Super Punch by following the affiliate links and buying from Amazon and eBay . This site also uses tracking cookies. Logo by Adam Koford . Download the Super Punch Chimera paper toy. Search This Blog Blog Archive ▼ 2025 (423) ▼ April (62) Today's news and jokes A good line from Arkady's Martine's short story \"T... Lego LSTR Replika from Signalis (with instructions) The Marathon reveal cinematic short is super cool Bloomberg's weekly news trivia game is fun Humble Bundle featuring Hellboy Universe comics Today's news and jokes Training on Cirque du Soleil's shifting stage Patch for a mission to put an x-ray machine in space New Humble Bundle featuring the Train Sim World vi... Tom Bloom (Kill Six Billion Demons) made his vario... Today's news and jokes This typography is hitting the spot while I wait f... Here's Toy Nacelle's optimistic statement about ta... \"The Lost Years Casey Jones\" and a bunch of other ... New Humble Bundle features Wheel of Time novels Marvel Legends Hulk with new type torso to allow g... Today's news and jokes Fan-commissioned poster for Coppolla's Bram Stoker... Season two of Interview with the Vampire is stream... Truly demented new Star Wars character maquette by... New Humble Bundle for \"all cyberpunks, adrenaline ... Today's news and jokes Photos from the Harryhausen exhibit Evil Lego Starfish perhaps Today's news and jokes Griffith Observatory Minecraft map This is what was in the Marathon gift box sent out... Apple's Murderbot series includes scenes from The ... Today's news and jokes Tauntaun popcorn bucket Marathon art and fan art Images from yesterday's Severance event Links to some of the 2025 Hugo Award nominees New Humble Bundle features Vampire Hunter D comics Today's news and jokes Custom toy of Richard Scarry's mice in cheese car \"Private Equity: A Memoir by Carrie Sun\" is $1.99 Trinity's heart hair; watch some USWNT players esc... They spent a year trying to figure out where the o... Today's news and jokes Joan of Arc sweater New Humble Bundle featuring video games by Armor G... Love this Marathon runner fan art Today's news and jokes Floating ethereal curtain Neal Stephenson's most recent novel Polostan is $1... Good henna Grendel Prime and other action figures canceled wi... The new G.I. Joe figures by Super 7 are up for pre... Emo Symbiote Tobey Maguire Marvel Legends figure u... Today's news and jokes Free access to the Vatican Library’s digitized col... New Humble Bundle features \"In Other Waters\" and o... Clearance sale on deluxe NBA figures and accessori... Entertainment Earth has some damaged box G.I. Joe ... Today's news and jokes Hot chocolate topped with a chocolate Mayan temple A Val Kilmer movie available on Prime I haven't se... The Humble monthly bundle features Aliens Dark Des... Today's news and jokes Some impressive Lego monsters ► March (127) ► February (112) ► January (122) ► 2024 (2071) ► December (134) ► November (146) ► October (163) ► September (182) ► August (165) ► July (184) ► June (164) ► May (162) ► April (162) ► March (216) ► February (208) ► January (185) ► 2023 (2328) ► December (183) ► November (199) ► October (185) ► September (158) ► August (187) ► July (204) ► June (192) ► May (230) ► April (201) ► March (237) ► February (167) ► January (185) ► 2022 (1919) ► December (177) ► November (173) ► October (149) ► September (149) ► August (172) ► July (139) ► June (123) ► May (168) ► April (164) ► March (170) ► February (162) ► January (173) ► 2021 (2004) ► December (159) ► November (144) ► October (163) ► September (168) ► August (172) ► July (179) ► June (182) ► May (180) ► April (172) ► March (157) ► February (152) ► January (176) ► 2020 (2170) ► December (198) ► November (206) ► October (189) ► September (172) ► August (177) ► July (200) ► June (155) ► May (173) ► April (173) ► March (193) ► February (169) ► January (165) ► 2019 (1895) ► December (100) ► November (121) ► October (135) ► September (177) ► August (213) ► July (149) ► June (138) ► May (167) ► April (211) ► March (198) ► February (153) ► January (133) ► 2018 (2072) ► December (191) ► November (186) ► October (180) ► September (152) ► August (200) ► July (204) ► June (106) ► May (157) ► April (220) ► March (129) ► February (150) ► January (197) ► 2017 (1844) ► December (144) ► November (181) ► October (196) ► September (173) ► August (192) ► July (213) ► June (168) ► May (138) ► April (131) ► March (94) ► February (112) ► January (102) ► 2016 (1251) ► December (116) ► November (135) ► October (101) ► September (131) ► August (142) ► July (112) ► June (129) ► May (72) ► April (53) ► March (90) ► February (84) ► January (86) ► 2015 (1009) ► December (75) ► November (70) ► October (81) ► September (60) ► August (74) ► July (93) ► June (95) ► May (92) ► April (81) ► March (75) ► February (95) ► January (118) ► 2014 (921) ► December (63) ► November (82) ► October (90) ► September (66) ► August (66) ► July (48) ► June (71) ► May (84) ► April (72) ► March (94) ► February (83) ► January (102) ► 2013 (546) ► December (86) ► November (51) ► October (63) ► September (33) ► August (37) ► July (35) ► June (44) ► May (34) ► April (33) ► March (37) ► February (40) ► January (53) ► 2012 (632) ► December (42) ► November (53) ► October (58) ► September (57) ► August (70) ► July (59) ► June (72) ► May (52) ► April (39) ► March (28) ► February (63) ► January (39) ► 2011 (317) ► December (17) ► November (17) ► October (18) ► September (12) ► August (17) ► July (14) ► June (27) ► May (34) ► April (50) ► March (24) ► February (47) ► January (40) ► 2010 (430) ► December (41) ► November (28) ► October (24) ► September (49) ► August (60) ► July (47) ► June (46) ► May (37) ► April (45) ► March (16) ► February (11) ► January (26) ► 2009 (341) ► December (13) ► November (34) ► October (39) ► September (22) ► August (32) ► July (21) ► June (20) ► May (18) ► April (17) ► March (50) ► February (43) ► January (32) ► 2008 (266) ► December (40) ► November (14) ► October (14) ► September (17) ► August (17) ► July (47) ► June (26) ► May (16) ► April (12) ► March (12) ► February (23) ► January (28) ► 2007 (144) ► December (14) ► November (17) ► October (10) ► September (18) ► August (26) ► July (19) ► June (15) ► May (10) ► April (12) ► March (3)", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.superpunch.net/2025/04/todays-news-and-jokes_0229904203.html", "source": "Superpunch.net", "published_at": "2025-04-12T16:00:00"}, {"id": 7, "title": "Tesla accused of using sneaky tactic to dodge car repairs", "content": "Tesla accused of using sneaky tactic to dodge car repairs Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Tesla accused of using sneaky tactic to dodge car repairs thestreet.com/automotive/tesla-accused-of-using-sneaky-tactic-to-dodge-car-repairs has been embroiled in controversy over the past few months. Since Tesla CEO Elon Musk joined the Trump administration in January, heading the Department of Government Efficiency (DOGE), many consumers have turned against the automaker due to Musk’s recent efforts to shrink the… This story appeared on thestreet.com , 2025-04-12 15:47:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/9cb27d4d716328d4", "source": "Biztoc.com", "published_at": "2025-04-12T15:52:08"}, {"id": 8, "title": "Trump administration says it will exclude some electronics from 'reciprocal' tariffs", "content": "Trump administration says it will exclude some electronics from reciprocal tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news LATEST NEWS Nakia Anderson 11 minutes ago Detroit police searching for missing 15-year-old girl Read full article: Detroit police searching for missing 15-year-old girl A foot chase through rush hour traffic by a phone theft suspect ended in an arrest in West Bloomfield. 5 hours ago West Bloomfield foot chase through rush hour traffic ends in arrest of phone theft suspect Read full article: West Bloomfield foot chase through rush hour traffic ends in arrest of phone theft suspect Once inside, what Detroit Pit Crew rescuers found was heartbreaking 5 hours ago ‘Repulsive, unacceptable’: Realtor shocked to find emaciated dog in Detroit basement Read full article: ‘Repulsive, unacceptable’: Realtor shocked to find emaciated dog in Detroit basement Rain showers will stick around Metro Detroit through the end of the weekend 5 hours ago Rain showers stick around Metro Detroit for the end of the weekend, start of next week Read full article: Rain showers stick around Metro Detroit for the end of the weekend, start of next week CLICK ON DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Sign up for our Events Newsletter! Sign Up Business Trump administration says it will exclude some electronics from reciprocal tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos CLICK ON DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.clickondetroit.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WDIV ClickOnDetroit", "published_at": "2025-04-12T15:26:29"}, {"id": 9, "title": "Elon Musk's Cybertruck Is Controversial, But Kids Love It", "content": "Elon Musk's Cybertruck Is Controversial, But Kids Love It Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Elon Musk's Cybertruck Is Controversial, But Kids Love It benzinga.com/tech/25/04/44778243/elon-musks-cybertruck-is-controversial-but-kids-love-it The Tesla Cybertruck may be polarizing among adults, but it is a hit among children. What Happened: Children are enamored with the Cybertruck, the brainchild of Elon Musk and his company Tesla Inc. (NASDAQ:TSLA). The vehicle has been at the center of public opinion, with some owners… This story appeared on benzinga.com , 2025-04-12 15:01:06. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/d851771db419bfe9", "source": "Biztoc.com", "published_at": "2025-04-12T15:18:43"}, {"id": 10, "title": "Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs", "content": "Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS FILE CDC 52 minutes ago Cruise season comes with ‘Ferrari of viruses’ Read full article: Cruise season comes with ‘Ferrari of viruses’ No description available 2 hours ago Measles risk increases as more families travel during spring break Read full article: Measles risk increases as more families travel during spring break No description available 18 hours ago Shark bite victim airlifted from Everglades National Park Read full article: Shark bite victim airlifted from Everglades National Park Fantasy 5 22 hours ago Winning Fantasy 5 ticket sold at Miami-Dade food store Read full article: Winning Fantasy 5 ticket sold at Miami-Dade food store Business Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news The website for the nonprofit GiveDirectly is displayed on a laptop on Nov. 26, 2024 in New York. (AP Photo/Peter Morgan) (Peter Morgan, Copyright 2024 The Associated Press. All rights reserved) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Loading... Recommended Videos", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.local10.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WPLG Local 10", "published_at": "2025-04-12T15:08:20"}, {"id": 11, "title": "Smartphones, laptops to be exempt from Trump administration’s ‘reciprocal’ tariffs", "content": "Smartphones, laptops to be exempt from Trump administration’s ‘reciprocal’ tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news , Politics , Donald Trump , Tariffs , Economy , Consumer , Government LATEST NEWS \"Health is Wealth\" event in Ocoee 1 hour ago ‘Health is Wealth’ event blends wellness and community service in Ocoee Read full article: ‘Health is Wealth’ event blends wellness and community service in Ocoee As Whispering Winds clears debris, residents face delays and frustration 13 hours ago Debris gone, frustration remains: Longwood’s recovery crawl Read full article: Debris gone, frustration remains: Longwood’s recovery crawl Incident happened at 2271 North Semoran Blvd. 14 hours ago Victims found safe after being kidnapped at Orange County Walmart, deputies say Read full article: Victims found safe after being kidnapped at Orange County Walmart, deputies say 2 people were injured in a fire in Fruitland Park 15 hours ago Child among 2 injured in Lake County house fire, officials say Read full article: Child among 2 injured in Lake County house fire, officials say SHOP DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Sign up for our events newsletter: Sign Up Business Smartphones, laptops to be exempt from Trump administration’s ‘reciprocal’ tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 10:05 AM Tags: Business , Technology , U.S. news , Politics , Donald Trump , Tariffs , Economy , Consumer , Government Smartphones at a store. (Provided by Consumer Reports) The Trump administration late Friday said it would exclude electronics like smartphones and laptops from reciprocal tariffs , a move that could help keep the prices down for popular consumer electronics that aren’t usually made in the U.S. It would also benefit big tech companies like Apple and Samsung and chip makers like Nvidia, setting the stage for a likely tech stock rally on Monday. Recommended Videos U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in their massive plan to put tariffs in place on goods from most countries. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” It is not clear how long the exemption will last or if separate tariffs will be negotiated on the various products. The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, It would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broad this time, triggering a meltdown in the market values of Apple and other technology powerhouses. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the combined Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. Some of the losses eased this past Wednesday when Trump paused the tariffs outside of China, paring the lost value in the Magnificent Seven to $644 billion, or a 4% decline, from April 2. The electronics exemption also should relieve consumer worries that the China tariffs would result in hefty price hikes on smartphones and other devices that have become essential tools of modern living, It’s the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration’s and help propel an already booming industry to even greater heights. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move takes off “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. “President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops,\" Leavitt said in an emailed statement. She said the administration has secured U.S. investments from tech companies including Apple, TSMC and Nvidia and these companies are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment Saturday. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Loading... Recommended Videos SHOP DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.clickorlando.com/business/2025/04/12/smartphones-laptops-to-be-exempt-from-trump-administrations-reciprocal-tariffs/", "source": "WKMG News 6 & ClickOrlando", "published_at": "2025-04-12T15:02:12"}, {"id": 12, "title": "Is Tesla Stock a Buy Now?", "content": "Is Tesla Stock a Buy Now? Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Is Tesla Stock a Buy Now? finance.yahoo.com/news/tesla-stock-buy-now-141500486.html In This Article: It's been a chaotic week for investors. The Dow Jones, the S&P 500, and the Nasdaq Composite all saw one of the worst multi-day stretches in years. This comes as a trade war escalated between the U.S. and its major trade partners, with China and the E.U. responding in… This story appeared on finance.yahoo.com , 2025-04-12 14:15:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/b94b4a1c7ee8a3ab", "source": "Biztoc.com", "published_at": "2025-04-12T14:35:15"}, {"id": 13, "title": "Elon Musk faces accusations from major tech rival", "content": "Elon Musk faces accusations from major tech rival Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Elon Musk faces accusations from major tech rival thestreet.com/technology/elon-musk-faces-accusations-from-major-tech-rival Things haven’t been going well for Elon Musk lately, and this week hasn’t been an exception. After a highly volatile trading week, Tesla stock is still struggling against difficult market conditions. Even its lack of direct exposure to the recently imposed auto industry tariffs hasn’t… This story appeared on thestreet.com , 2025-04-12 14:07:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/81f439ad1b48d33c", "source": "Biztoc.com", "published_at": "2025-04-12T14:23:35"}, {"id": 14, "title": "The xAI–X merger is a good deal — if you’re betting on Musk’s empire | TechCrunch", "content": "The xAI–X merger is a good deal — if you’re betting on Musk’s empire | TechCrunch The xAI–X merger is a good deal — if you’re betting on Musk’s empire | TechCrunch Image Credits: Getty Images AI The xAI–X merger is a good deal — if you’re betting on Musk’s empire Rebecca Bellan 7:00 AM PDT · April 12, 2025 When Elon Musk announced that his AI startup, xAI, had acquired his social media company, X (formerly known as Twitter), in an all-stock deal , it raised some eyebrows. But in many ways, the deal made sense. xAI’s chatbot, Grok, was already deeply integrated with X, X was floundering financially , and Musk needed a way to make his $44 billion Twitter acquisition look less like an impulsive takeover and more like a strategic play for AGI dominance. It also pointed to something deeper about how Musk’s empire works: investing in any one of his companies isn’t about a quick return on investment. It’s about buying into the mysticism around Musk and swallowing whole a narrative of success that outpaces the actual numbers. Some call it a grift , pointing to Musk’s history of overpromising and underdelivering . But the market is increasingly more tolerant – welcoming, even – of narrative-led investments, particularly when the thread that ties the tale together is one of the president’s right-hand men. “All of Elon’s companies today are basically one company,” Yoni Rechtman, a principal at Slow Ventures, told TechCrunch. “It’s all already Elon, Inc. There are people who work across multiple companies simultaneously. They share a web of capital connections. They do business with one another, and he treats them all effectively as one company. So [the xAI-X merger] just ends some of the fiction that the two businesses were separate.” The thinking among Musk bulls like Ron Baron, the founder of investment management firm Baron Capital, is that “every single thing [Musk] does is helping everything else he does,” as Baron phrased it . Other businesses under Musk’s control include Tesla, SpaceX, The Boring Company, and Neuralink – some of which reportedly share resources . “When [Musk] bought Twitter, did he have in his mind that there’s an opportunity to have this data, a tremendous value for licensing? When he decided he wanted to go to Mars with SpaceX, did he really think initially that there’s a real opportunity here for the internet around the world, and there’s gonna be hundreds of billions of dollars of revenue opportunity? When he started off with EVs for Tesla, did he really think that this is gonna merge into self-driving, where you can make hundreds of billions of dollars a year of extra profits, and Grok […] and you’re gonna have connected cars all around the world? […] All these businesses link up. It’s the ecosystem. It’s the Elon ecosystem, and I think it’s really interesting when you look at it that way.” Baron Capital has invested across Musk’s ecosystem, an example of the investor crossover between the billionaire’s various companies. Firms like 8VC, Andreessen Horowitz, DFJ Growth, Fidelity Investments, Manhattan Venture Partners, Saudi Arabia’s PIF, Sequoia Capital, Vy Capital, and others also hold positions throughout Musk’s corporate web. That brings us back to the xAI-X deal. Pundits questioned how the acquisition could value X at $33 billion, more than triple its valuation just a few months ago, and how it could value xAI at $80 billion considering the AI company reportedly has little in the way of revenue. But valuations aren’t always based on what exists today. Rather, they take into account what investors are hoping for – and that’s particularly true when it comes to Musk’s ventures. Just look at Tesla. The electric vehicle maker has been treated like a tech stock for years despite the fact that it has automaker margins , based largely on the belief that Tesla will one day unlock groundbreaking autonomy in the form of self-driving cars and humanoid robots. “The reason why [Tesla’s] stock trades at 80 times earnings and the comp group trades at 25 times earnings is that people are making a bet on the long term, and it’s not about what happens to numbers this year,” Gene Munster, managing partner at Deepwater Asset Management, told TechCrunch. “That’s one of Elon’s superpowers, this ability to keep investors engaged for the long term.” Munster’s firm has invested in X, xAI, and Tesla. It’s exactly the type of all-in Musk backer that stands to benefit the most from a deal like xAI buying X, assuming Musk can indeed deliver on his pledge of marrying X’s real-time data trove and distribution platform with xAI’s infrastructure and AI expertise. Of course, consolidated value also comes with increased risk. Dan Wang, a professor at Columbia Business School whose research lies at the intersection of business and society, told TechCrunch that the biggest immediate risk factor for investors is the ongoing lawsuit that X is facing from the Securities and Exchange Commission (SEC). The suit accuses Musk of misleading investors by delaying the disclosure of his previous investments in Twitter. The SEC has argued that this allowed Musk to buy more Twitter shares at artificially low prices. Wang listed a few other risk considerations, such as anticompetition and user privacy concerns, particularly regarding how X quietly opted all users into data collection for AI model training. The opt-in change has already raised the ire of one regulator, Ireland’s DPC , which recently began investigating it as a potential breach of Europe’s GDPR law. “Another kind of risk here is that there isn’t a consensus framework for how the AI market is going to be regulated, but you’re already seeing traces of this in Europe and, up until recently, in California,” Wang said. “A lot of these frameworks have to do with how AI models are deployed in terms of distributing information […] They ascribe responsibility to the companies that are creating AI models, as well as providing access to those models.” Musk might also simply lose interest in a project, Rechtman said. “I think that is what a lot of Tesla shareholders are feeling right now,” he said, “where for the last several months, Elon’s number one company has been the Trump campaign, and his other projects have languished.” When asked about some of these risk factors, Munster appeared nonplussed. He suggested they’re inconsequential given the enormity of, for example, xAI’s value proposition and potential to become a dominant player in AI. “We’re betting the firm on the belief that AI is going to be more transformative than what people think,” he said. “What is the value […] of one of the four brains that the world is going to run on?” Rechtman said that Musk bulls aren’t blindly loyal, per se, but simply trust in Musk’s superpower to “bend capital markets to his will” in a way that allows him to do things and build businesses that nobody else can. “The people who are in these businesses have just gone long Elon, and they will continue to go long Elon,” Rechtman said. “So it’s not surprising to me that they will just continue to tell you that the emperor is wearing clothes.” Not for nothing, buying into Musk’s more speculative bets, like X, is one way to potentially unlock more investment opportunities in the Muskverse, Rechtman said. “SpaceX is a real thing, and it will never go public,” he said. “So the only way to invest in SpaceX is to get access to the tenders. And the only way to get access to the tenders is to be in Elon’s good graces.” Topics AI , Elon Musk , Grok , Social , X , xAI Rebecca Bellan Senior Reporter Rebecca Bellan is a senior reporter at TechCrunch, where she covers Tesla and Elon Musk’s broader empire, autonomy, AI, electrification, gig work platforms, Big Tech regulatory scrutiny, and more. She’s one of the co-hosts of the Equity podcast and writes the TechCrunch Daily morning newsletter. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca has invested in Ethereum. View Bio View Comments Most Popular OpenAI co-founder Ilya Sutskever’s Safe Superintelligence reportedly valued at $32B Anthony Ha Trump exempts smartphones, laptops, and semiconductors from new tariffs Anthony Ha Week in Review: Jeff Bezos’ secret EV startup Karyne Levy The most interesting startups showcased at Google Cloud Next Julie Bort Hacked documents reveal guide to serving Elon Musk on private jets Rebecca Bellan OpenAI will soon phase out GPT-4 from ChatGPT Kyle Wiggers Fintech founder charged with fraud after ‘AI’ shopping app found to be powered by humans in the Philippines Charles Rollet Loading the next article Error loading the next article", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://techcrunch.com/2025/04/12/the-xai-x-merger-is-a-good-deal-if-youre-betting-on-musks-empire/", "source": "TechCrunch", "published_at": "2025-04-12T14:02:48"}, {"id": 15, "title": "The Trump administration excludes smartphones along with selected computers and laptops from reciprocal tariffs", "content": "The Trump administration excludes smartphones along with selected computers and laptops from reciprocal tariffs Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? The Trump administration excludes smartphones along with selected computers and laptops from reciprocal tariffs t.co/OtgbMJ4QLC This story appeared on t.co , 2025-04-12 13:39:43.381000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/6c26ba1cc5531ece", "source": "Biztoc.com", "published_at": "2025-04-12T13:39:43"}, {"id": 16, "title": "Blaze Triggers Alarm Over Rapid Growth of Big Batteries", "content": "Blaze Triggers Alarm Over Rapid Growth of Big Batteries Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Blaze Triggers Alarm Over Rapid Growth of Big Batteries bloomberg.com/news/articles/2025-04-12/blaze-triggers-alarm-over-rapid-growth-of-big-batteries This story appeared on bloomberg.com , 2025-04-12 13:30:03.034000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/75753d83f1e0bbea", "source": "Biztoc.com", "published_at": "2025-04-12T13:39:20"}, {"id": 17, "title": "‘You’ll dry out soon...’: Indian student has a stark message for US aspirants chasing US degrees on loans", "content": "‘You’ll dry out soon...’: Indian student has a stark message for US aspirants chasing US degrees on loans - ‘You’ll dry out soon...’: Indian student has a stark message for US aspirants chasing US degrees on loans BusinessToday Business Today BT Bazaar India Today Northeast India Today Gaming Cosmopolitan Harper's Bazaar Brides Today Ishq FM Aaj Tak GNTTV iChowk Kisan Tak Lallantop Malyalam Bangla Sports Tak Crime Tak Aajtak Campus Astro tak Clear all Search COMPANIES No Data Found INDICES ANALYSIS No Data Found AMCs No Data Found MUTUAL FUNDS No Data Found NEWS No Data Found Sign in Subscribe Home Budget 2025 Magazine Cover Story Editor's Note Deep Dive Interview The Buzz BT TV Market Today Easynomics Drive Today BT Explainer Market Today Trending Stocks Indices Stocks List Stocks News Share Market News IPO Corner Tech Today Unbox Today Authen Tech Tech Deck Tech Shorts Money Today Tax Investment Insurance Tools & Calculator Mutual Funds Industry Banking IT Auto Energy Commodities Pharma Real Estate Telecom Visual Stories BT Reels PMS Today US News India UPSTART Weather BT Shorts NRI Education Election events Special News LATEST Trends ‘You’ll dry out soon...’: Indian student has a stark message for aspirants chasing US degrees on loans Feedback ‘You’ll dry out soon...’: Indian student has a stark message for aspirants chasing US degrees on loans The student didn’t sugarcoat the costs or risks, warning that $30/hour is not enough to live comfortably when factoring in rent, insurance, groceries, and other essentials. Join Our WhatsApp Channel Business Today Desk Updated Apr 12, 2025, 7:09 PM IST One brutally honest Reddit post, now viral, cuts through the optimism often sold with overseas education. Taking out an education loan to chase the American dream might seem like a calculated risk — but for many Indian students, it’s becoming a gamble with high personal and financial stakes. Rising tuition costs, unforgiving interest rates, and a harsh job market can turn that dream into a prolonged period of debt, stress, and isolation. Related Articles 'Don’t make my mistakes...': Indian MBA grad in UK warns others, shares sobering lessons from 8-year stay 'I want to go take a job somewhere in US': Nikhil Kamath stuns Bill Gates with billionaire-level FOMO BlackRock CEO warns US may already be in recession as markets reel from tariff fallout One brutally honest Reddit post, now viral, cuts through the optimism often sold with overseas education. It's a raw, first-hand account from an Indian student in the US, who says it like it is: don’t come here unless you're fully prepared to weather the storm. In a viral Reddit post advising Indian students planning to study in the US, a student with a Master of Science degree offered a no-holds-barred account of what it’s really like to pursue higher education abroad with the help of a loan. “My Indian perspective is don't take loan and come here coz you ll dry out soon if you can't find anything solid,” the post began. “I do see many people who get job but I see a lot more without right now.” The student didn’t sugarcoat the costs or risks, warning that $30/hour is not enough to live comfortably when factoring in rent, insurance, groceries, and other essentials. “There are people who have done some illegitimate jobs as they ran out and few got caught and had their sevis terminated,” the user wrote, referencing cases where visa violations led to deportations. Housing conditions during studies were described as cramped and costly. “If you are in the bay one shared room is shared by 3 people where each pay 600 dollars min each excluding utils when they are studying,” the post said. Internship and job opportunities, the user added, come with a bureaucratic maze and skepticism from employers unwilling to sponsor visas. “You’ll see many jobs which you'd fit perfect for say that they don't sponsor and you not to apply.” Burnout is real, the post emphasized, especially with new H-1B fees jumping to $2,500. “The companies aren't trying a lot.” Mental health challenges were also starkly laid out. “I am literally living paycheck by paycheck as I took a huge loan with an interest of 12/annum...There are many lonely days. If you get sick, you don't got nobody to take care of you...Therapists here charge 100-200+$/hr, insurance won't cover.” Despite applying for 500 internships, the user reported landing only two interviews. “I code and social better than people with no experience who got into meta, Tesla, Amazon with referrals...Some of them cheat,” they wrote, claiming that companies sometimes re-post filled roles to manipulate visa quotas. The post touched on subtle and overt racism, both from locals and fellow Indians. “People think Indians are cheap which is slightly true coz of all the above reasons...Also you'd face more racism from other Indians as well.” Still, the user acknowledged moments of kindness and community: “You get free stuff off the road...Many events give you free food...temples, churches and gurudwaras give you free food.” “Yes if you can bear all that. Come aboard. Cheers,” the post concluded. Other users echoed the sentiment. One wrote, “It’s hard to save money here...If you came to US a decade ago, it was all worth it, but sure won’t recommend it now.” Not everyone agreed with the bleak tone. “Why do everyone here thinks that all students are doing cs...US is the only place, which has most opportunities,” a user countered. Another added, “Civil companies are actively hiring...I agree that eventually everyone would have to return back to India unless they marry someone there.” Published on: Apr 12, 2025, 7:08 PM IST Subscribe To Newsletter Follow Us on Channel × TOP STORIES TOP VIDEOS Economy Corporate Markets Trending Magazine COVID-19 Infra Pharma Real Estate Stocks Auto World Education Jobs Lifestyle About us Contact us Advertise with us Privacy Policy Terms and Conditions Partners Press Releases Design Partner Copyright©2025 Living Media India Limited. For reprint rights: Syndications Today Advertisement Add Business Today to Home Screen Home Market BT TV Reels Menu Menu", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.businesstoday.in/latest/trends/story/youll-dry-out-soon-indian-student-has-a-stark-message-for-us-aspirants-chasing-us-degrees-on-loans-471823-2025-04-12", "source": "Business Today", "published_at": "2025-04-12T13:38:15"}, {"id": 18, "title": "Trump Signals US Will Skip South Africa G20 Over Land Claims", "content": "Trump Signals US Will Skip South Africa G20 Over Land Claims Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Trump Signals US Will Skip South Africa G20 Over Land Claims bloomberg.com/news/articles/2025-04-12/trump-signals-us-will-skip-south-africa-g20-over-land-claims This story appeared on bloomberg.com , 2025-04-12 13:04:58.503000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/1014a3f28d8cec1f", "source": "Biztoc.com", "published_at": "2025-04-12T13:28:37"}, {"id": 19, "title": "Tesla’s stock set for a ‘death cross’ on Monday: 3 reasons why it’s a risky buy", "content": "Tesla’s stock set for a ‘death cross’ on Monday: 3 reasons why it’s a risky buy Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? Tesla’s stock set for a ‘death cross’ on Monday: 3 reasons why it’s a risky buy marketwatch.com/story/teslas-stock-is-set-for-a-death-cross-on-monday-3-reasons-why-its-a-risky-buy-eec03334?g=952cf692-70c3-4c0b-ba99-6e03f3c2f317 This story appeared on marketwatch.com , 2025-04-12 13:17:43. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/1d4c360642eae11b", "source": "Biztoc.com", "published_at": "2025-04-12T13:28:28"}, {"id": 20, "title": "UK MPs Pass Emergency Bill to Rescue Troubled British Steel", "content": "UK MPs Pass Emergency Bill to Rescue Troubled British Steel Why is Trump's tariff exclusion controversial? How did Argentina secure an IMF loan? What triggered Meta's antitrust lawsuit? Why is Exxon stock undervalued? How will the Fed anchor inflation? How will new tech tariffs affect prices? What recession risks worry top investors? Why did Thiel endorse Trump's trade revolution? How long will tech tariff exemptions last? UK MPs Pass Emergency Bill to Rescue Troubled British Steel bloomberg.com/news/articles/2025-04-12/uk-mps-pass-emergency-bill-to-rescue-troubled-british-steel This story appeared on bloomberg.com , 2025-04-12 13:07:55.640000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/7de157df05a13235", "source": "Biztoc.com", "published_at": "2025-04-12T13:28:23"}, {"id": 0, "title": "The One Thing That Brought Trump Close to Reality This Week", "content": "Trump tariff pause: This week we learned there’s one thing that will make Trump rethink his plans, but it’s certainly not enough. Tweet Share Share Comment Photo illustration by Slate. Photo by Getty Images Plus. Sign up for the Surge , the newsletter that covers most important political nonsense of the week, delivered to your inbox every Saturday. Welcome to this week’s edition of the Surge, a newsletter about all things politics in the United States, a place that can now be considered an emerging market country. Hey, here’s some news: Your money is gone, forever. It’s called the “Art of the Deal.” At least we’ve still got Medicaid for bare-bones health ca—oops, maybe not? What a week for the American pocketbook. Democrats’ crippling addiction to nuance, meanwhile, is preventing some of them from saying the very easy sentence “Trump killed the economy.” And for ulcer-related reasons, we’re not even touching the court cases involving the Trump administration’s arbitrary kidnappings—read the Slate legal people for that. Much is going on. Can anyone—or any … thing—stop it? 1. The bond market If there’s anything that can get through to Trump … Last week, Donald Trump set in place a tariff plan that, if carried through, would at least cause a recession and at most put an end to our American-led economic and international order. He then played golf four days in a row. (Respect.) He and his team didn’t necessarily mind the stock market going down 10 or 15 percent—supposedly that would be the temporary pain. The more worrisome sign came when the bond market began to careen off the edge. One particular red alert was how the yield on 10-year Treasurys was shooting directly up, when typically, they should be a safe haven for investors in bear markets. That’s one of those existential signs that the rest of the world is thinking about moving on from you. Trump’s advisers publicly denied that the bond market had anything to do with the Wednesday decision to issue a 90-day “pause” on reciprocal tariffs. Privately, though, they said that was exactly the reason for the climb-down, and Trump himself conceded that markets were getting a little too “yippy” for his taste. Unfortunately, we’re afraid Trump needs to take another look at the bond market. Despite a one-day stock market rally after Trump’s “pause”—which still left tariffs at their highest levels in 100 years—everything resumed crashing by Thursday, with stocks and the dollar down and Treasury yields skyrocketing back up. This is the financial equivalent of someone (in this case, all other countries) breaking up with you via text. We know what we did. Advertisement Advertisement Advertisement Advertisement 2. Scott Bessent This goes well beyond positive reinforcement. We’re still shocked by the spin that Bessent and these other dorks have been issuing since the “pause” to claim that everything is going according to plan. What really happened here is that Trump, who thinks that tariffs are a direct tax that the U.S. puts on other countries, did something impossibly reckless, because he could, and then had to begin walking it back. But his deputies have been tasked with conveying these actions as if he had just played the world. “No one creates leverage for himself like POTUS,” Bessent posted. Commerce Secretary Howard “Good Times” Lutnick, sharing a screenshot of Trump’s Truth Social post announcing the pause, wrote about how he and Bessent sat beside Trump as he drafted “one of the most extraordinary Truth posts of his Presidency.” White House policy chief Stephen Miller wrote that “you have been watching the greatest economic master strategy from an American President in history.” The only thing more head-spinning than some of these lines is that there’s an audience that will believe it. 3. Mike Johnson Never a doubt. It was the House’s turn this week to pass the compromise budget blueprint that the Senate passed last week, providing the skeletal structure for—and finally allowing them to start real work on—Trump’s “one big, beautiful bill.” To recap, the “compromise” that GOP leaders of both chambers struck was that they will make the difficult decisions later: The House would write a bill with bigger spending cuts, the Senate would write a bill with fewer, and they’d come to some icky agreement irritating everyone in the end. (This could take several more months.) House conservatives, though, didn’t like this. They wanted to straitjacket the Senate into big spending cuts now. And so we had another situation this week in which 10 or 20 House conservatives said they would never, ever, ever vote for this blueprint. The ins and outs weren’t really worth paying attention to, because the holdouts’ posture presented three options: First, they could’ve voted to kill the blueprint, and with it, Trump’s agenda (they didn’t). Second, they could’ve tried to negotiate again with the Senate on the blueprint, reopening talks on this never-ending first step just before both chambers went into a two-week recess (they would never). Third, the House conservatives could claim they got some “assurances”—say, the speaker putting his job on the line —about how spending cuts would definitely come later, vote to move the process along, and avoid Trump’s wrath. That last option was always the only plausible one. The House passed the blueprint Thursday morning. Now it’s time for them to write the bill. Plus vulnerable House Republicans have locked themselves into voting for a bill with hundreds of billions of dollars in Medicaid cuts! Wishing everyone a good time. Advertisement Advertisement Advertisement Advertisement 4. Elon Musk and Peter Navarro The grand debates of towering statesmen. We haven’t heard much from Elon Musk of late. That’s partially because of how in the previous week, he made a Wisconsin judicial election a referendum on himself and biffed it. The day after that election, though, was “Liberation Day,” and the silence of Musk—the richest businessman in history, whose companies do a lot of international commerce—was revealing. It also didn’t last. Before long, Musk was sniping on social media at Peter Navarro, Trump’s top trade adviser and the devil on Trump’s shoulder urging on aggressive tariffs. He posted early last Saturday that Navarro’s Ph.D. from Harvard was “a bad thing, not a good thing,” and that Navarro “ain’t built shit.” Navarro responded in an interview a couple of days later that Musk was merely a “car assembler,” not a manufacturer, who imported Tesla parts from around the world. That really set Musk off. He called Navarro a “moron” and “dumber than a sack of bricks.” In the latter post, he tagged the account “@IfindRetards,” and ultimately, he referred to Navarro as “Peter Retarrdo.” All very interesting stuff. It’s worth emphasizing that these are two of the closest advisers to the president of the United States. Advertisement 5. Ken Paxton A big, expensive, stupid primary. Texas Attorney General Ken Paxton, a MAGA showman who led a lawsuit to overturn the 2020 election and had also been impeached, though not convicted, by the state Legislature after nearly a decade of criminal investigations, announced a long-awaited primary challenge to Sen. John Cornyn this week. The dynamic is simple enough to understand: Paxton sees an opening to outflank Cornyn on craziness, as Cornyn is a normal human being who occasionally works to pass bipartisan legislation or expresses disapproval of some of Trump’s actions. The two don’t hide their despair of each other. Cornyn this week described Paxton as “a con man and a fraud,” and added that “I am not going to turn over the Senate seat that was once held by Sam Houston to someone like him.” The only thing motivating Paxton, Cornyn said, is “vanity and personal ambition.” This primary is going to be expensive and nasty at every turn. Regrettably, it’s also going to force Cornyn, the sort of GOP senator you’d like to have as even a modest check on Trump here or there, to behave like a caveman for the next year. Exhibit A: In March, Cornyn posted a photo of himself pretending to read The Art of the Deal in the kitchen with the caption “Recommended.” Advertisement Advertisement Advertisement Advertisement 6. Gretchen Whitmer A big, expensive, stupid primary. The adorable Democrats who still think there’s going to be a presidential election in 2028 for them to run in were circling each other this week as they responded to Trump’s tariffs. The skirmish began on Wednesday, when Michigan Gov. Gretchen Whitmer offered a nuanced criticism of the trade war. She said she understood “the motivation behind the tariffs,” but that “you can’t just pull out the tariff hammer and swing at every problem without a clear, defined end goal.” When asked how she would have enacted them differently, though, she said “I don’t know” and “I haven’t really thought about that.” Now, sure: The politics of trade are sensitive in a state like Michigan. But since she is a prospective 2028 candidate, potential Democratic primary opponents took the opportunity to differentiate themselves. Pennsylvania Gov. Josh Shapiro—who also represents a state hit hard by free trade agreements— gave a much more blunt critique of the tariffs, accusing Trump of “threatening economic calamity,” “upending world markets,” “harming seniors” and “isolating America in the world.” Illinois Gov. J.B. Pritzker called the tariffs “Trump’s Tax on Working Families.” And Colorado Gov. Jared Polis responded directly to Whitmer, posting that “the ‘tariff hammer’ winds up hitting your own hand rather than the nail.” This wasn’t the only punishment Whitmer endured this week, though. She also met Trump in D.C. and was roped into an Oval Office press conference where Trump said she’d “really done an excellent job.” Then Trump proceeded to sign a few authoritarian executive orders, forcing Whitmer to issue a clarifying statement saying that she had no idea that was going to happen. About those executive orders … Advertisement 7. Chris Krebs Advertisement Advertisement Advertisement The executive orders are not getting more sane! Popular in News & Politics The One Thing That Brought Trump Close to Reality This Week This Content is Available for Slate Plus members only The Supreme Court’s Latest Trump Compromise Is Making the Justices Look Like Chumps This Content is Available for Slate Plus members only Everyone Who Could Have Stood Up to Donald Trump Has Failed. Except, Maybe, for the Most Unlikely One of All. This Content is Available for Slate Plus members only Trump’s Tariff Chaos Could Give Him a Surprising Problem at the Supreme Court We’re going to start with a very low bar here. At least President Trump’s most egregious, strongman-like executive orders seeking retribution have been targeting institutions. You know, universities, Big Law, what have you. Not anymore! Now he’s now going directly after individuals. On Wednesday, he released two executive orders “addressing risks” against Trump 1–era officials who disobeyed him. The first is against Chris Krebs, the former head of the Cybersecurity and Infrastructure Security Agency, whom Trump fired following the 2020 election for assuring the public that it was conducted securely. “Krebs, through CISA, falsely and baselessly denied that the 2020 election was rigged and stolen,” this actual memorandum from the president reads. The order doesn’t just strip Krebs of any security clearances (child’s play). It calls on the attorney general and homeland security secretaries to investigate him and report their findings to the president. A similar order was issued against Miles Taylor, the former Department of Homeland Security chief of staff who wrote a much-discussed anonymous column for the New York Times in 2018 titled “I Am Part of the Resistance Inside the Trump Administration.” On the law-firm front, even those decrees are getting more baseless—and why not? It’s working! —as Trump issued new sanctions on the firm that represented Dominion Voting Systems in its successful legal action against the muppets who defamed them. He also signed another order “Maintaining Acceptable Water Pressure in Showerheads,” which is probably a lot better. Or it’s bad. We don’t know—he signed a lot of executive orders this week to distract from how he had collapsed the economy. Get the best of news and politics Sign up for Slate’s evening newsletter. Thanks for signing up! You can manage your newsletter subscriptions at any time. You're already subscribed to the The Slatest newsletter. You can manage your newsletter subscriptions at any time. We encountered an issue signing you up. Please try again, or manage all your newsletter subscriptions here . Please enable javascript to sign up for newsletters. Email address: Send me updates about Slate special offers. By signing up, you agree to our Privacy Policy and Terms . Sign Up Tweet Share Share Comment Donald Trump Economy Elon Musk Stock Market The Surge Advertisement Advertisement Advertisement", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slate.com/news-and-politics/2025/04/trump-tariffs-pause-markets-still-bad.html", "source": "Slate Magazine", "published_at": "2025-04-12T09:45:00"}], "timeline": [{"date": "2025-04-12T09:45:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T13:28:28", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T13:38:15", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T14:02:48", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T14:23:35", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T14:35:15", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T15:18:43", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T15:52:08", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:00:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:36:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:36:42", "score": -0.7, "sentiment": "NEGATIVE"}]}