{"company": {"id": 1, "name": "Tesla", "aliases": ["TSLA", "Tesla Inc"]}, "stats": {"POSITIVE": 1, "NEGATIVE": 8, "NEUTRAL": 3, "TOTAL": 12, "AVG_SCORE": -0.36666666666666664}, "mentions": [{"id": 11, "title": "Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments", "content": "Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments Things you buy through our links may earn Vox Media a commission. Photo: Andrew Harnik/Getty Images The president of the United States recently praised Hannibal Lecter for helping him win reelection, suggested he was “ purposely ” crashing the economy, and then abruptly paused most of his tariffs, which he described as both up for negotiation and “ permanent .” So you might think making zany and contradictory public declarations isn’t the kind of thing that bothers members of Donald Trump ’s second administration. But Howard Lutnick found a way. Recent reporting on the Commerce secretary reads like a Politico cover of “Not Like Us.” Last month, the outlet reported that both White House officials and Trump’s outside allies have grown “increasingly frustrated” with Lutnick due to his attempts to ingratiate himself with the president, his tendency to give terrible policy advice, and his “abrasive personality.” One Politico source accused Lutnick of “trying to be a mini-Trump,” while another described him as “a new voice at the table pushing crazy shit,” adding, “I don’t know anyone that isn’t pissed off at him.” Lutnick’s frequent, often embarrassing public statements are only making matters worse. The secretary has announced policies that Trump has yet to approve and made various jaw-dropping claims, like when he suggested Americans are eager to serve in “the army of millions and millions of human beings screwing in little screws to make iPhones.” Lutnick’s media appearances “have proven so challenging to White House officials that he was asked to curb them” back in March, according to the Wall Street Journal . Nevertheless, Lutnick was the most prominent cheerleader for Trump’s “Liberation Day” tariffs and he’s continued to be a font of darkly hilarious sycophancy in both his on-air appearances and his fawning social media posts. Here’s a running list of Lutnick’s most lunkheaded public statements. . Lutnick promises “no recession in America” During a March 9 appearance on Meet the Press , Lutnick said we should “absolutely not” brace for an economic downturn as “there’s going to be no recession in America.” He went on to promise that Trump would “grow our economy in a way we’ve never grown before,” adding, “if Donald Trump is bringing growth to America, I would never bet on recession, no chance.” Howard Lutnick: \"There's going to be no recession in America\" \"Global tariffs are going to come down\" pic.twitter.com/3jhuTNd0pa — Aaron Bennett (@AaronDBennett) March 9, 2025 But Trump was way less confident, or at least less willing to make a potentially humiliating declaration on camera. That same day, the president declined to rule out a recession on Fox Sunday Morning Futures , saying “I hate to predict things like that.” . Lutnick admits there may be a recession — but it will be “worth it” Days later, CBS News asked Lutnick if Trump’s tariffs are justified even if they spark a recession. “This policies are the most important thing America has ever had,” the secretary answered, passionately, adding, “It is worth it.” Q: \"Will these policies be worth it if they lead to a recession, even a short-term recession?\" Secretary of Commerce Howard Lutnick: \"These policies are the most important thing America has ever had.\" Q: \"So it is worth it?\" Lutnick: \"It is worth it.\" pic.twitter.com/yC9ooJ07e5 — The Bulwark (@BulwarkOnline) March 12, 2025 Lutnick quickly added that he doesn’t think there will be a recession. And if there is , it won’t be caused by the current president but “the Biden nonsense that we had to live with.” Then the Commerce secretary insisted that the tariffs — which Trump would later implement only to delay less than a week later — weren’t tumultuous at all. “It is not chaotic and the only one who thinks it’s chaotic is someone who’s being silly,” Lutnick said. . Lutnick announces no taxes for people earning under $150,000 In the same “recession is worth it” interview, Lutnick told CBS that Trump is looking to abolish taxes for a huge swath of Americans. “I know what his goal is: No tax for anybody who makes less than $150,000 a year. That’s his goal. That’s what I’m working for,” he said. Big if true! Which, as it turns out, it wasn’t. He later clarified in a Fox News appearance, “that’s aspirational.” MacCallum: You said on CBS that Trump wants no taxes on people making below $150,000 Lutnick: That's taking it out of context… That's aspirational that when we balance the budget… pic.twitter.com/idWnvKmA4J — Acyn (@Acyn) March 13, 2025 . Lutnick urges Fox viewers to buy Tesla stock During a March 19 appearance on Fox News, Lutnick praised Elon Musk extensively and said viewers should buy stock in his car company. “I think, if you want to learn something on this show tonight, buy Tesla,” Lutnick said. “It’s unbelievable that this guy’s stock is this cheap. It’ll never be this cheap again.” On Jesse Watters’ show, Howard Lutnick, the U.S. Secretary of Commerce, who served as the chairman and CEO of a major financial services firm for 34 years, tells viewers they should buy Tesla stock. “I think if you want to learn something on this show tonight, buy Tesla. It’s… pic.twitter.com/s9bzgkrEpN — Yashar Ali 🐘 (@yashar) March 20, 2025 Should a sitting Cabinet secretary not give stock tips on live TV? Is that sort of thing frowned upon? . Lutnick claims only “fraudsters” worry about missing Social Security checks During a March 23 appearance on the All-In podcast, Lutnick claimed that most seniors wouldn’t complain if their Social Security check didn’t show up — and if they did, that’s a sign that they’re a “fraudster.” “Let’s say Social Security didn’t send out their checks this month. My mother-in-law, who’s 94, she wouldn’t call and complain,” Lutnick said. “She just wouldn’t. She’d think something got messed up, and she’ll get it next month. A fraudster always makes the loudest noise, screaming, yelling, and complaining,” Howard Lutnick: \"Let's say Social Security didn't send out their checks this month, my mother-in-law— who's 94— she wouldn't call and complain. She just wouldn't.” @Ronxyz00 pic.twitter.com/POE7VTZdmk — The Intellectualist (@highbrow_nobrow) March 21, 2025 Lutnick is right: that particular 94-year-old woman probably wouldn’t complain, as her son-in-law is a billionaire. But would the 40 percent of older Americans who rely solely on Social Security income say something about a missing check? Well, they’d better not, unless they want to spark a fraud investigation. . Lutnick promises an employment boom (largely for robots) So how exactly is Trump’s trade war going to create American jobs in a timely fashion when it takes years to build a factory? Robots! In an interview with Fox News’ Jesse Watters, Lutnick claimed that low-wage factory workers in foreign countries are going to be replaced by fancy robots in the good old U.S. of A. That may sound like robots are taking our jobs, but the secretary explained Americans are going to … fix the robots or something? Honestly, Lutnick’s word salad was kind of hard to follow. But the bottom line is ROBOTS! Get excited! Commerce Secretary @HowardLutnick tells Primetime that robot manufacturing is going to revive the American workforce. pic.twitter.com/7jjai8dNFp — Jesse Watters (@JesseBWatters) April 4, 2025 . Lutnick dreams of electric American sheep When asked to provide details on the coming robot revolution on Face the Nation , Lutnick was hazy on whether that would actually come to pass, or Trump’s trade deals would just create American sweat shops. “Well, remember, the army of millions and millions of human beings screwing in little – little screws to make iPhones, that kind of thing is going to come to America,” he said, “It’s going to be automated and great Americans — the tradecraft of America, is going to fix them, is going to work on them. They’re going to be mechanics. There’s going to be HVAC specialists. There’s going to be electricians, the tradecraft of America.” Lutnick: \"The army of millions and millions of human beings screwing in little screws to make iPhones -- that kind of thing is going to come to America.\" pic.twitter.com/g9TqxGxLHs — Aaron Rupar (@atrupar) April 6, 2025 . Lutnick gushes over “one of the most extraordinary Truth posts” You can laugh now, but someday we’re going to see a “Room Where It Happens”-style Broadway number about Lutnick and Bessent watching Trump wage a trade war via Truth Social. Scott Bessent and I sat with the President while he wrote one of the most extraordinary Truth posts of his Presidency. The world is ready to work with President Trump to fix global trade, and China has chosen the opposite direction. pic.twitter.com/wNvg8NBnSR — Howard Lutnick (@howardlutnick) April 9, 2025 . Lutnick declares his commitment to “exploding our economy” Hey, at least he’s honest! The Golden Age is coming. We are committed to protecting our interests, engaging in global negotiations and exploding our economy. — Howard Lutnick (@howardlutnick) April 10, 2025 More Tremendous Content Melania Skips Tiffany’s Baby Shower: Wasn’t ‘Any Reason’ to Go Trump Praises Hannibal Lecter for Helping Him Win Reelection Elise Stefanik Is ‘Proud’ to Have Dream Crushed by Trump See All Sign Up for the Intelligencer Newsletter Daily news about the politics, business, and technology shaping our world. Email This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Vox Media, LLC Terms and Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us. Tags: tremendous content howard lutnick politics early and often Show Leave a Comment Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments Things you buy through our links may earn Vox Media a commission. Most Viewed Stories Melania Skips Tiffany’s Baby Shower: Wasn’t ‘Any Reason’ to Go DoJ Won’t Comply With Order on Kilmar Abrego Garcia: Live Updates Why a Helicopter Broke Apart Over the Hudson River Trump Threatens to Imprison Critics — and Bondi Might Do It Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments Melania Skips Tiffany’s Baby Shower: Wasn’t ‘Any Reason’ to Go DoJ Won’t Comply With Order on Kilmar Abrego Garcia: Live Updates Why a Helicopter Broke Apart Over the Hudson River Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments Trump Threatens to Imprison Critics — and Bondi Might Do It Editor’s Picks gold rush The Era of Network Nostalgia Is Here, and The Pitt Stands to Benefit The Era of Network Nostalgia Could Lead ‘The Pitt’ to Gold tremendous content Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments do i need this? The Internet’s Most Anticipated Sneaker Drop Is Here The Internet’s Most Anticipated Sneaker Drop Is Here Sign In to Comment THE FEED 5:00 a.m. screen time screen time Meta Wants to Tilt Its AI to the Right By John Herrman Are Mark Zuckerberg and Meta just trying to dodge a fight with Trump, or will they end up promoting his biases and agenda, too? 4/12/2025 early and often early and often Trump’s Tariffs Can Fix One Thing: The Resistance’s Excesses By Ross Barkan Last time, it focused too much on symbolism. This time it will be largely about substance — the economy. Most Popular Melania Skips Tiffany’s Baby Shower: Wasn’t ‘Any Reason’ to Go By Margaret Hartmann DoJ Won’t Comply With Order on Kilmar Abrego Garcia: Live Updates By Intelligencer Staff Why a Helicopter Broke Apart Over the Hudson River By Jeff Wise Trump Threatens to Imprison Critics — and Bondi Might Do It By Elie Honig Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments By Margaret Hartmann Melania Skips Tiffany’s Baby Shower: Wasn’t ‘Any Reason’ to Go By Margaret Hartmann DoJ Won’t Comply With Order on Kilmar Abrego Garcia: Live Updates By Intelligencer Staff Why a Helicopter Broke Apart Over the Hudson River By Jeff Wise Commerce Secretary Howard Lutnick’s Most Lunkheaded Moments By Margaret Hartmann Trump Threatens to Imprison Critics — and Bondi Might Do It By Elie Honig 4/11/2025 liveblog liveblog DoJ Won’t Comply With Order on Kilmar Abrego Garcia: Live Updates By Intelligencer Staff The legal battle continues after the Supreme Court pushed back on the Trump administration last night. 4/11/2025 early and often early and often DOGE’s Methods May Be Chaotic, But They’re Also Ineffective By Ed Kilgore A new report shows that DOGE’s assault on federal employees and contracts isn’t reducing federal spending at all. 4/11/2025 tremendous content tremendous content Melania Skips Tiffany’s Baby Shower: Wasn’t ‘Any Reason’ to Go By Margaret Hartmann The First Lady has been Tiffany’s stepmother for 20 years, but a source said that wasn’t reason enough to attend. 4/11/2025 unnatural disasters unnatural disasters Why a Helicopter Broke Apart Over the Hudson River By Jeff Wise Video shows the spinning rotors separating in midair from the fuselage. 4/11/2025 screen time screen time How Worried Should We Be About a $3,500 iPhone? By John Herrman Tariff-spooked Americans are panic-buying at the Apple Store. 4/11/2025 the law the law Trump Threatens to Imprison Critics — and Bondi Might Do It By Elie Honig Will the attorney general cross the line that even Bill Barr, her crooked predecessor, would not? 4/11/2025 early and often early and often Wealthy Trump Donors Try to Make Sense of the Tariff Circus By David Freedlander “I just, I just …” 4/10/2025 trade war trade war The Craziest Details About Trump’s Tariff Pause By Nia Prater and Chas Danner How reality finally sank in enough for the president to partially back away from an obviously terrible plan. 4/10/2025 early and often early and often Democratic Voters Hate Tariffs. Do Their Politicians Agree? By Ed Kilgore The uncertain note officials like Gretchen Whitmer are sounding in opposition to Trump’s trade policies could squander a great opportunity. 4/10/2025 buffering buffering Soaring Costs and Banned Lunches: Trump’s Tariffs Hit Hollywood By Josef Adalian The industry survived ’til ’25. Can it make it to 2029? 4/10/2025 poll position poll position Trump’s Approval Rating Keeps Getting Worse By Ed Kilgore The president has erased his postelection polling bump, and his tariff policies could soon turn a slow slide in popularity into a crash. 4/10/2025 thoughtcrime thoughtcrime ICE Threatens to Stop ‘Ideas’ at the Border By Choire Sicha We’re in trouble. 4/10/2025 early and often early and often House Passes Budget After Senate Tees Up Medicaid Cuts By Ed Kilgore The House Freedom Caucus got onboard after Thune agreed to $1.5 trillion in spending cuts — which will almost certainly mean hammering Medicaid. 4/10/2025 early and often early and often Trump’s Madman Act Isn’t Just for Foreign Policy Anymore By Ed Kilgore In his first term, Trump wanted foreign adversaries to fear he’d lost his marbles. Now he’s extending that strategy to every policy arena. 4/10/2025 screen time screen time How AI Made the Future Unthinkable By John Herrman Advanced artificial intelligence will change everything, we are told. Do we get a say? 4/9/2025 politics politics Trump Blinks on Tariffs and Markets Skyrocket By Nia Prater The president announced he would be pausing his reciprocal tariffs for three months, just days after officials rejected such a move was in the works. 4/9/2025 tremendous content tremendous content Trump Praises Hannibal Lecter for Helping Him Win Reelection By Margaret Hartmann The president insisted the “late great Hannibal Lecter” was a “very important force.” But his rant was still almost entirely wrong. 4/9/2025 politics politics GOP Pushback on Trump Tariffs Was Getting Loud Before Pause By Nia Prater Some Republicans were voicing their opposition, but reining in Trump’s trade powers may be a doomed mission. 4/9/2025 politics politics D.C. vs. NYC: How Trump Is Targeting New York City By Nia Prater Trump has sought to impose his will on the city as his administration has revoked FEMA funds and moved to end congestion pricing, among other acts. 4/9/2025 just asking questions just asking questions How the First Phase of the Trade War Ends By Benjamin Hart Economic analyst Olu Sonola says it’s only a matter of when, not if, tariff rates fall. 4/9/2025 new age new age How New Age Women Turned Right By Sarah Jones For some, the pursuit of inner truth is a dead end. 4/8/2025 early and often early and often Trump’s Plan for Laid-Off Federal Workers: Get a Factory Job By Ed Kilgore Scott Bessent explains how tariffs and DOGE layoffs will work together to create a manlier workforce filling real jobs.", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "http://nymag.com/intelligencer/article/howard-lutnick-trump-commerce-secretary-wildest-statements.html", "source": "New York Magazine", "published_at": "2025-04-12T10:00:13"}, {"id": 12, "title": "Meet the Activists Motivated by Hatred of Elon Musk", "content": "Meet the Activists Motivated by Hatred of Elon Musk Search for: Politics Justice War on Gaza Technology Environment Immigration Support Us Special Investigations Voices Podcasts Videos Documents About Contact Us More Ways to Donate Impact & Reports Join Newsletter Jobs Become a Source © THE INTERCEPT ALL RIGHTS RESERVED Terms of Use Privacy Victor Alcala stands outside the Tesla showroom in Alhambra, Calif., on March 14, 2025. Photo: Helen Li/The Intercept When Victor Alcala saw that the Department of Government Efficiency, or DOGE, had the Department of Veterans Affairs in its crosshairs, he decided to set up a protest at his local Tesla dealership. On a rare rainy day in Los Angeles in mid-March, Alcala stood outside the Alhambra Tesla showroom holding a sign: “Don’t buy a Swastikar.” Alcala, a social worker, interacts with older adults in his daily job. More than 56 million seniors receive Social Security benefit payments each month. For a long time, Republicans and Democrats saw the program as the “ third rail of politics,” untouchable because of how many people were dependent on it. As part of DOGE’s efforts under Elon Musk, more than 7,000 jobs in the Social Security Administration will be cut , which Alcala believes will create a negative ripple effect when it comes to caring for senior citizens. “I’ve worked with seniors for 25 years. And now that that agency is being hollowed out, we’ll end up seeing missed payments and a total system collapse of Social Security. What happens to all those people that are on social security, that’s their only form of income?” Alcala told The Intercept. Most Read Trump Appears to Be Targeting Muslim and “Non-White” Students for Deportation Jonah Valdez How Much Did Congress Make Off Market Turmoil and Why’re They Allowed to Make Anything at All? Matt Sledge Newsletter The Intercept The protesters’ focal point, across age, race, class, and favored cause, is an abiding hatred of Musk By protesting in front of the Tesla showroom, he hoped that he could make a small dent in pushing back against the cuts, particularly impacting Musk, who is Tesla’s largest shareholder. “DOGE is an illegal organization. Since he’s taken money out of our pockets, we’re here to take money out of his pocket as well.” Across the country, hundreds of thousands of people like Alcala have swarmed Tesla showrooms, standing outside weekly to protest Musk and DOGE’s recent efforts to cut different government departments. They range from former public school teachers, to prospective young graduate students, to a 96-year-old woman who once lived under Nazi-occupied Netherlands. To date, DOGE has been linked to more than 280,000 federal job cuts , including at the Department of Education, Department of Health and Human Services, U.S. Agency for International Development, and the Consumer Financial Protection Bureau. The protesters’ focal point, across age, race, class, and favored cause, is an abiding hatred of Musk— who has quickly shifted from helpful hatchet man to albatross for Donald Trump. News outlets have reported that Musk may soon step down from his position with DOGE. Trump has increasingly seen the tech executive as a political liability , and Musk’s 130-day status as a “ special government employee ” will soon expire in May or June. But Tesla’s stock and branding may already have taken a more permanent hit. While Tesla’s stock value already dipped over the past year due to weakening sales, Musk’s recent political activities have also hurt the perceived value for shareholders. “The protests have worked dramatically well, scaring away consumers that even were considering Teslas,” said Ross Gerber, the chief executive officer of Gerber Kawasaki Wealth and Investment Management in Santa Monica, California. Gerber said that his clients have been asking him to sell their shares of Tesla stock. “It’s still the best EV and it’s a great brand. But now, who wants to drive one?” “The value of these protests is not just about people individually no longer buying Teslas. It’s really about rebranding the whole and making it an ‘untouchable’ brand,” said Aaron Vansintjan, a policy manager at Food Secure Canada and co-author of “The Sustainability Class: How to Take Back Our Future from Lifestyle Environmentalists.” The Intercept spoke to a number of people at protests in Southern California, Massachusetts, and Virginia over the past month. Some only wished to be identified by their first name out of privacy concerns. All were spending their time publicly demonstrating in front of Tesla showrooms. Here are portraits of just some of the broad coalition coming together to attack Tesla’s bottom line: GARY THORNTON AND DELIA THORNTON Gary and Delia Thornton hold protest signs at a Tesla rally outside of the Americana mall showroom in Glendale, Calif., on March 22, 2025. Photo: Helen Li/The Intercept Gary is an army veteran, serving for eight years in Texas, Japan, and Germany. He also formerly worked in the federal government. Why are you protesting Tesla? “We’re here because we’re concerned about the direction of this country. Elon Musk is the hatchet man for our current president. He is unelected, he’s unaccountable, he’s unsupervised, and he’s just wreaking havoc with our country. We believe no one is coming to save us. The courts are glacial. Congress is locked down under Republicans. So, basically, it’s up to the people. It’s up to us to try to stop this thing that’s happening in our country. I served my country for 34 years. It’s horrifying what’s happening to this country, happening to our government.” PHILIP Philip holds a protest sign outside of the Glendale Americana mall Tesla showroom on March 22, 2025. Photo: Helen Li/The Intercept Philip is a tech worker. Why are you protesting Tesla? “Because PEPFAR got shut down. PEPFAR is the President’s Emergency Plan for AIDS Relief. It was a part of USAID and was responsible for essentially providing lifesaving medication for over 20 million people around the world. Because of the various suspension states of USAID, if nothing is done, more people are going to die from this than the Holocaust. [ Editor’s Note: Estimates vary on the potential impact of the USAID cuts, but 26 million fewer deaths from AIDS have been attributed to PEPFAR alone over the past 20 years .] About two years ago, I had the opportunity to visit Auschwitz in Poland, and I made this informal promise to myself that if anything like that ever happened again, I would try to do every single thing in my power to not make it happen again. I’m not particularly important. I’m not a politician or whatever, so I’m trying to do every little thing I can do.” MICHELLE Protesters stand at the Alhambra Tesla showroom on March 14, 2025. Photo: Helen Li/The Intercept Michelle, holding the “Nazi Punk Fuck Off” sign, works in adult education. Why are you protesting Tesla? “I work in adult education for [the Los Angeles Unified School District] and we get a big part of our funding from the federal government to support adults getting the skills they need so that they can be decently employed through the Workforce Innovation and Opportunity Act. We do everything from teaching adults who never learned how to read, to teaching students and immigrants who need to learn English. My area is academics: help people finish high school who never got to graduate or pass, and then career training. Calling the Department of Education a waste? That’s insulting to all of us who work in education. These threats of cutting the Department of Education are directly an existential threat to any of these programs.” We’re independent of corporate interests — and powered by members. Join us. Become a member Join Our Newsletter Thank You For Joining! Original reporting. Fearless journalism. Delivered to you. Will you take the next step to support our independent journalism by becoming a member of The Intercept? I'm in Become a member By signing up, I agree to receive emails from The Intercept and to the Privacy Policy and Terms of Use . Join Our Newsletter Original reporting. Fearless journalism. Delivered to you. I'm in CINDY REVELLE Cindy Revelle holds a protest sign at a rally outside of the Tesla showroom at the Prudential Center in Boston on March 29, 2025. Photo: Helen Li/The Intercept Cindy works in public education. Why are you protesting Tesla? “I am personally affected as a public educator and I have family members who rely on Medicaid. I am more globally concerned for people in this country who are going to be affected. I’m also very, very concerned about the ousting of the vaccine expert that just took place. I can’t believe the person who helped us get the Covid-19 vaccine has been forced to resign. To me, that’s unconscionable, and the fact that measles vaccines are being questioned? All of that will affect us.” MICHAEL NOLA Michael Nola stands near the Alhambra Tesla showroom on March 14, 2025. Photo: Helen Li/The Intercept Michael is a Vietnam War veteran. Why are you protesting Tesla? “The guy is a liar. He just lies, and he puts these lies out like the Democrats are bringing all these illegal aliens and they’re getting Social Security. But you can’t get Social Security in this country unless you have a Social Security card. And to have a Social Security card, you have to have proof of citizenship. So the people that are here illegally and paying into Social Security are not drawing Social Security when they retire. They don’t get it. They’re actually putting into the system and not the other. The Pentagon never passed an audit. The last one they took, they literally could only account for somewhere between 40 percent and 50 percent of their spending. Now, if you’re serious about cutting waste and fraud, wouldn’t you start at the one agency? Clearly they’re not serious about actual waste and actual fraud. My father killed Nazis in World War II. I won’t buy a car from one.” SARAH Sarah holds a protest sign at a rally outside of the Tesla showroom at the Prudential Center in Boston on March 29, 2025. She prefers her face not be shown due to safety concerns. Photo: Helen Li/The Intercept Sarah works with children with disabilities. Why are you protesting Tesla? “I am really angry about what’s happened, and I want to make my voice heard and be with other people that feel the same way. I work with direct care staff with adults with developmental disabilities. Cutting Social Security, cutting Health and Human Services, all of that is going to profoundly affect people’s lives. And I think the way that it’s happening is deeply disturbing. This is [some] people’s only income and these kinds of cuts by people who have no understanding of the services that they’re cutting are dangerous. The population that I serve are very scared about their health care and their food and really day-to-day needs, and in the long term, I’m very concerned about funding for the services.” JACOB AND RYAN Jacob, left, and Ryan hold protest signs at a rally outside of the Tesla showroom at the Prudential Center in Boston on March 29, 2025. Photo: Helen Li/The Intercept Jacob is an engineer and Ryan is a student and sustainability advocate. Why are you protesting Tesla? “I’ve been watching this sort of DOGE thing unfold and watching the power that Elon Musk reveals in the government, remembering that I never voted for him, and that nobody ever voted for him. Due process is really important. When somebody has power, it is important that it comes from the consent of the governed, rather than from some decree from an authoritarian controller. Being someone who’s going to be going into physics and grad school, everything does affect me personally. I feel like our democracy is facing some really big challenges right now.” — Jacob As a sustainability advocate, why are you protesting Tesla? “I used to be a fan of the argument that you should buy a Tesla because, not just for the environmental benefits, but just because it’s a better car. I didn’t care. I wanted to see more people buying electric. But when I see the richest man in the world buying a spot in the government, using the wealth that he accumulated from having like a 50 percent share of the market in the U.S., I don’t think that’s right.” — Ryan ELIA BEN-ARI Elia Ben-Ari holds a protest sign at a rally outside of the Tesla showroom in Arlington, Va., on April 1, 2025. Photo: Helen Li/The Intercept Elia is a retired science writer focused on cancer research. What DOGE cuts concern you the most? “I’m a former scientist and science journalist, and I worked for the National Institutes of Health for many years. I’m really concerned about what’s happening, what Trump and Musk are doing to science, to scientific research. Directors of institutes at NIH are being either put on administrative leave or told that they are being reassigned. These are people who have years of expertise and training in things like infectious disease research, and now for political reasons, they’re essentially being forced out of their jobs, and funding for research is being cut, especially in HIV research, things like preventing transmission of HIV from mother to unborn child. Why would anybody want to stop supporting research in that area? It’s clearly political.” Share Copy link Share on Facebook Share on Bluesky Share on X Share on LinkedIn Share on WhatsApp WAIT! BEFORE YOU GO on about your day, ask yourself: How likely is it that the story you just read would have been produced by a different news outlet if The Intercept hadn’t done it? Consider what the world of media would look like without The Intercept. Who would hold party elites accountable to the values they proclaim to have? How many covert wars, miscarriages of justice, and dystopian technologies would remain hidden if our reporters weren’t on the beat? The kind of reporting we do is essential to democracy, but it is not easy, cheap, or profitable. The Intercept is an independent nonprofit news outlet. We don’t have ads, so we depend on our members to help us hold the powerful to account. Joining is simple and doesn’t need to cost a lot: You can become a sustaining member for as little as $3 or $5 a month. That’s all it takes to support the journalism you rely on. We’re independent of corporate interests. Will you help us? $15 $25 $50 $100 $5 $8 $10 $15 One Time Monthly Donate Contact the author: Helen Li @helenliwrites on X Related DOGE’s Pentagon Budget Cuts Don’t Touch Elon Musk’s SpaceX DOGE Keeps Trying to Dodge the Freedom of Information Act. So We’re Suing. DOGE Likely Can’t Evade Freedom of Information Law, Court Rules We Found Elon Musk’s DOGE Email Address and We’re Fighting to Reveal His Messages Latest Stories Voices \"An Abrupt Plunge Into Hell\": Gaza After the Ceasefire Huda Skaik - Apr. 12 Israel renewed its bombing campaign on Gaza in March. Killings and food shortages have become the norm again. The War on Immigrants What Comes Next in Mahmoud Khalil’s Fight Against Deportation Jonah Valdez - Apr. 12 Despite Friday’s immigration court ruling, the legal fight to keep Mahmoud Khalil in the U.S. may stretch months or years. The War on Immigrants Mahmoud Khalil and the Necropolitics of Trump’s Deportation Regime Natasha Lennard - Apr. 11 Death is the point. Join The Conversation Enter your email to keep reading for free. This is not a paywall. I'm in By signing up, I agree to receive emails from The Intercept and to the Privacy Policy and Terms of Use . Welcome! Will you take the next step to support The Intercept’s independent journalism by becoming a member? Thank you for joining! Will you take the next step to support The Intercept’s independent journalism by becoming a member? $15 $25 $50 $100 $5 $8 $10 $15 One Time Monthly Yes, count me In We’re independent of corporate interests. Will you join us? $15 $25 $50 $100 $5 $8 $10 $15 One Time Monthly Yes, count me in", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://theintercept.com/2025/04/12/anti-musk-tesla-activists/", "source": "The Intercept", "published_at": "2025-04-12T10:00:00"}, {"id": 1, "title": "The One Thing That Brought Trump Close to Reality This Week", "content": "Trump tariff pause: This week we learned there’s one thing that will make Trump rethink his plans, but it’s certainly not enough. Tweet Share Share Comment Photo illustration by Slate. Photo by Getty Images Plus. Sign up for the Surge , the newsletter that covers most important political nonsense of the week, delivered to your inbox every Saturday. Welcome to this week’s edition of the Surge, a newsletter about all things politics in the United States, a place that can now be considered an emerging market country. Hey, here’s some news: Your money is gone, forever. It’s called the “Art of the Deal.” At least we’ve still got Medicaid for bare-bones health ca—oops, maybe not? What a week for the American pocketbook. Democrats’ crippling addiction to nuance, meanwhile, is preventing some of them from saying the very easy sentence “Trump killed the economy.” And for ulcer-related reasons, we’re not even touching the court cases involving the Trump administration’s arbitrary kidnappings—read the Slate legal people for that. Much is going on. Can anyone—or any … thing—stop it? 1. The bond market If there’s anything that can get through to Trump … Last week, Donald Trump set in place a tariff plan that, if carried through, would at least cause a recession and at most put an end to our American-led economic and international order. He then played golf four days in a row. (Respect.) He and his team didn’t necessarily mind the stock market going down 10 or 15 percent—supposedly that would be the temporary pain. The more worrisome sign came when the bond market began to careen off the edge. One particular red alert was how the yield on 10-year Treasurys was shooting directly up, when typically, they should be a safe haven for investors in bear markets. That’s one of those existential signs that the rest of the world is thinking about moving on from you. Trump’s advisers publicly denied that the bond market had anything to do with the Wednesday decision to issue a 90-day “pause” on reciprocal tariffs. Privately, though, they said that was exactly the reason for the climb-down, and Trump himself conceded that markets were getting a little too “yippy” for his taste. Unfortunately, we’re afraid Trump needs to take another look at the bond market. Despite a one-day stock market rally after Trump’s “pause”—which still left tariffs at their highest levels in 100 years—everything resumed crashing by Thursday, with stocks and the dollar down and Treasury yields skyrocketing back up. This is the financial equivalent of someone (in this case, all other countries) breaking up with you via text. We know what we did. Advertisement Advertisement Advertisement Advertisement 2. Scott Bessent This goes well beyond positive reinforcement. We’re still shocked by the spin that Bessent and these other dorks have been issuing since the “pause” to claim that everything is going according to plan. What really happened here is that Trump, who thinks that tariffs are a direct tax that the U.S. puts on other countries, did something impossibly reckless, because he could, and then had to begin walking it back. But his deputies have been tasked with conveying these actions as if he had just played the world. “No one creates leverage for himself like POTUS,” Bessent posted. Commerce Secretary Howard “Good Times” Lutnick, sharing a screenshot of Trump’s Truth Social post announcing the pause, wrote about how he and Bessent sat beside Trump as he drafted “one of the most extraordinary Truth posts of his Presidency.” White House policy chief Stephen Miller wrote that “you have been watching the greatest economic master strategy from an American President in history.” The only thing more head-spinning than some of these lines is that there’s an audience that will believe it. 3. Mike Johnson Never a doubt. It was the House’s turn this week to pass the compromise budget blueprint that the Senate passed last week, providing the skeletal structure for—and finally allowing them to start real work on—Trump’s “one big, beautiful bill.” To recap, the “compromise” that GOP leaders of both chambers struck was that they will make the difficult decisions later: The House would write a bill with bigger spending cuts, the Senate would write a bill with fewer, and they’d come to some icky agreement irritating everyone in the end. (This could take several more months.) House conservatives, though, didn’t like this. They wanted to straitjacket the Senate into big spending cuts now. And so we had another situation this week in which 10 or 20 House conservatives said they would never, ever, ever vote for this blueprint. The ins and outs weren’t really worth paying attention to, because the holdouts’ posture presented three options: First, they could’ve voted to kill the blueprint, and with it, Trump’s agenda (they didn’t). Second, they could’ve tried to negotiate again with the Senate on the blueprint, reopening talks on this never-ending first step just before both chambers went into a two-week recess (they would never). Third, the House conservatives could claim they got some “assurances”—say, the speaker putting his job on the line —about how spending cuts would definitely come later, vote to move the process along, and avoid Trump’s wrath. That last option was always the only plausible one. The House passed the blueprint Thursday morning. Now it’s time for them to write the bill. Plus vulnerable House Republicans have locked themselves into voting for a bill with hundreds of billions of dollars in Medicaid cuts! Wishing everyone a good time. Advertisement Advertisement Advertisement Advertisement 4. Elon Musk and Peter Navarro The grand debates of towering statesmen. We haven’t heard much from Elon Musk of late. That’s partially because of how in the previous week, he made a Wisconsin judicial election a referendum on himself and biffed it. The day after that election, though, was “Liberation Day,” and the silence of Musk—the richest businessman in history, whose companies do a lot of international commerce—was revealing. It also didn’t last. Before long, Musk was sniping on social media at Peter Navarro, Trump’s top trade adviser and the devil on Trump’s shoulder urging on aggressive tariffs. He posted early last Saturday that Navarro’s Ph.D. from Harvard was “a bad thing, not a good thing,” and that Navarro “ain’t built shit.” Navarro responded in an interview a couple of days later that Musk was merely a “car assembler,” not a manufacturer, who imported Tesla parts from around the world. That really set Musk off. He called Navarro a “moron” and “dumber than a sack of bricks.” In the latter post, he tagged the account “@IfindRetards,” and ultimately, he referred to Navarro as “Peter Retarrdo.” All very interesting stuff. It’s worth emphasizing that these are two of the closest advisers to the president of the United States. Advertisement 5. Ken Paxton A big, expensive, stupid primary. Texas Attorney General Ken Paxton, a MAGA showman who led a lawsuit to overturn the 2020 election and had also been impeached, though not convicted, by the state Legislature after nearly a decade of criminal investigations, announced a long-awaited primary challenge to Sen. John Cornyn this week. The dynamic is simple enough to understand: Paxton sees an opening to outflank Cornyn on craziness, as Cornyn is a normal human being who occasionally works to pass bipartisan legislation or expresses disapproval of some of Trump’s actions. The two don’t hide their despair of each other. Cornyn this week described Paxton as “a con man and a fraud,” and added that “I am not going to turn over the Senate seat that was once held by Sam Houston to someone like him.” The only thing motivating Paxton, Cornyn said, is “vanity and personal ambition.” This primary is going to be expensive and nasty at every turn. Regrettably, it’s also going to force Cornyn, the sort of GOP senator you’d like to have as even a modest check on Trump here or there, to behave like a caveman for the next year. Exhibit A: In March, Cornyn posted a photo of himself pretending to read The Art of the Deal in the kitchen with the caption “Recommended.” Advertisement Advertisement Advertisement Advertisement 6. Gretchen Whitmer A big, expensive, stupid primary. The adorable Democrats who still think there’s going to be a presidential election in 2028 for them to run in were circling each other this week as they responded to Trump’s tariffs. The skirmish began on Wednesday, when Michigan Gov. Gretchen Whitmer offered a nuanced criticism of the trade war. She said she understood “the motivation behind the tariffs,” but that “you can’t just pull out the tariff hammer and swing at every problem without a clear, defined end goal.” When asked how she would have enacted them differently, though, she said “I don’t know” and “I haven’t really thought about that.” Now, sure: The politics of trade are sensitive in a state like Michigan. But since she is a prospective 2028 candidate, potential Democratic primary opponents took the opportunity to differentiate themselves. Pennsylvania Gov. Josh Shapiro—who also represents a state hit hard by free trade agreements— gave a much more blunt critique of the tariffs, accusing Trump of “threatening economic calamity,” “upending world markets,” “harming seniors” and “isolating America in the world.” Illinois Gov. J.B. Pritzker called the tariffs “Trump’s Tax on Working Families.” And Colorado Gov. Jared Polis responded directly to Whitmer, posting that “the ‘tariff hammer’ winds up hitting your own hand rather than the nail.” This wasn’t the only punishment Whitmer endured this week, though. She also met Trump in D.C. and was roped into an Oval Office press conference where Trump said she’d “really done an excellent job.” Then Trump proceeded to sign a few authoritarian executive orders, forcing Whitmer to issue a clarifying statement saying that she had no idea that was going to happen. About those executive orders … Advertisement 7. Chris Krebs Advertisement Advertisement Advertisement The executive orders are not getting more sane! Popular in News & Politics The One Thing That Brought Trump Close to Reality This Week This Content is Available for Slate Plus members only The Supreme Court’s Latest Trump Compromise Is Making the Justices Look Like Chumps This Content is Available for Slate Plus members only Everyone Who Could Have Stood Up to Donald Trump Has Failed. Except, Maybe, for the Most Unlikely One of All. This Content is Available for Slate Plus members only Trump’s Tariff Chaos Could Give Him a Surprising Problem at the Supreme Court We’re going to start with a very low bar here. At least President Trump’s most egregious, strongman-like executive orders seeking retribution have been targeting institutions. You know, universities, Big Law, what have you. Not anymore! Now he’s now going directly after individuals. On Wednesday, he released two executive orders “addressing risks” against Trump 1–era officials who disobeyed him. The first is against Chris Krebs, the former head of the Cybersecurity and Infrastructure Security Agency, whom Trump fired following the 2020 election for assuring the public that it was conducted securely. “Krebs, through CISA, falsely and baselessly denied that the 2020 election was rigged and stolen,” this actual memorandum from the president reads. The order doesn’t just strip Krebs of any security clearances (child’s play). It calls on the attorney general and homeland security secretaries to investigate him and report their findings to the president. A similar order was issued against Miles Taylor, the former Department of Homeland Security chief of staff who wrote a much-discussed anonymous column for the New York Times in 2018 titled “I Am Part of the Resistance Inside the Trump Administration.” On the law-firm front, even those decrees are getting more baseless—and why not? It’s working! —as Trump issued new sanctions on the firm that represented Dominion Voting Systems in its successful legal action against the muppets who defamed them. He also signed another order “Maintaining Acceptable Water Pressure in Showerheads,” which is probably a lot better. Or it’s bad. We don’t know—he signed a lot of executive orders this week to distract from how he had collapsed the economy. Get the best of news and politics Sign up for Slate’s evening newsletter. Thanks for signing up! You can manage your newsletter subscriptions at any time. You're already subscribed to the The Slatest newsletter. You can manage your newsletter subscriptions at any time. We encountered an issue signing you up. Please try again, or manage all your newsletter subscriptions here . Please enable javascript to sign up for newsletters. Email address: Send me updates about Slate special offers. By signing up, you agree to our Privacy Policy and Terms . Sign Up Tweet Share Share Comment Donald Trump Economy Elon Musk Stock Market The Surge Advertisement Advertisement Advertisement", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://slate.com/news-and-politics/2025/04/trump-tariffs-pause-markets-still-bad.html", "source": "Slate Magazine", "published_at": "2025-04-12T09:45:00"}, {"id": 2, "title": "Promising Automotive Stocks To Watch Today – April 10th", "content": "Promising Automotive Stocks To Watch Today – April 10th - ETF Daily News Skip to main content Promising Automotive Stocks To Watch Today – April 10th Posted by MarketBeat News on Apr 12th, 2025 Share on Twitter Share on Facebook Share on LinkedIn Share on Stocktwits NVIDIA, Tesla, and Taiwan Semiconductor Manufacturing are the three Automotive stocks to watch today, according to MarketBeat’s stock screener tool. Automotive stocks are shares of companies involved in the manufacturing, marketing, and distribution of motor vehicles or automotive components. They often reflect the overall health of the auto industry and are influenced by factors such as consumer demand, technological innovation, and regulatory changes. These companies had the highest dollar trading volume of any Automotive stocks within the last several days. Get alerts: NVIDIA (NVDA) NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. Want More Great Investing Ideas? 10 Stocks to Sell NOW! 3 Stocks to DOUBLE This Year The 10 Best Stocks to Own in 2023 7 Stocks to Buy and Hold Forever NASDAQ:NVDA traded down $8.61 during mid-day trading on Thursday, hitting $105.72. The stock had a trading volume of 206,410,798 shares, compared to its average volume of 314,856,609. The stock has a 50-day simple moving average of $119.29 and a two-hundred day simple moving average of $130.54. The company has a market capitalization of $2.58 trillion, a PE ratio of 41.48, a PEG ratio of 1.76 and a beta of 1.96. NVIDIA has a twelve month low of $75.61 and a twelve month high of $195.95. The company has a current ratio of 4.10, a quick ratio of 3.64 and a debt-to-equity ratio of 0.13. Read Our Latest Research Report on NVDA Tesla (TSLA) Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. NASDAQ TSLA traded down $27.47 during trading on Thursday, reaching $244.73. The company’s stock had a trading volume of 83,955,112 shares, compared to its average volume of 95,348,046. The firm has a market cap of $787.17 billion, a price-to-earnings ratio of 119.84, a P/E/G ratio of 5.86 and a beta of 2.58. The company has a debt-to-equity ratio of 0.08, a quick ratio of 1.61 and a current ratio of 2.02. The business’s fifty day moving average price is $290.62 and its 200-day moving average price is $323.14. Tesla has a twelve month low of $138.80 and a twelve month high of $488.54. Read Our Latest Research Report on TSLA Taiwan Semiconductor Manufacturing (TSM) Taiwan Semiconductor Manufacturing Company Limited, together with its subsidiaries, manufactures, packages, tests, and sells integrated circuits and other semiconductor devices in Taiwan, China, Europe, the Middle East, Africa, Japan, the United States, and internationally. It provides a range of wafer fabrication processes, including processes to manufacture complementary metal- oxide-semiconductor (CMOS) logic, mixed-signal, radio frequency, embedded memory, bipolar CMOS mixed-signal, and others. TSM traded down $9.20 during trading on Thursday, reaching $149.56. The company’s stock had a trading volume of 12,073,397 shares, compared to its average volume of 15,748,865. The company’s fifty day moving average price is $181.13 and its 200-day moving average price is $191.29. Taiwan Semiconductor Manufacturing has a 52-week low of $125.78 and a 52-week high of $226.40. The company has a market capitalization of $775.65 billion, a price-to-earnings ratio of 21.19, a price-to-earnings-growth ratio of 0.66 and a beta of 1.16. The company has a debt-to-equity ratio of 0.24, a quick ratio of 2.30 and a current ratio of 2.57. Read Our Latest Research Report on TSM Recommended Stories MarketBeat’s Top Five Stocks to Own in April 2025 Joby Aviation: Operational Momentum vs. Market Sentiment Broadcom’s Big Outperformance Shows Strength Amid Tariff Decline Carvana: Can Turnaround Strength Outdrive Market Headwinds? Meta Seeks Trump’s Help in FTC Trial: The Implications Are Huge Delta, Walmart Cut Profit Targets: Could Start Domino Effect You might be interested in: Wells Fargo & Company MN Has $23.73 Million Stock Position in Vanguard S&P Mid-Cap 400 ETF Brookfield Asset Management Ltd. Shares Sold by ExodusPoint Capital Management LP Trexquant Investment LP Acquires 1,702 Shares of Apogee Enterprises, Inc. Geode Capital Management LLC Raises Holdings in California Water Service Group Standex International Co. Position Increased by JPMorgan Chase & Co. Geode Capital Management LLC Sells 136,212 Shares of PBF Energy Inc. Free Email Newsletter Complete the form below to receive the latest headlines and analysts' recommendations for your stocks with MarketBeat's free daily email newsletter: Follow @etfdailynews Recent News Wells Fargo & Company MN Has $23.73 Million Stock Position in Vanguard S&P Mid-Cap 400 ETF (NYSEARCA:IVOO) Brookfield Asset Management Ltd. (NYSE:BAM) Shares Sold by ExodusPoint Capital Management LP Trexquant Investment LP Acquires 1,702 Shares of Apogee Enterprises, Inc. (NASDAQ:APOG) Geode Capital Management LLC Raises Holdings in California Water Service Group (NYSE:CWT) Standex International Co. (NYSE:SXI) Position Increased by JPMorgan Chase & Co. Geode Capital Management LLC Sells 136,212 Shares of PBF Energy Inc. (NYSE:PBF) Geode Capital Management LLC Has $64.34 Million Position in Hanesbrands Inc. (NYSE:HBI) Geode Capital Management LLC Decreases Stock Position in Peabody Energy Co. (NYSE:BTU) Geode Capital Management LLC Lowers Stock Position in Hilton Grand Vacations Inc. (NYSE:HGV) Moelis & Company (NYSE:MC) Stock Holdings Decreased by ExodusPoint Capital Management LP Franklin Resources Inc. Acquires 36,883 Shares of Comerica Incorporated (NYSE:CMA) Valens Semiconductor (NYSE:VLN) Now Covered by Needham & Company LLC Franklin Resources Inc. Cuts Stock Holdings in Teradyne, Inc. (NASDAQ:TER) Southern First Bancshares, Inc. (NASDAQ:SFST) Shares Sold by Alliancebernstein L.P. Best Ecommerce Stocks To Follow Today – April 11th Metaverse Stocks To Follow Today – April 10th 26,549 Shares in USANA Health Sciences, Inc. (NYSE:USNA) Purchased by Norges Bank Cybersecurity Stocks To Research – April 10th Trexquant Investment LP Takes $527,000 Position in iShares Russell 1000 ETF (NYSEARCA:IWB) ExodusPoint Capital Management LP Buys Shares of 19,629 Oceaneering International, Inc. (NYSE:OII)", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.etfdailynews.com/2025/04/12/promising-automotive-stocks-to-watch-today-april-10th-2/", "source": "ETF Daily News", "published_at": "2025-04-12T09:26:52"}, {"id": 3, "title": "Man Charged With Trump and Musk Assassination Threats: What to Know", "content": "Man Charged With Trump and Musk Assassination Threats: What to Know - Newsweek Share Copy Link ✓ Link copied to clipboard!", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.newsweek.com/donald-trump-elon-musk-assassination-attempt-charge-2058952", "source": "Newsweek", "published_at": "2025-04-12T09:19:33"}, {"id": 4, "title": "Unlock Success with the Surefire Local Marketing Platform for Your Business | Flipboard", "content": "Unlock Success with the Surefire Local Marketing Platform for Your Business | Flipboard Like comment Flip Share Unlock Success with the Surefire Local Marketing Platform for Your Business Key Takeaways Robust Local Marketing Tools: Surefire Local Marketing Platform provides essential tools tailored to small businesses for enhancing … smallbiztrends.com - John Cook • 1d Read more on smallbiztrends.com Viral Marketing Internet Marketing Marketing Strategy Marketing Business Related storyboards 25 Best Work-From-Home and Quiet Jobs Ideal for Introverts By Radical FIRE Secrets To Success From 5 Dominating Women By MadameNoire Old-School Passive Income Ideas That Still Work Today By GOBankingRates See more More stories from Viral Marketing Meet the richest influencers in the world – including a 12-year-old child hellomagazine.com - Matthew Moore 4 Monster Stocks to Hold for the Next 10 Years The Motley Fool - Geoffrey Seiler There’s a way to get all your favorite AI tools for life PCWorld - DealPost Team Trump Administration Ready To Chop Zuckerberg’s Social Media Giant Meta Down to Size nysun.com - BRADLEY CORTRIGHT How to Establish a Stable Sales Pipeline Through the Highs and Lows of Business Inc Magazine - David Finkel I paid $20 for an AI marketing agent - and here's what it got me ZDNET - Lester Mapp See more stories in Viral Marketing More stories from Internet Marketing Business 3 hours ago Meet the richest influencers in the world – including a 12-year-old child hellomagazine.com - Matthew Moore • 3h In the new digital age, influencing has become a lucrative career, with those who can find the sweet spot able to earn millions from their … Business 1 hour ago 4 Monster Stocks to Hold for the Next 10 Years The Motley Fool - Geoffrey Seiler • 1h With the stock market whipsawing amid to on-again, off-again tariffs, now is a great time scoop up some great stocks at discounted prices. Let's look … Meta AI 1 hour ago There’s a way to get all your favorite AI tools for life PCWorld - DealPost Team • 1h TL;DR: 1min.AI combines popular AI tools like GPT-4.0 and Midjourney, and lifetime access is only $79.97. AI tools like ChatGPT popped into existence, … See more stories in Internet Marketing Join the flipboard community Discover, collect, and share stories for all your interests Sign up More stories from Marketing Strategy Management 20 hours ago Founders, This Missing Strategy Will Transform Your Business’s Finance Inc Magazine - Andrea Olson • 20h Maximizing the impact of every dollar starts with the right strategy. As an entrepreneur, I’ve learned that my relationship with money isn’t just about counting dollars. It’s about strategy — more specifically, making strategic decisions that can either fuel my business or bring it to a grinding … Viral Marketing 2 days ago Tesla turns to 'edgy' social media marketing amid brand damage Electrek - Fred Lambert • 2d Tesla has turned to using ‘edgy’ social media marketing amid a brand damage crisis caused by CEO Elon Musk. Tesla famously didn’t use advertising until it started dabbling in it in 2023—shortly after Tesla CEO Elon Musk bought Twitter, a platform that relies on advertising. Unsurprisingly, it didn’t … Lifestyle 1 day ago 'The White Lotus' effect: How HBO's hit series is redefining travel, style, and brand strategy bleumag.com - Benjamin Turner for Compartés • 1d In this article Since its debut, \"The White Lotus\" has quietly built a world that audiences don't just watch—they want to live in. Its sun-drenched … See more stories in Marketing Strategy", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://flipboard.com/article/unlock-success-with-the-surefire-local-marketing-platform-for-your-business/f-648c76c366%2Fsmallbiztrends.com", "source": "Flipboard.com", "published_at": "2025-04-12T09:14:18"}, {"id": 5, "title": "Xi calls on EU to join China to resist Trump trade war 'bullying'", "content": "Xi calls on EU to join China to resist Trump trade war 'bullying' Home :: WMD :: Library :: News :: China :: 2025 :: April :: Military WMD Menu Introduction Systems Facilities Agencies Operations Countries Hot Documents News Reports Policy Budget Congress Links Intelligence Homeland Security Space Weapons of Mass Destruction (WMD) Xi calls on EU to join China to resist Trump trade war 'bullying' In-Depth Coverage Iran Press TV Friday, 11 April 2025 10:08 AM China's President Xi Jinping has called on the European Union to join Beijing in opposing the United States' \"bullying\" practices as Washington's controversial tariffs continue to shock global markets. Speaking with visiting Spanish Prime Minister Pedro Sanchez in Beijing on Friday, the Chinese leader said his nation was confident, self-reliant and \"not afraid\" of getting engaged in a trade war with America. He said Beijing will never back down when the Chinese nation is faced with the \"unreasonable\" demands of the Trump administration. However, he added, \"There are no winners in a trade war, and going against the world will only lead to self-isolation.\" The comments come as US President Donald Trump temporarily froze many tariffs for 90 days but imposed 145 percent tariffs on Chinese goods on Thursday. Consequently, global financial markets plummeted on trade jitters among investors. \"For over 70 years, China's development has relied on self-reliance and hard work — never on handouts from others, and it is not afraid of any unjust suppression,\" Xi said. \"Regardless of how the external environment changes, China will remain confident, stay focused, and concentrate on managing its own affairs well,\" he added. Xi called on the Brussels leadership to join Beijing in resisting \"unilateral bullying\" by the Trump administration. His comments to Sanchez, indicating Beijing's preference to expand cooperation with the EU, come amid escalating tensions with the United States. Meanwhile, European Union chief Ursula von der Leyen told the Financial Times that it remained armed with a \"wide range of countermeasures\" if negotiations with Trump hit the skids. \"An example is you could put a levy on the advertising revenues of digital services,\" applying across the bloc, she said. Legendary New York investor Ray Dalio, the founder of Bridgewater Associates, the world's largest hedge fund, said investors have been left with \"an element of trauma or shock or fear\" after all the global markets turmoil this week. \"It dramatically affected psychology and attitude about the United States' reliability,\" he said in an interview with Bloomberg Television. Top adviser to Trump, Elon Musk, even expressed doubts about the tariff war, which he has said would drive up costs for Tesla, his electric automaker. \"I hope it is agreed that both Europe and the United States should move ideally in my view to a zero-tariff situation, effectively creating a free trade zone between Europe and North America,\" Musk said in a video conference with Italian politicians. On Sunday, Trump's trade adviser Peter Navarro said that Musk \"doesn't understand\" the situation. Musk fired back, calling Navarro a \"moron\". Trump wrote on his social media platform Truth Social on Wednesday that it's a \"Great time to buy\" stocks. Shortly after, the S&P 500 fell 3.5 percent as fears grew that the worsening trade war with China would crimp growth. NEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address Do Not Sell My Personal Information Advertise with Us | About Us | Site Map | Privacy Copyright © 2000-2025 GlobalSecurity.org All rights reserved. Site maintained by: John Pike Privacy Manager", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.globalsecurity.org/wmd/library/news/china/2025/04/china-250411-presstv02.htm", "source": "Globalsecurity.org", "published_at": "2025-04-12T08:41:54"}, {"id": 6, "title": "Benchmark Cuts Tesla (NASDAQ:TSLA) Price Target to $350.00", "content": "Benchmark Cuts Tesla (NASDAQ:TSLA) Price Target to $350.00 - ETF Daily News Skip to main content Benchmark Cuts Tesla (NASDAQ:TSLA) Price Target to $350.00 Posted by MarketBeat News on Apr 12th, 2025 Share on Twitter Share on Facebook Share on LinkedIn Share on Stocktwits Tesla ( NASDAQ:TSLA – Free Report ) had its target price decreased by Benchmark from $475.00 to $350.00 in a research note issued to investors on Wednesday, Marketbeat.com reports. Benchmark currently has a buy rating on the electric vehicle producer’s stock. A number of other equities research analysts also recently issued reports on the stock. Oppenheimer reiterated a “mixed” rating on shares of Tesla in a research report on Tuesday, March 18th. The Goldman Sachs Group cut their price target on Tesla from $320.00 to $275.00 and set a “neutral” rating for the company in a research note on Thursday, April 3rd. JPMorgan Chase & Co. lowered their price target on Tesla from $135.00 to $120.00 and set an “underweight” rating for the company in a research note on Wednesday, March 12th. Canaccord Genuity Group reiterated a “buy” rating and issued a $404.00 target price on shares of Tesla in a research note on Monday, March 17th. Finally, New Street Research raised shares of Tesla from a “neutral” rating to a “buy” rating and set a $460.00 target price for the company in a research report on Monday, January 6th. Eight investment analysts have rated the stock with a sell rating, nine have given a hold rating, twenty-one have assigned a buy rating and one has given a strong buy rating to the company. Based on data from MarketBeat.com, Tesla has a consensus rating of “Hold” and an average target price of $298.59. Get Tesla alerts: View Our Latest Report on Tesla Tesla Price Performance Want More Great Investing Ideas? 10 Stocks to Sell NOW! 3 Stocks to DOUBLE This Year The 10 Best Stocks to Own in 2023 7 Stocks to Buy and Hold Forever Shares of NASDAQ:TSLA opened at $251.96 on Wednesday. The stock’s 50 day moving average price is $285.19 and its 200 day moving average price is $323.09. Tesla has a 12 month low of $138.80 and a 12 month high of $488.54. The stock has a market cap of $810.42 billion, a price-to-earnings ratio of 123.51, a PEG ratio of 5.86 and a beta of 2.58. The company has a debt-to-equity ratio of 0.08, a current ratio of 2.02 and a quick ratio of 1.61. Tesla ( NASDAQ:TSLA – Get Free Report ) last posted its quarterly earnings data on Wednesday, January 29th. The electric vehicle producer reported $0.66 earnings per share (EPS) for the quarter, missing the consensus estimate of $0.74 by ($0.08). Tesla had a return on equity of 10.31% and a net margin of 7.26%. Equities research analysts anticipate that Tesla will post 2.56 earnings per share for the current fiscal year. Insider Activity In other news, CFO Vaibhav Taneja sold 7,000 shares of the stock in a transaction that occurred on Monday, February 3rd. The stock was sold at an average price of $383.11, for a total value of $2,681,770.00. Following the completion of the transaction, the chief financial officer now directly owns 108,965 shares of the company’s stock, valued at approximately $41,745,581.15. This represents a 6.04 % decrease in their position. The sale was disclosed in a filing with the SEC, which is accessible through the SEC website . Also, Director Robyn M. Denholm sold 112,390 shares of the business’s stock in a transaction on Monday, February 3rd. The shares were sold at an average price of $384.04, for a total value of $43,162,255.60. Following the completion of the sale, the director now directly owns 85,000 shares in the company, valued at approximately $32,643,400. This represents a 56.94 % decrease in their position. The disclosure for this sale can be found here . In the last 90 days, insiders sold 374,228 shares of company stock worth $123,791,123. 20.70% of the stock is currently owned by corporate insiders. Hedge Funds Weigh In On Tesla Institutional investors and hedge funds have recently added to or reduced their stakes in the company. Vanguard Group Inc. grew its position in Tesla by 1.5% during the 4th quarter. Vanguard Group Inc. now owns 243,193,181 shares of the electric vehicle producer’s stock worth $98,211,134,000 after acquiring an additional 3,571,793 shares during the last quarter. Geode Capital Management LLC boosted its stake in Tesla by 2.8% in the fourth quarter. Geode Capital Management LLC now owns 61,011,604 shares of the electric vehicle producer’s stock worth $24,566,217,000 after purchasing an additional 1,655,203 shares in the last quarter. Norges Bank bought a new stake in shares of Tesla during the fourth quarter worth $14,420,248,000. FMR LLC increased its stake in shares of Tesla by 40.1% in the fourth quarter. FMR LLC now owns 34,661,400 shares of the electric vehicle producer’s stock valued at $13,997,660,000 after buying an additional 9,920,325 shares in the last quarter. Finally, Northern Trust Corp raised its holdings in shares of Tesla by 21.6% in the fourth quarter. Northern Trust Corp now owns 28,579,615 shares of the electric vehicle producer’s stock valued at $11,541,592,000 after buying an additional 5,075,418 shares during the last quarter. 66.20% of the stock is currently owned by institutional investors and hedge funds. About Tesla ( Get Free Report ) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. Recommended Stories Five stocks we like better than Tesla How to Most Effectively Use the MarketBeat Earnings Screener JPMorgan is a Buy, if You Can Handle The Volatility 3 Ways To Invest In Coffee, Other Than Drinking It United States Steel’s Crash: An Unmissable Buying Opportunity What is a Dividend King? Rocket Lab Stock: Weathering the Storm, Time for a Comeback? Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter . You might be interested in: 27,573 Shares in Hilltop Holdings Inc. Bought by Norges Bank Norges Bank Buys New Holdings in Guess?, Inc. Arrowstreet Capital Limited Partnership Makes New $828,000 Investment in Service Properties Trust Electric Vehicle Stocks To Keep An Eye On – April 10th Best Cloud Storage Stocks To Follow Today – April 10th Geode Capital Management LLC Has $68.42 Million Stock Holdings in Sensient Technologies Co. Daily Ratings & News for Tesla Complete the form below to receive the latest headlines and analysts' recommendations for Tesla with MarketBeat's free daily email newsletter: Follow @etfdailynews Recent News 27,573 Shares in Hilltop Holdings Inc. (NYSE:HTH) Bought by Norges Bank Norges Bank Buys New Holdings in Guess?, Inc. (NYSE:GES) Arrowstreet Capital Limited Partnership Makes New $828,000 Investment in Service Properties Trust (NASDAQ:SVC) Electric Vehicle Stocks To Keep An Eye On – April 10th Best Cloud Storage Stocks To Follow Today – April 10th Geode Capital Management LLC Has $68.42 Million Stock Holdings in Sensient Technologies Co. (NYSE:SXT) ArcelorMittal S.A. (NYSE:MT) Shares Sold by National Bank of Canada FI Best Large Cap Stocks To Watch Today – April 11th Promising Virtual Reality Stocks To Follow Today – April 11th Top Apparel Stocks To Follow Now – April 10th Jazz Pharmaceuticals’ (JAZZ) “Buy” Rating Reiterated at Needham & Company LLC Best Leisure Stocks To Follow Today – April 10th Lincoln National Co. (NYSE:LNC) Receives Consensus Rating of “Hold” from Analysts Walmart’s (WMT) Outperform Rating Reiterated at Telsey Advisory Group Vornado Realty Trust (NYSE:VNO) Price Target Cut to $38.00 by Analysts at Piper Sandler Diversified Energy (NYSE:DEC) Research Coverage Started at Mizuho Jazz Pharmaceuticals plc (NASDAQ:JAZZ) Given Consensus Recommendation of “Moderate Buy” by Brokerages A-Mark Precious Metals, Inc. (NASDAQ:AMRK) Receives Average Recommendation of “Hold” from Analysts Trexquant Investment LP Has $467,000 Stock Holdings in Bioventus Inc. (NYSE:BVS) Sana Biotechnology, Inc. (NASDAQ:SANA) Stake Raised by ExodusPoint Capital Management LP", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.etfdailynews.com/2025/04/12/benchmark-cuts-tesla-nasdaqtsla-price-target-to-350-00/", "source": "ETF Daily News", "published_at": "2025-04-12T08:31:04"}, {"id": 7, "title": "Promising Automotive Stocks To Watch Today – April 10th", "content": "Promising Automotive Stocks To Watch Today – April 10th - ETF Daily News Skip to main content Promising Automotive Stocks To Watch Today – April 10th Posted by MarketBeat News on Apr 12th, 2025 Share on Twitter Share on Facebook Share on LinkedIn Share on Stocktwits NVIDIA, Tesla, and Taiwan Semiconductor Manufacturing are the three Automotive stocks to watch today, according to MarketBeat’s stock screener tool. Automotive stocks are shares of companies involved in the manufacturing, marketing, and distribution of motor vehicles or automotive components. They often reflect the overall health of the auto industry and are influenced by factors such as consumer demand, technological innovation, and regulatory changes. These companies had the highest dollar trading volume of any Automotive stocks within the last several days. Get alerts: NVIDIA (NVDA) NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. Want More Great Investing Ideas? 10 Stocks to Sell NOW! 3 Stocks to DOUBLE This Year The 10 Best Stocks to Own in 2023 7 Stocks to Buy and Hold Forever NASDAQ:NVDA traded down $8.61 during mid-day trading on Thursday, hitting $105.72. The stock had a trading volume of 206,410,798 shares, compared to its average volume of 314,856,609. The stock has a 50-day simple moving average of $119.29 and a two-hundred day simple moving average of $130.54. The company has a market capitalization of $2.58 trillion, a PE ratio of 41.48, a PEG ratio of 1.76 and a beta of 1.96. NVIDIA has a twelve month low of $75.61 and a twelve month high of $195.95. The company has a current ratio of 4.10, a quick ratio of 3.64 and a debt-to-equity ratio of 0.13. Read Our Latest Research Report on NVDA Tesla (TSLA) Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. NASDAQ TSLA traded down $27.47 during trading on Thursday, reaching $244.73. The company’s stock had a trading volume of 83,955,112 shares, compared to its average volume of 95,348,046. The firm has a market cap of $787.17 billion, a price-to-earnings ratio of 119.84, a P/E/G ratio of 5.86 and a beta of 2.58. The company has a debt-to-equity ratio of 0.08, a quick ratio of 1.61 and a current ratio of 2.02. The business’s fifty day moving average price is $290.62 and its 200-day moving average price is $323.14. Tesla has a twelve month low of $138.80 and a twelve month high of $488.54. Read Our Latest Research Report on TSLA Taiwan Semiconductor Manufacturing (TSM) Taiwan Semiconductor Manufacturing Company Limited, together with its subsidiaries, manufactures, packages, tests, and sells integrated circuits and other semiconductor devices in Taiwan, China, Europe, the Middle East, Africa, Japan, the United States, and internationally. It provides a range of wafer fabrication processes, including processes to manufacture complementary metal- oxide-semiconductor (CMOS) logic, mixed-signal, radio frequency, embedded memory, bipolar CMOS mixed-signal, and others. TSM traded down $9.20 during trading on Thursday, reaching $149.56. The company’s stock had a trading volume of 12,073,397 shares, compared to its average volume of 15,748,865. The company’s fifty day moving average price is $181.13 and its 200-day moving average price is $191.29. Taiwan Semiconductor Manufacturing has a 52-week low of $125.78 and a 52-week high of $226.40. The company has a market capitalization of $775.65 billion, a price-to-earnings ratio of 21.19, a price-to-earnings-growth ratio of 0.66 and a beta of 1.16. The company has a debt-to-equity ratio of 0.24, a quick ratio of 2.30 and a current ratio of 2.57. Read Our Latest Research Report on TSM Recommended Stories MarketBeat’s Top Five Stocks to Own in April 2025 Joby Aviation: Operational Momentum vs. Market Sentiment Broadcom’s Big Outperformance Shows Strength Amid Tariff Decline Carvana: Can Turnaround Strength Outdrive Market Headwinds? Meta Seeks Trump’s Help in FTC Trial: The Implications Are Huge Delta, Walmart Cut Profit Targets: Could Start Domino Effect You might be interested in: 27,573 Shares in Hilltop Holdings Inc. Bought by Norges Bank Norges Bank Buys New Holdings in Guess?, Inc. Arrowstreet Capital Limited Partnership Makes New $828,000 Investment in Service Properties Trust Electric Vehicle Stocks To Keep An Eye On – April 10th Best Cloud Storage Stocks To Follow Today – April 10th Geode Capital Management LLC Has $68.42 Million Stock Holdings in Sensient Technologies Co. Free Email Newsletter Complete the form below to receive the latest headlines and analysts' recommendations for your stocks with MarketBeat's free daily email newsletter: Follow @etfdailynews Recent News 27,573 Shares in Hilltop Holdings Inc. (NYSE:HTH) Bought by Norges Bank Norges Bank Buys New Holdings in Guess?, Inc. (NYSE:GES) Arrowstreet Capital Limited Partnership Makes New $828,000 Investment in Service Properties Trust (NASDAQ:SVC) Electric Vehicle Stocks To Keep An Eye On – April 10th Best Cloud Storage Stocks To Follow Today – April 10th Geode Capital Management LLC Has $68.42 Million Stock Holdings in Sensient Technologies Co. (NYSE:SXT) ArcelorMittal S.A. (NYSE:MT) Shares Sold by National Bank of Canada FI Best Large Cap Stocks To Watch Today – April 11th Promising Virtual Reality Stocks To Follow Today – April 11th Top Apparel Stocks To Follow Now – April 10th Jazz Pharmaceuticals’ (JAZZ) “Buy” Rating Reiterated at Needham & Company LLC Best Leisure Stocks To Follow Today – April 10th Lincoln National Co. (NYSE:LNC) Receives Consensus Rating of “Hold” from Analysts Walmart’s (WMT) Outperform Rating Reiterated at Telsey Advisory Group Vornado Realty Trust (NYSE:VNO) Price Target Cut to $38.00 by Analysts at Piper Sandler Diversified Energy (NYSE:DEC) Research Coverage Started at Mizuho Jazz Pharmaceuticals plc (NASDAQ:JAZZ) Given Consensus Recommendation of “Moderate Buy” by Brokerages A-Mark Precious Metals, Inc. (NASDAQ:AMRK) Receives Average Recommendation of “Hold” from Analysts Trexquant Investment LP Has $467,000 Stock Holdings in Bioventus Inc. (NYSE:BVS) Sana Biotechnology, Inc. (NASDAQ:SANA) Stake Raised by ExodusPoint Capital Management LP", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.etfdailynews.com/2025/04/12/promising-automotive-stocks-to-watch-today-april-10th/", "source": "ETF Daily News", "published_at": "2025-04-12T08:25:18"}, {"id": 8, "title": "Tesla owners should stay vigilant with safety steps as feds combat 'domestic terrorism': retired sergeant", "content": "Tesla owners can stay safe with tips from crime prevention expert | Fox News Recommended 01:08 Doomed NYC helicopter featured being inspected in company safety video 02:20 'God did that:' Trump's remarks and relationship with his faith 10:21 Dana White dishes on visit with Trump, Bill Maher and Kid Rock 01:40 Bodies of teen's parents found decomposed in Wisconsin home 02:29 Nude sculpture stands 'tall and proud' above San Francisco's Embarcadero Plaza 10:30 Protests erupt in NYC after judge allows for pro-Hamas activist's deportation 02:15 Walmart shooting in Georgia leaves 2 dead, 1 injured 00:40 San Francisco nude statue installation causes backlash 03:43 Mississippi governor touts ‘conservative reforms’ for making a ‘huge difference’ with students 04:27 Menendez brothers resentencing moves forward, judge rules 01:20 Hits and Misses 06:10 Republicans Pass a Budget Blueprint 04:19 Court tells Trump admin to ‘facilitate’ return of deported Maryland immigrant 00:24 Coming up on ‘Fox News Sunday’: April 13th, 2025 06:20 Kevin O’Leary sounds off as U.S.-China tariffs escalate 06:39 Shannon Bream explains immigration judge's ruling against Mahmoud Khalil 04:46 This Trump tariff move is a 'relief' to manufacturers, founder says 04:46 GOP rep touts Trump's historical perspective on the American economy 04:01 Labor secretary predicts US job growth will ‘continue’ amid push for more domestic manufacturing 04:08 Judge greenlights deportation case against Mahmoud Khalil close Video Elon Musk condemns violent attacks in Tesla as a 'fundamental case of terrorism' DOGE leader Elon Musk discusses the Wisconsin Supreme Court race, stopping fraud and violent attacks on Tesla on 'The Five.' Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. By entering your email and pushing continue, you are agreeing to Fox News' Terms of Use and Privacy Policy , which includes our Notice of Financial Incentive . Please enter a valid email address. By entering your email and pushing continue, you are agreeing to Fox News' Terms of Use and Privacy Policy , which includes our Notice of Financial Incentive . Tesla owners are being urged to take precautions to protect themselves amid a recent spate of vandalism against the vehicles across the United States. Since President Donald Trump took office in January and appointed Tesla owner Elon Musk to head the Department of Government Efficiency (DOGE), radical activists nationwide have taken their anger out on Tesla dealerships, collision centers, charging stations and privately-owned Teslas alike. Despite the fact that every Tesla vehicle is equipped with surveillance cameras, which the vehicle manufacturer calls Sentry Mode, unmitigated Tesla vandalism continues to grow. However, Attorney General Pam Bondi has already slapped four people with federal charges in fiery attacks on Tesla dealerships and charging stations. FBI INVESTIGATING AFTER WASHINGTON TESLA CHARGING STATION DAMAGED FOLLOWING ‘LOUD NOISE’ Elon Musk speaks during an event in the Oval Office with President Donald Trump at the White House on Feb. 11. (AP Images) During a Thursday cabinet meeting, she reiterated to Trump that the attacks, which she has described as \"domestic terrorism,\" are being taken very seriously. \"You gave us a directive to prosecute the people who are going after Tesla to the fullest extent of the law,\" Bondi said. \"Some of the greatest police work I've seen. We’ve made four arrests. There will be no negotiations at your directive.\" \"They’re all looking at 20 years in prison, and within the next 24 hours, you’re going to be seeing another huge arrest on a Tesla dealership [suspect]. That person will be looking at least 20 years in prison with no negotiations.\" A crime prevention expert and spokesperson for the National Police Association is offering safety tips to Tesla owners to safeguard themselves and their property. U.S. Attorney General Pam Bondi speaks during a news conference at the Department of Justice Building on Feb. 12, 2025 in Washington, D.C. (Anna Moneymaker/Getty Images) \"If you do drive a Tesla, you want to be aware of what's happening around you,\" retired Sgt. Betsy Brantner Smith told Fox News Digital. \"So do things like turn down your music. Turn down your audio. Pay attention, especially when you come up to a stop light someplace that you're going to have to sit for a few seconds, and look around you.\" Smith is a 29-year law enforcement veteran. During her career with the Naperville Police Department in Illinois, she supervised her department’s K-9 Unit, served as a field training sergeant, recruitment team sergeant, bike patrol coordinator, crowd control bike team leader, and supervisor of the Community Education/Crime Prevention Unit. \"When you're parking, be cautious where you're parking. Make sure you're parking somewhere well-lit, as close to a building as you can, where there's people,\" she said. \" I know that's not always possible. But really, awareness really is key.\" Smith also said owners who are able should park their Teslas in a garage. National Police Association spokesperson and retired Sgt. Betsy Brantner Smith said that Tesla owners should be vigilant amid recent crime wave. (Betsy Brantner Smith/Game of Crimes) She also said that she has noticed more Tesla owners remaining in their vehicles while the vehicles charge. \"They're working, and they're on the phone and things like that, where previously people very often would charge at a public charging station, and they'd go do some shopping or go to the gym or whatever,\" Smith said. Below is a list of reported cases of Tesla vandalism. Map of reported Tesla attacks across the United States. (Fox News) ELON MUSK CONDEMNS VIOLENT ATTACKS IN TESLA AS A ‘FUNDAMENTAL CASE OF TERRORISM’ Authorities are investigating a possible arson attack involving a Molotov cocktail on five Teslas at a collision center in Las Vegas, Nevada on Tuesday, March 18, 2025. (Souphany Vannavong via Storyful) Town and Country, Mo. – April 1 Matthew Reynolds of Ballwin, Missouri, faces felony property charges for allegedly keying a Tesla in the town of Town and Country. Reynolds is accused of scratching the entire side panel of a woman's Tesla. Boston – March 30 A woman in Boston allegedly vandalized a Tesla with a brick . A woman holds a brick before allegedly using it to vandalize a Tesla. (Boston Police Department) Albuquerque, N.M. – March 29 A Cybertruck in Albuquerque was keyed by an unknown vandal . \"It made me very angry. It frightened my kids. You know, we just don’t feel safe,\" the anonymous owner told KRQE. \"I don’t believe in doing actions like this and just getting away with it. Most of us have insurance, but I don’t want to claim my insurance. You know, I want to make him responsible for it.\" West Fargo, N.D. – March 29 Ryan Lyle Williams was arrested and charged with felony criminal mischief for allegedly keying a Cybertruck in a West Fargo, North Dakota, Costco parking lot. Williams is accused of carving an \"F\" into the front driver's side door of the vehicle. Aventura, Fla. – March 29 Yamaris Marrero, 45, of Hallandale Beach, faces a felony criminal mischief charge after allegedly vandalizing a Tesla with a large wad of chewing gum, according to Local 10. The vehicle sustained more than $2,600 in damage. A Tesla vehicle charges at a Tesla Supercharger site in Charlotte, N.C. (AP Photo/Chuck Burton) Novato, Calif. – March 28 A masked man was caught on a home surveillance camera smashing the windshield of a Cybertruck parked in a driveway. \"To come to my house and plan an attack like that, that person’s dangerous and needs to face consequences for what they’ve done,\" Jason Bedell, the owner of the Cybertruck, told KTVU . \"I'm a little [shaken] up right now, and I'm concerned that they may possibly come back, and it's not a good feeling, having my family here, my young son.\" Bedell is offering a $25,000 reward for information leading to the capture of the suspect. Brookhaven, Miss. – March 28 Osvaldo Torres-Rodriguez, 63, an illegal immigrant from Cuba, was allegedly caught on camera vandalizing a Tesla with a pair of pliers, a according to WAPT. The Brookhaven Police Department issued a felony warrant for his arrest. New York City – March 27 Two men were caught on video , one carving the word \"Nazi\" and a swastika onto a Cybertruck in Brooklyn. \"I feel myself burning inside,\" said Ben Hamo, the owner of that Cybertruck, who is Jewish. Video JEWISH TESLA OWNER DEMANDS HATE CRIME CHARGES AFTER CYBERTRUCK DEFACED WITH SWASTIKA Bloomington, M.N., – March 26 A vandal allegedly keyed a Tesla in a grocery story parking lot, causing $3,200 in damages. \"Stop damaging these cars all around the country, and we're tired of our insurance rates going up,\" said Bloomington Police Chief Booker Hodges. \"And what are you really accomplishing? Knock this off.\" Bradenton, Fla. – March 26 Three Teslas were vandalized in a Bradenton shopping center parking lot, the Bradenton Herald reported. One of the vehicles sustained about $1,000 in damage, while the other two sustained more than $3,000 in damage. The suspect wore a blue shirt and drives a dark-colored Chevrolet, police said. Texarkana, Texas – March 25 Demarqeyun Cox, 33, was arrested for allegedly ramming a \"mini four-wheeler\" into several Tesla vehicles, according to police. He was charged with felony criminal mischief and is being held in jail on a $105,000 bond. Video Austin, Texas – March 24 Incendiary devices were discovered and removed from a Tesla dealership. Police are investigating. \"The devices, which were determined to be incendiary, were taken into police custody without incident,\" an Austin police statement said. \"This is an open and ongoing investigation.\" Authorities in Austin, Texas found incendiary devices at a Tesla dealership. (Bryan Preston/Fox News Digital) Seattle – March 23 A Seattle couple, identified only as Ally and Ryan, were victims of a Tesla keying , KIRO 7 reported. \"That you can tell in the video, they’re recording the whole thing – you can easily tell this is targeted, there’s intent there and kind of mockery of it with all the recording,\" said Ryan. \"Should I not be driving out during these times? Should I now take the bus? Should I worry about my safety? It’s sad to see that, you know, not just myself but other people’s lives are being affected.\" Garner, N.C. – March 23 According to WRAL , a man identified only as Jeremy said that someone carved the word \"NAZI\" into his Tesla. \"I was working from home and my wife was out running some errands. [She] came home and as she was coming in past the car, she saw the damage to it,\" Jeremy said. \"We immediately started reviewing the footage from the car because it does have Sentry Mode – but unfortunately we didn’t see anything.\" An American flag flies near a Tesla Supercharger station on Wednesday, Oct. 26, 2022 in Kokomo, IN. (Kent Nishimura / Los Angeles Times) Newtown Township, Penn. – March 23 A Cybertruck was vandalized with a permanent marker while the vehicle's owner dined inside a restaurant. The suspects are juveniles, according to WPVI. Bretton Woods, N.H. – March 22 Kerri Pouliot's Cybertruck was vandalized in the parking lot of the Omni Mountain Resort & Spa in Bretton Woods, New Hampshire. Sentry Mode video showed a man keying the vehicle while walking past. She called police, and the male suspect was confronted by police in the parking lot. The incident is under investigation. Video Rock Springs, Wyo. – March 22 A rural Tesla charging station was vandalized when swastikas were spray-painted on the chargers , according to wyomingnews.com. Wichita, Kansas – March 22 Abigail Gill, who uses a wheelchair, was the victim of a keying while she was dining in a restaurant. \"It’s a super saddening and disappointing thing to see,\" she told \" Fox & Friends .\" The damage to her vehicle was upwards of $7,000. Video Las Vegas – March 18 Paul Hyon Kim, 36, allegedly firebombed a Tesla dealership with Molotov cocktails, setting five vehicles ablaze. He has been charged with multiple state crimes ranging from destruction of property, arson and possessing a fire device, and the FBI said he will be charged federally. \"There's nothing courageous or noble about firebombing private property and terrorizing your local community,\" said Spencer Evans, special agent in charge of the FBI's Las Vegas Bureau. \"The self-righteous mob that's cheering you on today to commit acts of violence on their behalf will leave you high and dry and forget about you tomorrow. And at the end of the day, you and you alone will be held responsible and face the prospect of a lengthy prison sentence.\" Paul Hyon Kim, the suspect arrested in Molotov attack on Vegas Tesla dealership (Hal Sparks via Storyful / Las Vegas Metropolitan Police Department) SUSPECTED TESLA ARSONISTS HIT WITH FEDERAL CHARGES IN ACTS OF 'DOMESTIC TERRORISM': AG Kansas City, Mo. – March 17 A Cybertruck was set on fire in the parking lot of a Tesla dealership in Kansas City on March 17, just before midnight. According to the Kansas City Star , the fire then spread to a second vehicle before firefighters arrived at the scene. Bystander video shows a suspected arson attack after two Cybertrucks were set on fire at a Tesla dealership in Kansas City on Monday, March 17, 2025. (Levi Campbell via Storyful) The FBI’s Kansas City field office and the ATF issued a joint statement on the incident saying it was \"too early in the investigation to comment further\" or give more details on what may have occurred. Encinitas, Calif. – March 17 A Tesla dealership was subjected to the wrath of anti-Musk radicals who smashed the building's windows and spray-painted it with swastikas, according to The San Diego Tribune . San Jose, Calif. – March 17 A suspect was caught on video keying a Tesla in a Costco parking lot, and was captured almost immediately. \"Within less than 24 hours of the viral vandalism incident being reported to the San Jose Police Department , we successfully identified, located, and arrested the individual responsible for this act of felony vandalism,\" San Jose police said in a post on X. A San Jose man keys a Tesla at a Costco parking lot on March, 14, 2025. (x/@SanJosePD) \"Keying a car because you don’t like the person who designed it is like breaking a clock because you don’t like the time it shows,\" San Jose Mayor Matt Mahan said. \"If this crime was politically motivated, our residents can’t be held accountable for something Elon Musk is doing 3,000 miles away.\" Berkeley, Calif. – March 16 A Berkeley man who identified himself as Hiroshi was the victim of vandalism in a Whole Foods parking lot. Another man jumped out of his vehicle and spray-painted Hiroshi's Tesla, as seen on Sentry Mode footage. \"I wasn't shocked because this has been happening so frequently,\" he told ABC7 . \"Even the police, when they showed up, both officers are Tesla owners as well. They expressed to me that they've been dealing with this so much. It's like a trend.\" Washington – March 2 to March 14 There were six separate instances of vandalism reported against Tesla vehicles. Those incidents range from keying swastikas to spray-painting other vulgarities. According to The Washington Examiner , the Metro Police Department is investigating the incidents as hate crimes. ELON MUSK IN ‘SHOCK’ OVER DEMS' ALLEGED ‘HATRED AND VIOLENCE,’ LAMENTS ‘DERANGED’ ATTACKS ON TESLA PLANTS Five Tesla vehicles were set on fire and shot at in what police are investigating as a \"targeted attack\" at a local repair center in Las Vegas, Nevada on March 18. (Hal Sparks via Storyful) Buffalo Grove, Ill. – March 14 A Tesla Sales, Service, and Delivery Center was vandalized, FOX 32 Chicago reported . Shortly thereafter, Erin L. White, 27, was taken into custody after a brief investigation and charged with felony criminal damage to property. It is unclear what the extent of the damage was. Dallas – March 13 An anonymous victim of a Tesla keying at the Dallas-Fort Worth International Airport , caught on his vehicle's Sentry Mode, is suing the man who allegedly vandalized his car. The suspect, Rafael Hernandez, was arrested March 22 on a felony criminal mischief charge by the Tarrant County District Attorney's Office. \"I believe strongly that I was targeted because my car is a Tesla,\" the owner told Fox News Digital. \"I didn’t even realize that this nationwide Tesla attack was even a thing — until I was thrown into that world. What’s important to me is that it happened, it was intentional, and it was wrong. As a result, I’ve been thrown into a nightmare, and I don’t want this to happen to anyone else.\" A man was seen on camera keying a Tesla in the Dallas-Fort Worth International Airport parking lot. The victim's attorney Majed Nachawati, right, spoke with Fox News Digital about the incident. (Fox News) Tigard, Ore. – March 13 and March 6 Two weeks in a row, a suspect or suspects opened fire on a Tesla dealership. \"Early this morning … more than a dozen shots were fired at the dealership causing extensive damage to cars and showroom windows,\" the Tigard Police Department said in an Instagram post after the first shooting. \"A security guard was on scene at the time; thankfully he was not hurt. Kentwood, Mich. – March 10 The Kentwood Police Department said vandals spray-painted five Tesla Cybertrucks, and said they have two persons of interest. Two suspects are captured on camera in a case of vandalism of a Tesla in Michigan. (Kentwood Police Department) The suspects spray-painted \"Nazis Always Lose\" on the passenger side of the vehicle. A Cybertuck in Kentwood, Michigan was spray-painted with \"Nazis Always Lose.\" (Kentwood Police Department) Boston – March 11 to March 19 Boston police suspect that one person was responsible for vandalizing multiple Teslas in the Fenway-Kenmore neighborhood on separate days mid-March. Police released a photo of the suspect on March 29. Suspect in a string of Tesla vandalism cases in Boston from March 13 - March 19. (Boston Police Department) Dedham, Mass. – March 11 Tires were slashed on three Tesla vehicles in an overnight parking area, and two of the vehicles, both Cybertrucks, were also spray-painted. \"Responding officers were advised that words had been spray-painted on two Tesla Cyber-trucks and all four tires on each vehicle had been damaged. In addition, all four tires on a Tesla Model S were reported damaged,\" according to the Dedham Police Department. Tesla vehicles are seen charging at a Supercharger electric vehicle charging station, Walnut Creek, California, Sept. 10, 2024. (Smith Collection/Gado) Seattle – March 9 Four Cybertrucks parked in a Tesla lot in Seattle were damaged in a fire. Authorities told the Associated Press that no one was injured and no property other than vehicles was damaged. Loveland, Colo. – March 7 Cooper Jo Fredrick, 24, was arrested in Plano, Texas, on suspicion of attacking a Tesla dealership on March 7 in Loveland, Colo., according to federal authorities. He is facing federal charges and up to 20 years in prison after tossing an incendiary onto the dealership's lot, igniting two cars. Cooper Jo Frederick, 24, allegedly firebombed a Tesla dealership in Colorado earlier this month. (Larimer County Sheriff's Office) Frederick is also facing local charges, including second-degree arson and possession of explosives or incendiary devices. North Charleston, S.C. – March 7 Daniel Clarke-Pounder, 24, allegedly wrote anti-Trump messages and pro-Ukraine messages around Tesla charging stations before lighting three of the charging stations on fire with Molotov cocktails on March 7. Court documents, citing witnesses, say Clarke-Pounder spray-painted in red paint, \"F--- Trump\" and \"Long Live Ukraine\" in a Tesla charging station parking spot. Clarke-Pounder, who accidentally lit himself on fire during the attack, was charged federally with arson of property in interstate commerce. Littleton, Mass. – March 3 Police said that seven Tesla charging stations were lit on fire in the small town. \"Responding officers observed that several Tesla charging stations were engulfed in flames and heavy, dark smoke,\" said a release from the Littleton police. While waiting for the electric department to arrive, another charging station caught fire. A total of seven charging stations sustained heavy fire-related damage.\" EXCLUSIVE: GOP FIREBRAND DARES DEMS TO CONDEMN ATTACKS ON ELON MUSK'S TESLA Ontario, Calif. – March 3 Footage from the parking lot of the Ontario International Airport in California showed a man swinging his luggage bag wildly at a Tesla Model Y, causing $3,000 in damage. Owings Mills, Md. – March 2 A Tesla dealership in Owings Mills, Md., a suburb of Baltimore, was vandalized with spray paint that read \"No Musk,\" as well as a symbol that looked like a swastika or an \"X,\" the latter of which could symbolize Musk's ownership of the microblogging site. Loveland, Colo. – Jan. 29 to Feb. 24 Lucy Grace Nelson, also known as Justin Thomas Nelson, 42, was first arrested in Loveland, Colorado, on Jan. 29 after attempting to set a Tesla dealership on fire with Molotov cocktails. Nelson was later found in possession of materials used to produce additional incendiary weapons, including a container of gasoline, bottles, and wick materials, on Feb. 24, prosecutors said. Lucy Grace Nelson is charged with a number of crimes related to incidents at a Colorado Tesla dealership. (Loveland Police Department) Nelson was charged federally with arson of property in interstate commerce and possession of unregistered destructive device, and locally with one count of malicious destruction of property, explosives or incendiary devices use, felony criminal mischief and criminal attempt to commit felonies. During the same timeframe, there were also three separate instances of graffiting at the dealership, though it is unclear whether Nelson was involved. Salem, Ore. – Feb 19 and Jan. 20 Adam Matthew Lansky, 41, threw approximately eight Molotov cocktails at a Tesla dealership located in Salem, Oregon, on Jan 20, according to federal prosecutors. One vehicle was completely destroyed, and several others were damaged. On Feb. 19, officers responded early in the morning to a call at the same location and found \"projectiles believed to be spent bullets, bullet fragments, and several projectile impacts. Lansky was also allegedly in possession of an AR-15 rifle during the attack. He has been charged federally with arson of property in interstate commerce and possession of unregistered destructive device. Video Upon the federal indictments of Nelson, Lansky and Clarke-Pounder, Bondi said the arrests should be a warning to others who might commit violent attacks. \"The days of committing crimes without consequence have ended,\" Bondi said. \"Let this be a warning: if you join this wave of domestic terrorism against Tesla properties, the Department of Justice will put you behind bars.\" However, one expert says accused vandals not only need to face consequences, but the examples of them facing consequences need to be more publicly extravagant in order to deter future criminal activity. \"You know, we haven't seen real consequences yet,\" former NYPD detective Rob O'Donnell told Fox News Digital. \"We haven't seen people marched around in handcuffs. I mean, we've seen people identified, we've seen the threat of charges. We've seen, 'you're going to face 20 years [in prison], it's going to be federal charges.' But until they actually see people's lives ruined, they're going to be led by emotion, pure rage rather than any common sense.\" CLICK HERE TO GET THE FOX NEWS APP O'Donnell started off as a street cop in the 1980s, when the city had an epidemic of subway train graffiti. During that time, police used decoy trains to catch graffiti vandals, and O'Donnell suggested that Tesla could partner with law enforcement and do something similar to catch and deter would-be vandals. \"[Radical activists] lost all sense of reality and reasoning,\" he said. \"And that might be a bigger issue, that politics has brought us to this point. And I've talked about this since the election. Democrats are really leaderless. They don't have a message. They're basically listening to whoever has the loudest megaphone. And if the person with the loudest megaphone is telling you time and time again ‘take [your anger] out here,’ people unfortunately are going to listen.\" Fox News Digital reached out to Tesla for comment. Fox News' Rachel Wolf, Pilar Arias, Louis Casiano and Preston Mizell contributed to this report. Peter D'Abrosca joined Fox News Digital in 2025 after four years as a politics reporter at The Tennessee Star. He grew up in Rhode Island and is a graduate of Elon University. Follow Peter on X at @pmd_reports . Send story tips to peter.dabrosca@fox.com. Get all the stories you need-to-know from the most powerful name in news delivered first thing every morning to your inbox Arrives Weekdays Subscribe Subscribed Subscribe You've successfully subscribed to this newsletter!", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.foxnews.com/us/tesla-owners-should-stay-vigilant-safety-steps-feds-combat-domestic-terrorism-retired-sergeant", "source": "Fox News", "published_at": "2025-04-12T08:00:06"}, {"id": 9, "title": "Tesla (NASDAQ:TSLA) Trading Down 3.4% Following Analyst Downgrade", "content": "Tesla (NASDAQ:TSLA) Trading Down 3.4% Following Analyst Downgrade - ETF Daily News Skip to main content Tesla (NASDAQ:TSLA) Trading Down 3.4% Following Analyst Downgrade Posted by MarketBeat News on Apr 12th, 2025 Share on Twitter Share on Facebook Share on LinkedIn Share on Stocktwits Tesla, Inc. ( NASDAQ:TSLA – Get Free Report ) shares traded down 3.4% during trading on Friday after UBS Group lowered their price target on the stock from $225.00 to $190.00. UBS Group currently has a sell rating on the stock. Tesla traded as low as $244.07 and last traded at $243.86. 44,806,066 shares traded hands during trading, a decline of 53% from the average session volume of 95,562,223 shares. The stock had previously closed at $252.40. Several other equities analysts also recently commented on the company. Oppenheimer reaffirmed a “mixed” rating on shares of Tesla in a research report on Tuesday, March 18th. Canaccord Genuity Group restated a “buy” rating and issued a $404.00 price target on shares of Tesla in a report on Monday, March 17th. Needham & Company LLC reiterated a “hold” rating on shares of Tesla in a report on Monday, February 10th. StockNews.com downgraded shares of Tesla from a “hold” rating to a “sell” rating in a research note on Friday, January 31st. Finally, Evercore ISI lifted their price target on shares of Tesla from $195.00 to $275.00 and gave the company an “in-line” rating in a research note on Friday, January 3rd. Eight analysts have rated the stock with a sell rating, nine have given a hold rating, twenty-one have issued a buy rating and one has assigned a strong buy rating to the company’s stock. According to data from MarketBeat, the stock presently has an average rating of “Hold” and an average target price of $298.59. Get Tesla alerts: Get Our Latest Stock Analysis on Tesla Insider Buying and Selling at Tesla Want More Great Investing Ideas? 10 Stocks to Sell NOW! 3 Stocks to DOUBLE This Year The 10 Best Stocks to Own in 2023 7 Stocks to Buy and Hold Forever In other news, CFO Vaibhav Taneja sold 7,000 shares of the business’s stock in a transaction on Monday, February 3rd. The shares were sold at an average price of $383.11, for a total transaction of $2,681,770.00. Following the sale, the chief financial officer now directly owns 108,965 shares of the company’s stock, valued at $41,745,581.15. The trade was a 6.04 % decrease in their ownership of the stock. The sale was disclosed in a filing with the Securities & Exchange Commission, which is available through this hyperlink . Also, Director James R. Murdoch sold 54,776 shares of the firm’s stock in a transaction on Monday, March 10th. The stock was sold at an average price of $240.79, for a total value of $13,189,513.04. Following the completion of the transaction, the director now owns 477,011 shares of the company’s stock, valued at $114,859,478.69. This trade represents a 10.30 % decrease in their position. The disclosure for this sale can be found here . In the last quarter, insiders have sold 374,228 shares of company stock worth $123,791,123. 20.70% of the stock is owned by corporate insiders. Institutional Investors Weigh In On Tesla A number of large investors have recently bought and sold shares of TSLA. True Wealth Design LLC increased its stake in shares of Tesla by 79.5% in the fourth quarter. True Wealth Design LLC now owns 70 shares of the electric vehicle producer’s stock worth $28,000 after acquiring an additional 31 shares during the period. Horrell Capital Management Inc. grew its position in Tesla by 75.6% during the 4th quarter. Horrell Capital Management Inc. now owns 79 shares of the electric vehicle producer’s stock worth $32,000 after purchasing an additional 34 shares during the period. GS Investments Inc. raised its stake in shares of Tesla by 193.3% during the 4th quarter. GS Investments Inc. now owns 88 shares of the electric vehicle producer’s stock valued at $36,000 after buying an additional 58 shares during the last quarter. Navigoe LLC acquired a new position in shares of Tesla in the 4th quarter valued at about $37,000. Finally, CoreFirst Bank & Trust purchased a new position in Tesla in the 4th quarter worth approximately $38,000. Hedge funds and other institutional investors own 66.20% of the company’s stock. Tesla Trading Down 0.2 % The company has a current ratio of 2.02, a quick ratio of 1.61 and a debt-to-equity ratio of 0.08. The company has a fifty day moving average price of $285.19 and a two-hundred day moving average price of $323.09. The firm has a market capitalization of $810.42 billion, a price-to-earnings ratio of 123.51, a PEG ratio of 5.86 and a beta of 2.58. Tesla ( NASDAQ:TSLA – Get Free Report ) last released its quarterly earnings data on Wednesday, January 29th. The electric vehicle producer reported $0.66 earnings per share for the quarter, missing analysts’ consensus estimates of $0.74 by ($0.08). Tesla had a return on equity of 10.31% and a net margin of 7.26%. As a group, research analysts forecast that Tesla, Inc. will post 2.56 earnings per share for the current fiscal year. Tesla Company Profile ( Get Free Report ) Tesla, Inc designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. Further Reading Five stocks we like better than Tesla What Are the FAANG Stocks and Are They Good Investments? JPMorgan is a Buy, if You Can Handle The Volatility Learn Technical Analysis Skills to Master the Stock Market United States Steel’s Crash: An Unmissable Buying Opportunity What is diluted earnings per share (Diluted EPS)? Rocket Lab Stock: Weathering the Storm, Time for a Comeback? Receive News & Ratings for Tesla Daily - Enter your email address below to receive a concise daily summary of the latest news and analysts' ratings for Tesla and related companies with MarketBeat.com's FREE daily email newsletter . You might be interested in: Wellington Management Group LLP Sells 19,295 Shares of Ventas, Inc. Wellington Management Group LLP Acquires 3,595 Shares of Expedia Group, Inc. Wellington Management Group LLP Acquires 14,469 Shares of Verve Therapeutics, Inc. Wellington Management Group LLP Acquires 39,195 Shares of Vanda Pharmaceuticals Inc. Wellington Management Group LLP Has $2.68 Million Stock Holdings in Okta, Inc. IQVIA Holdings Inc. Shares Bought by Wellington Management Group LLP Daily Ratings & News for Tesla Complete the form below to receive the latest headlines and analysts' recommendations for Tesla with MarketBeat's free daily email newsletter: Follow @etfdailynews Recent News Wellington Management Group LLP Sells 19,295 Shares of Ventas, Inc. (NYSE:VTR) Wellington Management Group LLP Acquires 3,595 Shares of Expedia Group, Inc. (NASDAQ:EXPE) Wellington Management Group LLP Acquires 14,469 Shares of Verve Therapeutics, Inc. (NASDAQ:VERV) Wellington Management Group LLP Acquires 39,195 Shares of Vanda Pharmaceuticals Inc. (NASDAQ:VNDA) Wellington Management Group LLP Has $2.68 Million Stock Holdings in Okta, Inc. (NASDAQ:OKTA) IQVIA Holdings Inc. (NYSE:IQV) Shares Bought by Wellington Management Group LLP Wellington Management Group LLP Has $1.84 Million Stock Holdings in Oruka Therapeutics, Inc. (NASDAQ:ORKA) Invitation Homes Inc. (NYSE:INVH) Stock Position Raised by Wellington Management Group LLP Conagra Brands, Inc. (NYSE:CAG) Shares Sold by Wellington Management Group LLP Wellington Management Group LLP Raises Stock Position in Shore Bancshares, Inc. (NASDAQ:SHBI) Wellington Management Group LLP Has $2.60 Million Stock Holdings in Southern First Bancshares, Inc. (NASDAQ:SFST) Fidelity National Financial, Inc. (NYSE:FNF) Shares Bought by Wellington Management Group LLP Wellington Management Group LLP Has $1.60 Million Position in International Bancshares Co. (NASDAQ:IBOC) Origin Bancorp, Inc. (NASDAQ:OBK) Shares Sold by Wellington Management Group LLP Wellington Management Group LLP Purchases 99 Shares of West Pharmaceutical Services, Inc. (NYSE:WST) Corebridge Financial Inc. Trims Stake in Ardagh Metal Packaging S.A. (NYSE:AMBP) Corebridge Financial Inc. Decreases Holdings in Lincoln Educational Services Co. (NASDAQ:LINC) Corebridge Financial Inc. Sells 9 Shares of Markel Group Inc. (NYSE:MKL) Northwest Pipe (NASDAQ:NWPX) Stock Position Reduced by Corebridge Financial Inc. Corebridge Financial Inc. Decreases Stock Holdings in FRP Holdings, Inc. (NASDAQ:FRPH)", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.etfdailynews.com/2025/04/12/tesla-nasdaqtsla-trading-down-3-4-following-analyst-downgrade/", "source": "ETF Daily News", "published_at": "2025-04-12T07:48:59"}, {"id": 10, "title": "Billionaire Prada Clan Succession Plan Bolstered by Versace Deal", "content": "Billionaire Prada Clan Succession Plan Bolstered by Versace Deal Why did BrightDrop pause EV production? Why is Primark expanding into the US? How are tariffs impacting global trade? Why did Trump exempt tech imports? What sparked US bond market volatility? Why did British Steel receive emergency aid? Why did BYD overtake Tesla in sales? How do tariffs affect consumer prices? What drives market swings on Wall Street? Billionaire Prada Clan Succession Plan Bolstered by Versace Deal bloomberg.com/news/articles/2025-04-12/billionaire-prada-clan-succession-plan-bolstered-by-versace-deal This story appeared on bloomberg.com , 2025-04-12 07:00:00.001000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/c63bf814406c57b2", "source": "Biztoc.com", "published_at": "2025-04-12T07:14:41"}], "timeline": [{"date": "2025-04-12T07:48:59", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T08:00:06", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T08:31:04", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T08:41:54", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T09:14:18", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-12T09:19:33", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T09:45:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T10:00:00", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T10:00:13", "score": -0.7, "sentiment": "NEGATIVE"}]}