{"company": {"id": 1, "name": "Tesla", "aliases": ["TSLA", "Tesla Inc"]}, "stats": {"POSITIVE": 5, "NEGATIVE": 19, "NEUTRAL": 23, "TOTAL": 47, "AVG_SCORE": -0.20638297872340425}, "mentions": [{"id": 151, "title": "Suspect admits targeting Pennsylvania governor in arson attack", "content": "Suspect admits targeting Pennsylvania governor in arson attack – NaturalNews.com Home Brighteon Prep with Mike Interviews Audio Books Download Our App About Us FAQs Search Sections Follow Us Podcast Store Subscribe Home Politics Culture Health & Medicine Finance & Economy Prepping & Survival Science Technology Popular Articles Today Week Month Year See More Popular Articles Health Ranger Report 7:46 BrightLearn - Fight for Free Speech: Landmark Lawsuit, an interview with Jeffrey Greyber and Jason Fyk 3:04 Trump the Tariff Sheriff - musical poetry by Mike Adams 1:39:45 Brighteon Broadcast News, Apr 14, 2025 TRUMP BREAKS THE WORLD and plunges America into an economic death spiral 49:53 John Perez issues SILVER PRICE ALERT in new interview with Mike Adams 5:36 BrightLearn - A Fight for Election Integrity, an interview with Tina Peters 2:24:03 Brighteon Broadcast News, Apr 11, 2025 END OF EMPIRE: Trump disses the entire world while the dollar collapses and GOLD SKYROCKETS 53:14 Dane Wigington from Geoengineering Watch joins Mike Adams to discuss heavy metals CHEMTRAILS FALLOUT Home // Conspiracy Suspect admits targeting Pennsylvania governor in arson attack 04/14/2025 // Cassie B. // Views Tags: antifa , arson , bias , chaos , Dangerous , domestic terrorism , insanity , Josh Shapiro , left cult , political violence , rioting Governor Josh Shapiro's home was firebombed in a targeted attack by Cody Balmer, who admitted ideological hatred. Balmer meticulously planned the assault, using Molotov cocktails and a hammer, intending harm. The attack caused severe damage to the historic residence, symbolizing the erosion of democratic norms. Bipartisan backlash condemned the violence, though media double standards on political violence persist. The incident highlights a broader crisis where extremism replaces democratic discourse with brute force. In the predawn hours of April 13, Pennsylvania Governor Josh Shapiro, his wife Lori, their four children, and guests were jolted awake by state troopers banging on their door. An arsonist had just firebombed their Harrisburg residence, hurling homemade explosives through shattered windows in what authorities called a \"targeted\" act of terrorism. The suspect, Cody Balmer, 38—who later admitted to \"harboring hatred\" toward Shapiro—turned himself in after confessing he would have assaulted the governor with a hammer if confronted. This brazen attack underscores a chilling trend: the erosion of democratic norms as political violence becomes alarmingly routine in America. A premeditated assault on democracy Balmer’s meticulously planned attack reads like a domestic terrorism manual. According to Pennsylvania State Police affidavits, he siphoned gasoline from a lawnmower, filled Heineken bottles to create Molotov cocktails, and walked an hour to the governor’s mansion. Surveillance footage captured him scaling a perimeter fence, smashing windows with a hammer, and igniting fires in the piano and dining rooms—spaces where Shapiro’s family had hosted a Passover Seder hours earlier. \"He was very methodical in his approach,\" said Lt. Col. George Bivens. Balmer’s admission that he anticipated harming occupants reveals intent beyond property damage; this was an attempted political assassination. The damage was severe : ceilings collapsed, furniture was reduced to ash, and Passover decorations lay blackened beside shattered glass. Yet the greater devastation is symbolic. The governor’s residence—a historic building housing state art and eight gubernatorial families since 1968—was violated not by a random criminal, but by a man weaponizing ideological rage. The backlash was swift and cross-partisan. Pennsylvania GOP Chairman Greg Rothman called the attack \"unacceptable,\" emphasizing, \"There is no place for violence in our society.\" Shapiro, a Democrat, echoed this: \"I don’t give a damn if it’s coming from one particular side or the other … It has to stop.\" Such solidarity is critical, yet it raises uncomfortable questions. Would national media devote equal coverage if a Republican governor were targeted? Recent history suggests not. When a left-wing activist shot GOP Congressman Steve Scalise in 2017 or when Trump supporters faced violent riots in 2020, many outlets downplayed the ideological motives. This double standard fuels division. As Shapiro noted, violent rhetoric—whether from fringe online forums or mainstream commentators—creates a permission structure for extremists. Balmer’s actions didn’t emerge in a vacuum. They reflect a culture where dehumanizing political opponents has become routine. The broader crisis: Violence as political language The Shapiro attack joins a grim roster: with the 2017 shooting of Rep. Scalise joined by last year’s assassination attempts against Donald Trump and the ongoing burning and firebombing of Tesla vehicles. The common thread? A rejection of democratic resolution in favor of brute force. Balmer’s use of improvised explosives mirrors tactics seen in extremist playbooks, yet his profile—a Harrisburg local with prior theft charges—defies easy categorization. This unpredictability makes such threats harder to combat. Critically, Balmer’s hatred wasn’t abstract. He told police he knew Shapiro might be home, accepting the risk of casualties. This distinguishes the act from mere vandalism; it was terrorism designed to intimidate a sitting official and his constituents. Authorities charged Balmer with eight felonies, including terrorism and attempted murder. Yet legal consequences alone won’t remedy the societal sickness enabling such violence. Shapiro’s refusal to be \"deterred\" is commendable, but his call for unity must be matched by systemic action: bolstering security for officials, de-escalating incendiary rhetoric, and rejecting partisan hypocrisy in condemning attacks. The fire at the governor’s mansion is a flare illuminating America’s crisis of civility. When ideology justifies arson against elected leaders, democracy itself burns. As Shapiro said amidst the ashes: \"We have to be better than this.\" Sources for this article include: 100PercentFedUp.com Fox43.com CNN.com FoxNews.com Related Topics antifa arson bias chaos Dangerous domestic terrorism insanity Josh Shapiro left cult political violence rioting Latest News 04/14/2025 / By Willow Tohi DOJ launches Second Amendment Task Force amid federal rollback of gun control measures 04/14/2025 / By Lance D Johnson Housing market panic escalates: A perfect storm of tariff fears, inflation, high interest rates, and historic unaffordability 04/14/2025 / By Lance D Johnson Father speaks out: Challenging the mainstream narrative of his daughter’s “unvaccinated measles death” 04/14/2025 / By Willow Tohi Convenience culture’s hidden toll: Study links ultra-processed foods to reduced lifespan and environmental harm 04/14/2025 / By Laura Harris Trump administration proposes $998 daily fines on migrants defying deportation orders 04/14/2025 / By Ava Grace RFK Jr. launches federal probe into autism surge, vows answers by 2025 Related News 03/24/2025 / By Lance D Johnson Bernie Sanders, “anti-oligarchy rally” exposed as staged spectacle with bussed-in activists tied to antifa, pro-hamas networks 03/24/2025 / By Lance D Johnson Tesla, Elon Musk targeted by same useful idiot domestic terrorists that burned and pillaged American cities in 2020 03/23/2025 / By Willow Tohi EXPOSED: Antifa and IRS collude to shield radical funding from taxation 03/10/2025 / By S.D. Wells QUESTION: If the Jan. 6th protesters are legitimate felons, why did Biden have to PARDON the Jan. 6th COMMITTEE? 03/07/2025 / By S.D. Wells Is Myrtle Beach being BURNED TO THE GROUND intentionally in preparation for pre-declared SMART CITY, like how Maui and Los Angeles got weather-weapon torched? 01/18/2025 / By Ava Grace Four arrested in separate incidents for attempting to ignite new fires in Los Angeles County Take Action: Support Natural News by linking to this article from your website. Permalink to this article: Copy Embed article link: Copy Reprinting this article: Non-commercial use is permitted with credit to NaturalNews.com (including a clickable link). Please contact us for more information. Free Email Alerts Get independent news alerts on natural cures, food lab tests, cannabis medicine, science, robotics, drones, privacy and more. We respect your privacy About Us Who We Are Meet the Health Ranger Free Email Newsletter Support Write for Us Media Information Advertising Information Submit a News Tip Privacy Policy Terms of Use Links Home All News Health Ranger Store Health Ranger Report Podcast Natural News App Blog Articles RSS Feed Follow Us This site is part of the Natural News Network © 2022 All Rights Reserved. Privacy | Terms All content posted on this site is commentary or opinion and is protected under Free Speech. Truth Publishing International, LTD. is not responsible for content written by contributing authors. The information on this site is provided for educational and entertainment purposes only. It is not intended as a substitute for professional advice of any kind. Truth Publishing assumes no responsibility for the use or misuse of this material. Your use of this website indicates your agreement to these terms and those published here . All trademarks, registered trademarks and servicemarks mentioned on this site are the property of their respective owners. Articles Home All News From the Editor (Mike Adams) Politics Culture Health & Medicine Finance & Economy Prepping & Survival Science Technology Archived Stories About Us Who We Are Meet the Health Ranger Free Email Newsletter Contact Us/Feedback Write for Us Media Information Advertising Information Submit a News Tip Privacy Policy Terms of Use Links Health Ranger Store Why People Love the Health Ranger Store Natural News App Blog Articles RSS Feed Natural News Toolbar Archived Articles Onion Site Backup IP: http://45.89.97.6 Featured Books Resilient Prepping Battlefield America: 2022-2024 Ghost World: 2022-2032 The Contagious Mind Survival Nutrition The Global Reset Food Forensics Media Health Ranger Report Videos Podcast Exclusive Interviews Special Reports Recipe Videos Graphics Music Videos CounterThink Cartoons Follow Us Recommended Sites NewsTarget.com Censored.news Brighteon.com Brighteon.TV BrighteonRadio.com Brighteon.social BrighteonBooks.com BrighteonUniversity.com PrepWithMike.com HealthRangerReport.com Reference Sites Science.News Food.News Medicine.News Health.News Cancer.News Pollution.News Climate.News NaturalPedia.com HealingFoodReference.com HerbReference.com SupplementReference.com NutrientReference.com HonestFoodGuide.org More Sites Superfoods.news Grocery.news Ingredients.news FoodScience.news Pesticides.news SupplementsReport.com NaturalCures.news Heart.news Slender.news BigPharmaNews.com Vaccines.news HealthFreedom.news Preparedness.news Share on These Platforms Brighteon.social Brighteon.io Facebook X Telegram Truth Social Gab Gettr MeWe Mastodon Email SMS Copy URL Copy Alt URL More Options This site uses cookies Natural News uses cookies to improve your experience on our site. By using this site, you agree to our privacy policy . Learn More Close Get 100% real, uncensored news delivered straight to your inbox Learn More Subscribe Subscribe Today You can unsubscribe at any time. Your email privacy is completely protected.", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.naturalnews.com/2025-04-14-suspect-admits-targeting-pennsylvania-governor-arson.html", "source": "Naturalnews.com", "published_at": "2025-04-14T06:00:00"}, {"id": 152, "title": "Sam Altman has a crib recommendation — and it's not the Snoo", "content": "Sam Altman Has Two Go-to Pieces of Baby Gear for His Son - Business Insider Parenting Sam Altman has a crib recommendation — and it's not the Snoo By Lee Chong Ming New dad Sam Altman recommended the Cradlewise crib. Stefano Guidi/Getty Images 2025-04-14T05:57:29Z Share Facebook Email X LinkedIn Copy link Save Saved Read in app This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in . Sam Altman, a dad and OpenAI's CEO, loves one smart crib for his baby son. His top baby gear picks so far are Cradlewise's crib and lots of burp cloths. At $1,999, Cradlewise is pricer than the Snoo — but it can be used for longer. OpenAI's CEO, Sam Altman, is deep in new-dad life — and he's already sharing strong opinions on baby gear. \"We bought a lot of silly baby things that we haven't needed,\" he posted on X on Sunday night. \"But definitely I recommend a Cradlewise crib and a lot more burp rags than you think you could possibly need.\" Cradlewise hasn't made as many headlines as its older and bigger competitor, the Snoo — the sleek, motorized bassinet that's basically the Tesla of baby tech . The Snoo , designed by celebrity pediatrician Harvey Karp, has been the go-to setup for sleep-deprived parents for nearly a decade. It uses motion, white noise, and a built-in swaddle to gently rock babies back to sleep. Retailing at $1,695, or $159 a month to rent, the Snoo has amassed a devoted fan base, including celebrity parents like Justin Timberlake and Zoe Saldaña , who invested in the company. Altman's pick, Cradlewise, works a little differently — and at nearly $2,000, it's the pricier option. Instead of waiting for cries, it bounces the baby gently up and down to preempt fussing. It also skips the built-in swaddle, one of Snoo's signature features, and includes a built-in baby monitor and music features. Parents can use Cradlewise's crib for longer with a growing baby. The Snoo tops out at around six months old. Cradlewise converts from bassinet to crib, so it can be used until the baby turns two years old or meets other milestones, like weight. \"We're so grateful to Sam Altman for choosing Cradlewise for their baby,\" Radhika Patil, the CEO and cofounder of Cradlewise, told Business Insider. \"It means a lot coming from someone who truly understands the power of good tech.\" Snoo did not respond to Business Insider's request for comment. 'Having a kid changed a lot of things' Altman and his husband, software engineer Oliver Mulherin, welcomed their baby boy in February . The newborn came early and spent some time in the neonatal intensive care unit. Related stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know \"I have never felt such love,\" Altman posted on X shortly after becoming a dad. Speaking at a TED event on Friday, Altman called parenthood \"by far the most amazing thing that has ever happened to me.\" \"Having a kid changed a lot of things,\" he said. \"The kind of cost of not being with my kid is just like crazily high.\" Altman added, \"I really cared about like not destroying the world before. I really care about it now.\" He joked, \"I didn't need a kid for that part.\" Recommended video Sam Altman OpenAI Read next Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know HOME Subscribe This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now. Have an account? Log in . Jump to Main content Search Account", "sentiment": "POSITIVE", "sentiment_score": 0.8, "url": "https://www.businessinsider.com/sam-altman-crib-recommendation-snoo-cradlewise-openai-parenthood-infants-2025-4", "source": "Business Insider", "published_at": "2025-04-14T05:57:29"}, {"id": 153, "title": "Surrender in Slow Motion: The Soft Collapse of American Democracy", "content": "Surrender in Slow Motion: The Soft Collapse of American Democracy - CounterPunch.org Keep up. Get CounterPunch in your inbox. Home $0.00 April 14, 2025 Surrender in Slow Motion: The Soft Collapse of American Democracy Nick Allison Getty and Unsplash+. It still feels a little paranoid to say it out loud: that the United States might be drifting toward something that looks a lot like Russia. Or Hungary. Or some unholy blend of theocratic nostalgia and corporate feudalism. But that gut feeling—the one that says something’s not right—is getting harder to shake. The signs aren’t exactly subtle, either. To anyone paying attention, they’re plenty loud. But they’re also easy to tune out, easy to dismiss as noise, as politics as usual. What’s harder to ignore are the rituals. The reverence. The worship. The way power starts to look like something owed. We don’t usually start naming highways after sitting presidents—especially ones under multiple indictments, most especially ones wildly obsessed with power and openly musing about a third term. But here we are. A bill in Texas proposes to rename a stretch of I-35 the “President Donald J. Trump Highway.” It may not even pass, but that almost doesn’t matter. It’s one of a growing list of gestures aimed at deifying a man who, by any rational standard, should be facing serious consequences for his role in the January 6th insurrection—an attack on the peaceful transfer of power that many legal scholars argue should disqualify him from office under the 14th Amendment , if not result in criminal charges for inciting sedition. Instead, we get a slow-motion canonization. Lawmakers have floated putting Trump’s face on currency, making his birthday a federal holiday, and renaming airports in his honor . Some supporters even want to carve his likeness into Mount Rushmore. Religious leaders compare him to biblical kings —chosen vessels, sent by God. This isn’t politics anymore. It’s mythology. It’s the construction of a parallel reality where Trump isn’t just a man, but a savior figure. The kind of figure who can do no wrong, whose followers speak of him in reverent tones, who must be protected at all costs. This is how democratic values rot—not all at once, but through the slow normalization of idolatry disguised as patriotism. But mythology only works if it can crowd out reality. Repression needs scaffolding—and no tool is more effective than confusion. The Trump administration doesn’t just clash with the press; it undermines the very concept of truth. “Fake news” isn’t a throwaway insult anymore—it’s a strategy. A sustained campaign to flood the information space and make facts feel optional. Reporters who challenge the administration are smeared as traitors or “deep state” operatives. Trump still calls mainstream journalists “ the enemy of the people, ” echoing the language of the dictators and strongmen he seems to admire so much. Investigations are dismissed as partisan attacks. Whistleblowers are discredited before they speak. Independent newsrooms face lawsuits, threats, and coordinated disinformation campaigns designed to corrode public trust. And it works. The more chaotic the noise, the easier it is to tune out the signal. Truth becomes something to argue about, not act on. And once reality gets slippery, everything else is easier to break. Books get banned. Curricula get sanitized. Judges face harassment for upholding the law. Ordinary people start second-guessing what they post, what they share, what they say out loud. It doesn’t take long for folks to forget what used to be obvious: opposition to authoritarianism is essential to a free society. *** I live in Austin, Texas, a city that prides itself on being an outlier inside a state that loves to talk about freedom while quietly legislating the opposite. This is a state where “small government” somehow includes sweeping preemption laws, micromanaging what books kids can read, and controlling uteruses. The message is clear: freedom is fine—as long as it’s defined by those in power. Texas has one of the strictest abortion bans in the country —providers can face life in prison, and even individuals assisting in abortion access risk legal consequences, even in cases of rape or incest. In public schools, Bible-based curricula are slipping into classrooms under the name of “values” or “patriotism,” incentivized by lawmakers. It’s not freedom—it’s state-mandated morality dressed up as tradition. There’s a reflex in this country—maybe in every country—to label dissent as disloyalty. Criticize the government, and suddenly you’re “anti-American.” I don’t buy that. I love this country and the ideals it’s supposed to stand for. When I enlisted in the Army and volunteered for the infantry, I swore an oath. I’ve seen firsthand what it means to put your body on the line for a set of principles. Sure, my war was Iraq. And in hindsight, it’s clear we weren’t exactly defending American freedoms by invading a nation that had nothing to do with 9/11. But the men I served with—some of whom never came home—weren’t there for oil or politics. They were there because they believed in service. Many had volunteered in the aftermath of the September 11th attacks, willing to risk their lives to protect something bigger than themselves. They believed in the promise of liberty, accountability, and a system worth defending. And some of them probably support President Trump. I don’t speak for them—and while I respect their right to that choice, I won’t pretend to understand it. But I do know what we all swore to uphold. Our oath wasn’t to a man, or a party, or even a flag. It was to a Constitution—one that’s supposed to hold this nation together. (1) That’s why this matters to me. When I see politicians twisting those principles into tools of repression, I don’t call it patriotism. I call it what it is: a threat. And while there are many faces to that threat, perhaps none illustrates it more clearly right now than Elon Musk—a man elected by no one, yet handed more control over federal institutions than most cabinet secretaries. His financial influence didn’t just buy him a seat at the table. It bought him the table. *** Elon Musk—billionaire, attention addict, CEO of everything—holds real political power now. Not metaphorically, not just influence-by-Twitter (or X, or whatever that ad-choked echo chamber is calling itself today). Trump brought him in early to lead the so-called Department of Government Efficiency—DOGE, which sounds like a joke until you realize it’s not. As a “special government employee,” Musk was handed sweeping authority to cancel contracts, slash programs, and restructure entire federal agencies. No election. No confirmation. No accountability—except to Trump and his inner circle. Musk has used that power like a wrecking ball. USAID, gutted. The CFPB, gutted. The VA, slashed. Now the Department of Education is on the chopping block—literally. Trump already signed the executive order to begin dismantling it, with the justification that schools should be governed “locally.” But the fallout is anything but local. Teachers’ unions, the NAACP, and civil rights organizations are suing , warning that the move violates the Constitution and threatens to gut federal protections for vulnerable students. Meanwhile, DOGE’s attempts to access sensitive agency data have been blocked by federal courts, citing privacy concerns and executive overreach. And like clockwork, Musk’s signature chaos-management style has followed him into government: mass firings with little discernment, followed by quiet attempts to rehire the very people dismissed —nuclear safety experts, pandemic response staff, oversight personnel—when it turns out gutting institutions has consequences. Even Musk’s own support is starting to wobble. His approval numbers have slipped. Protests have spread. Tesla cars have been vandalized, and a whole side hustle economy has popped up to cash in —selling bumper stickers to owners who bought the car before they realized what kind of guy came with it. Movements like “ Tesla Takedown ,” built around public shaming and targeted boycotts of Musk’s brands, are picking up steam. Trump’s base still defends him, mostly—but they’re beginning to sour on Musk. The golden boy of techno-libertarianism now looks a lot more like a self-dealing billionaire with too much control over their lives. Musk’s role in the administration isn’t just a weird twist of the Trump saga. It’s a symptom of something much deeper: the corrosion of democratic norms in real time. When unelected billionaires are empowered to disassemble the federal government and profit from the fallout , we’re not looking at innovation. We’re looking at privatized power in patriotic packaging. Legal scholars are already sounding the alarm about a coming constitutional crisis. The rule of law is being selectively applied, courts are being ignored or sidelined, and the balance of power is being bent toward executive fiat. If the Constitution is a framework built on checks and balances, then we’re watching those supports be quietly removed, one by one. This isn’t hypothetical. It’s happening. And if it continues unchecked, we’re not just flirting with autocracy —we’re laying out a red carpet for it. And it’s not happening in a vacuum. The courts have been methodically reengineered. Three Supreme Court justices were installed during Trump’s first term —after he lost the popular vote—with help from a Senate that represents a minority of Americans. Lower courts have been stacked with ideologues who don’t hide their contempt for civil rights. And then there are the laws—quietly passed, easily overlooked—that encourage citizens to snitch , sue, or surveil each other under the guise of morality or tradition. It’s not just policy anymore; it’s a culture shift. A moral panic turned into legislation. *** None of this is new. We’ve seen this playbook before. Germany in the 1930s didn’t collapse overnight. It slid—through legal channels, institutional decay, and the slow boiling of norms. Russia didn’t need a coup; it had bureaucracy, media control, and just enough plausible deniability. Hungary rewrote its constitution and wrapped its authoritarianism in flags and hymns. The slogans vary—family, faith, purity, tradition—but the structure is the same: consolidate power, erode checks, rebrand repression as righteousness. Here, it’s not boots in the street—it’s bans in the library. It’s teachers rewriting syllabi out of fear. It’s protesters labeled extremists, and voting rights treated like optional extras. The message isn’t “you can’t speak.” It’s “maybe you shouldn’t.” It’s the whisper before the silence. I’m not a paranoid person. I have no patience for conspiracy freaks or tinfoil logic. I try to root my thinking in science and history—in what can be known, what can be verified. But even so, I’m not immune to the quiet worries that slip through the cracks. I’m writing this on a device connected to the internet. Nothing is truly private. Nothing online ever really disappears. That’s not a problem with this essay—I plan to publish it. But what about private messages? Notes? Conversations with AI? Whether we like it or not, tools like ChatGPT are becoming fixtures in daily life. People use them to draft emails, unpack personal dilemmas, or ask the kinds of questions they’re not ready to say out loud. But these aren’t confidants. They’re algorithms trained to guess the next likely word. No mind, no morals, no memory. Are they logging dissent? Mapping behavior? Storing keywords for some future review? Maybe not. Or maybe not yet. But let’s not underestimate the creativity of bad actors with power. The infrastructure exists. And if the political winds shift hard enough, all it takes is a flip of a switch. When it comes to tech abuse, the current administration’s incompetence might actually be our last line of defense. These are, after all, the same people who planned a military strike in a Signal group chat—and accidentally invited a journalist. If Orwell wrote fiction, these guys are writing farce. Jokes aside, the surveillance state doesn’t need to be competent—just connected. Metadata is already vacuumed up. GPS logs, browsing habits, biometric patterns—all cross-referenced with identities. If this all sounds like dystopian fiction, that’s only because we’ve been trained to think of it that way. But it’s not fiction. The systems are real. The only thing missing is the right justification: National security. Public order. “Family values.” “Protecting the children.” And then comes the refrain: If you’ve got nothing to hide, you’ve got nothing to fear. That’s how it always starts. *** The threat isn’t abstract anymore. It’s not looming—it’s embedded. Not with jackboots and batons—though keep going down this road and we’ll get there—but with procedural language and patriotic branding. It waits for fatigue to set in. For outrage to give way to apathy. For protest to feel futile, and speaking up to feel like a risk. We’ve been conditioned to treat comparisons to fascism as melodramatic. Alarmist. But sometimes, alarmist just means paying attention. When journalists are attacked, when courts are captured, when books are pulled from shelves and history is rewritten in real time, it’s not alarmist to say the house is on fire. It’s responsible. Authoritarianism doesn’t need everyone to go silent—just enough people afraid of making noise. It thrives on hesitation. On people weighing the cost of resistance against the ease of going along. That’s the most dangerous part—not the censorship itself, but the internalized version. The self-editing. The second-guessing. The voice that says: Maybe just let it go. Maybe don’t post that. Maybe don’t write this. But I’d rather name it now than whisper about it later. If this country is still salvageable—and I believe it is—it won’t be because we waited politely. It’ll be because enough people chose not to. Because silence isn’t safety. It’s surrender in slow motion. *** To Those Who Still Support President Trump Maybe you still support Donald Trump and his approach to governing. A lot of people clearly do. Or maybe you just choose to look the other way. Either way, ask yourself this: what happens when the next president isn’t your guy? When someone you don’t trust—someone you don’t like and didn’t vote for—inherits the same unchecked authority, the same gutted institutions, the same executive branch reshaped for loyalty over law? To be fair, this didn’t start with Trump. The power of the presidency has been sliding in this direction for decades. But he sure as hell didn’t slow it down—he stepped on the gas. And that’s the thing about power: once it expands, it rarely contracts. The people who come next don’t give it back—they just find new ways to use it… to abuse it. The Founders weren’t perfect, but they knew what concentrated power could do. That’s why they didn’t build a throne—they built limits. Guardrails. And we’re watching those get stripped for parts. You might like who’s driving now. But what happens when you don’t? Nick Allison is a former Army infantryman, a college dropout, and a writer based in Austin, Texas. He spends too much time reading about history, democracy, and systems in collapse—and not enough time being optimistic about any of it. His interests include baseball, philosophy, and trying to make sense of the mess we call modern life. He’s not a journalist or a pundit—just a political independent, unaffiliated with any party, who still believes the Constitution is worth defending. CounterPunch+ Palestinian First Responders and the Unbearable Sadness of Genocide To Honor Women’s History Month, Let Us Now Praise Famous Female Antiwar Activists I Am Bombed, Therefore I Am Trump’s Anti-Imperial Imperialism Understanding Israel’s Impunity Subscribe to get CP+ exclusive content April 15, 2025 Zarifah Al-Bash The Mask Has Fallen: Gaza and the Myth of Western Morality Peter Montgomery A Call to Defend What’s Best about America April 14, 2025 Neve Gordon Why I Don’t Cheer for Israel’s ‘Pro-Democracy’ Movement Erik Molvar The Biggest Federal Land Heist in the History of the West? Jim Kavanagh Collapse Binoy Kampmark Junk Science and Bad Policing: The Homicide Prediction Project John Feffer Shredding Constitutions Alfred W. McCoy Is 2025 the New 1984? Ralph Nader The Dangerous Silence of Retired U.S. Presidents Tyler Mitchell – Dedrick Asante-Muhammad Trump’s War on Federal Workers is a Threat to Black Families Dean Baker Five Facts About Trade You Don’t Read in the Newspaper Nick Allison Surrender in Slow Motion: The Soft Collapse of American Democracy Phil Wilson Is Representative Democracy a Front for Oligarchy? Osama Esber The Bearded and Masked Face of Power in Syria George Ochenski As the Bison Debate Rages On, Leaders Miss an Obvious Solution Weekend Edition April 11 - 13, 2025 Melvin Goodman The Obscenity and Futility of US and Israeli Air Power Daniel Warner Beyond Outrage: Israel’s Execution of Medical Workers Henry Giroux Democracy Disappeared Jeffrey St. Clair Roaming Charges: Who Shot the Tariffs? Stephen F. Eisenman Florida Diary: Environmental Protection or Bust John Ronan SCOTUS: the Robed Religious Junta Ramzy Baroud Netanyahu’s Shin Bet Scandal: Who Holds the Power? Eric Draitser Luke Thomas: Fighting for Palestine, UFC’s Monopoly, Saudi Sportswashing Andreína Chávez Alava Stages of An Abusive Relationship with the United States Robert Hunziker EPA Torches Home Insurance Coverage John W. Whitehead – Nisha Whitehead A Financial Coup David Yearsley Tariffs and the King Aviva Chomsky Trump Faces Palestine Giorgos Mitralias Gaza: “More than a human being can bear” Stewart Lawrence Taxidermy Drones: Tool of Conservation or Weapon of War? Seth Sandronsky Trump’s Trade Tariffs and America’s Small Businesses Dean Baker Our Huge Trade Deficit with China Does NOT Give Us the Upper Hand in Tax (Tariff) War Vuk Bačanović Montenegro and the Challenges of Serbian and Croatian Nationalism Kim C. Domenico Taking Courage from Our Emerson Bernie Sanders We Need a Trade Policy That Works for People Matthew Stevenson The Lost Armenian City of Erzerum", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.counterpunch.org/2025/04/14/surrender-in-slow-motion-the-soft-collapse-of-american-democracy/", "source": "CounterPunch", "published_at": "2025-04-14T05:41:22"}, {"id": 154, "title": "Tech tariff trainwreck: Mad King Donald backflips on the backflip", "content": "Donald Trump tech tariff backflip another trainwreck Get Unlimited Access Log in View all search results Search News Analysis Opinion Tips and Murmurs Politics Media Justice Environment Economy Business World Got a tip? Crikey Daily Crikey Worm Sign up to our newsletters About Crikey News Analysis Opinion Tips and Murmurs Politics Media Environment Economy Business World Got a tip? Search View all search results Create a free account, or log in Share this article If you like this article, share it with your friends. Facebook X LinkedIn Copy to Clipboard Copy North America Analysis Economy Technology World Tech tariff trainwreck: Mad King Donald backflips on the backflip Can you backflip on a backflip after another backflip? That’s what Donald Trump has done with his ‘exemption’ for computer equipment. Bernard Keane Glenn Dyer Apr 14, 2025 4 min read Share 0 US President Donald Trump (Image: ABACAPRESS/Matias J. Ocner) The working rule for any major announcement by Donald Trump is that it will be reversed, modified or dismissed as never having happened within a matter of days. And that appears to apply as much to the reversals and modifications themselves. So that tariff backflip revealed on Friday (not the initial backflip, to reduce tariffs to 10% for everyone other than China, but the backflip to exclude semiconductor chips, smartphones and laptops made in China from the-nearly 150% tariffs on China) which was widely seen to have saved the bacon of Apple , given its reliance on Chinese manufacturing, turns out not to be an exemption at all. There will instead be a specific tech tariff, the administration said yesterday. “NOBODY is getting ‘off the hook’,” Trump raved . “There was no Tariff ‘exception’ announced on Friday. These products are subject to the existing 20% Fentanyl Tariffs, and they are just moving to a different Tariff ‘bucket.’ The Fake News knows this, but refuses to report it. We are taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Security Tariff Investigations.” The additional tech tariffs won’t be revealed for one to two months, presumably giving the administration time to cobble together an equivalent to the kind of irrational, innumerate mathematical model it used to work up its now-ditched “Liberation Day” tariffs. Related Article Block Placeholder Article ID: 1202161 Trump wants allies in his war on China. Albanese and Marles will bend the knee — as will Dutton Bernard Keane 139 Friday’s electronics backflip-that-wasn’t was disseminated not via a White House PR stunt but a US Customs and Border Protection Service notice to shippers, which contained a list of tariff codes excluded from the import taxes, retroactive to 12.01am EDT (3.01pm Sydney time) on Saturday, April 5. Reuters reported that the notice “listed 20 product categories, including the broad 8471 code for all computers, laptops, disc drives and automatic data processing. It also included semiconductor devices, equipment, memory chips and flat panel displays”. That still leaves billions of dollars worth of kitchen and other households goods, toys, foodstuffs, machinery, car parts and similar products still paying the 145% China tariff. Big companies like Walmart, Target, Tesla, Ford, GM, Stellantis and their customers all face a sharp rise in costs and prices. Apple won praise from Trump in late February when it committed to invest US$500 billion and add 20,000 jobs in the US during the next four years. It similarly pledged a US$350 billion investment during Trump’s first term when the iPhone was exempted from China tariffs. This time the exemption took days to appear, and investors sold Apple shares down heavily as they speculated it would be the most impacted from the tariffs of all the tech heavies. That saw the market value of tech’s “Magnificent Seven” stocks — Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms — slump US$2.1 trillion, or 14%, from April 2. Trump’s latest move will add to the belief among investors and in bond markets that his administration has injected a permanent sense of uncertainty into US economic policy. Who can plan investment with any certainty when the price of key inputs can double on the whim of an irrational ignoramus? And if the goal of the tariffs remains both to generate massive revenue to fund Trump’s tax cuts and force the onshoring of all manufacturing to the US in a form of modern-day autarky, where will the US get the skilled workers needed, given Trump inherited an unemployment rate of 4%? Certainly not migration — under Trump, the US is now overly hostile to visitors of any kind, let alone people who might want to consider offering their skills to US employers. He also seems to have undermined, at least for the medium term, confidence in the safe haven status of the US and its bonds, which is what caused the initial tariff backflip last week. The Federal Reserve (hated by Trump because of its independence) stepped in on Friday with well-timed comments aimed at bond market investors. Boston Fed president Susan Collins told the Financial Times that the US central bank would “absolutely be prepared” to deploy its various tools to help stabilise the financial markets if the need arose. You know confidence in US bonds and the country’s credit worthiness is shot when a senior member of the Fed has to go public to emphasise that the central bank will be there to clean up the mess Trump is making. But Treasury yields remained elevated over the weekend at 4.482%, reflecting that Trump’s volatility is materially adding to the risk of what was until recently the crucial safe haven of global finance. Have something to say about this article? Write to us at letters@crikey.com.au . Please include your full name to be considered for publication in Crikey’s Your Say . We reserve the right to edit for length and clarity. About the authors Bernard Keane Politics editor Bernard Keane is Crikey’ s politics editor. Before that he was Crikey’ s Canberra press gallery correspondent, covering politics, national security and economics. Got a tip? Contact him securely on Signal at @Bernard_Keane.66 . Glenn Dyer Contributor Glenn Dyer is a contributor to Crikey . Similar topics bond markets China Donald Trump inflation protectionism tariffs TECHNOLOGY Comments 0 Hide Recommended for you Sycophants say Trump’s tariff U-turn is genius. All it proves is his boneheaded stupidity on China Bernard Keane Apr 10, 2025 90 Has the budget got a Donald Trump contingency plan? Bernard Keane May 13, 2024 1 Tough man Trump is finding it hard to make tough decisions. Now a recession looms Bernard Keane AND Glenn Dyer Mar 10, 2025 41", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "http://www.crikey.com.au/2025/04/14/tech-tariff-trainwreck-donald-trump/", "source": "Crikey", "published_at": "2025-04-14T05:36:27"}, {"id": 155, "title": "South African telecom provider Cell C disclosed a data breach following a cyberattack", "content": "South African telecom provider Cell C disclosed a data breach Home Breaking News Cyber Crime Data Breach Hacking Malware South African telecom provider Cell C disclosed a data breach following a cyberattack South African telecom provider Cell C disclosed a data breach following a cyberattack Pierluigi Paganini April 14, 2025 Cell C, one of the biggest telecom providers in South Africa confirms a data breach following a 2024 cyberattack. Cell C is the fourth-largest mobile network operator in South Africa, , after Vodacom, MTN, and Telkom. The company founded in 2001 offers prepaid and postpaid mobile plans, data bundles and internet services, fiber broadband, roaming and international calling, SIM-only plans and device deals. Cell C has confirmed a data breach following a RansomHouse cyberattack that occurred last year. The ransomware group has since leaked the stolen data on its dark web leak site. The gang claimed the theft of 2 TB of data. Compromised data includes full names, contact details, ID numbers, banking information, driver’s license numbers, medical records and passport details. Cell C stated that threat actors gained unauthorized access to some of its IT systems. “Cell C is aware that data compromised in the recent cybersecurity incident has been unlawfully disclosed by RansomHouse, the threat actor claiming responsibility.” states the company . “This follows a previously reported incident involving unauthorised access to unstructured data in some parts of our IT environment.” Cell C has taken swift action to contain a recent cyberattack, secure its systems, and limit the impact. The company engaged top cybersecurity and forensic experts, informed authorities, and is actively supporting affected stakeholders. They continue to monitor for potential data misuse and urge vigilance against fraud, phishing, and identity theft. Cell C has also shared fraud prevention resources, including guidance on registering with SAFPS for extra protection. RansomHouse is a data extortion group that has been active since Dec 2021. Unlike other extortion group, the gang doesn’t encrypt data, but focuses on data theft to speed up its activity. Victims include AMD and Keralty. They shame non-payers by leaking data. Backups are insufficient; IPS is recommended for protection. American hospitals are a privileged target for threat actors due to the huge trove of sensitive data they manage. Ransomware attacks on U.S. healthcare providers surged in 2024, with 98 attacks compromising 117 million records . Hospitals often face system lockdowns, forcing a switch to manual processes. High-profile breaches include Change Healthcare (100M records), Summit Pathology (1.8M), OnePoint Patient Care (796K), and Boston Children’s Health Physicians (909K). In 2023, Loretto Hospital experienced another data security incident . On January 19, 2023, a former employee misappropriated security camera footage of a limited number of patients and posted it on Facebook. The footage was removed after the incident was discovered. Loretto identified the impacted individuals and notified them by mail on March 15, 2023, offering guidance on protecting their information. The exposed information consisted of security camera footage of a small number of patients. Follow me on Twitter: @securityaffairs and Facebook and Mastodon Pierluigi Paganini ( SecurityAffairs – hacking, Cell C) facebook linkedin twitter Cell C Cybercrime data breach Hacking hacking news information security news IT Information Security malware Pierluigi Paganini RansomHouse Security Affairs Security News you might also like Pierluigi Paganini April 14, 2025 New malware ‘ResolverRAT’ targets healthcare, pharmaceutical firms Read more Pierluigi Paganini April 14, 2025 Malicious NPM packages target PayPal users Read more leave a comment newsletter Subscribe to my email list and stay up-to-date! recent articles New malware ‘ResolverRAT’ targets healthcare, pharmaceutical firms Malware / April 14, 2025 Malicious NPM packages target PayPal users Security / April 14, 2025 Tycoon2FA phishing kit rolled out significant updates Cyber Crime / April 14, 2025 South African telecom provider Cell C disclosed a data breach following a cyberattack Data Breach / April 14, 2025 SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41 Malware / April 13, 2025 We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT", "sentiment": "NEGATIVE", "sentiment_score": -0.8, "url": "https://securityaffairs.com/176509/data-breach/south-african-telecom-provider-cell-c-disclosed-a-data-breach.html", "source": "Securityaffairs.com", "published_at": "2025-04-14T05:27:25"}, {"id": 93, "title": "Investor heartburn? Blame Nvidia and the magnificent seven", "content": "Investor heartburn? Blame Nvidia and the magnificent seven – The Irish Times Your Money Investor heartburn? Blame Nvidia and the magnificent seven Tech stock oscillations are having an outsized impact on indices Nvidia is responsible for 13 per cent of S&P 500 volatility. Photograph: Sean Gallup/Getty Images Proinsias O'Mahony Mon Apr 14 2025 - 06:00 Getting heartburn as your portfolio gets yanked around day after day? Blame the magnificent seven – especially Nvidia . You can’t exactly blame mega-cap stocks because Donald Trump felt like stirring the market pot, but tech stock oscillations – on Wednesday, following dizzying declines, Tesla , Nvidia and Apple soared 22.7, 18.7 and 15.3 per cent, respectively – are having an outsized impact on indices. Much attention has focused on the mag seven’s growing influence on index returns, given they account for 30 per cent of the S&P 500′s market capitalisation and 17 per cent of the MSCI All-Cap World Index’s (ACWI). READ MORE We called off our wedding because of Fair Deal threat to my home New research highlights wealth divide between North and South Big stock gains may signal big trouble The Irish man who bought a home in the US after winning $100,000 on NFL fantasy football What has been less obvious, notes Verdad Capital, is their impact on index volatility, which is even more extreme than the aforementioned figures suggest. Not only are the mega-caps bigger than most stocks, they’re also more volatile. As a result, the mag seven account for 40-45 per cent of S&P 500 volatility and 25 per cent of ACWI volatility. The gap between the volatility contribution and their market-cap weight is now the widest in 25 years. Looking more closely, Verdad’s figures show Tesla has as much impact on US and global index movements as Microsoft , even though Microsoft is more than three times as valuable. However, the main contributor to investor heartburn is Nvidia. Even though it’s less valuable than Apple and Microsoft, it is responsible for 13 per cent of S&P 500 volatility and 8 per cent of the ACWI’s – more than twice as much as Apple and Microsoft. So if your portfolio’s giving you indigestion, check the label – it probably says Nvidia. US tariffs Donald Trump Apple Nvidia Tesla Microsoft IN THIS SECTION More than one in five Irish adults do not have a pension Readers locked out of AIB and BOI: ‘I can’t access my accounts. I have tried everything’ Big stock gains may signal big trouble Approved retirement funds: What is an ARF and how much will it cost me? We called off our wedding because of Fair Deal threat to my home MOST READ How U2 drummer Larry Mullen jnr avoids conflict with neighbours: buy up all surrounding houses ‘Worrying’ quality of life gaps growing every year between North and South, says report Taoiseach plays down reports Government is to allow landlords reset rents in RPZs Rory McIlroy reacts to winning the career Grand Slam: ‘I’ve carried that burden for 11 years’ ‘I had all the symptoms of bowel cancer but it wasn’t on their radar because of my age’ READ NEXT Philip Reid: I’ve been to all of Rory McIlroy’s Major triumphs. This Masters win is unmatched in history Rory McIlroy warns Augusta members will have to ‘wheel me out of here when I am 90’ LATEST STORIES New research highlights wealth divide between North and South Why is Ireland-US tourist data going south? Major gas outage could halt production at large corporate sites in ‘devastating’ economic blow I Am Not an Alcoholic: A lot of things changed for me when I stopped drinking ‘Donegal neighbours said we admire you for the braveness of emigrating. Who’s emigrating? It’s Europe’ On The Money Our weekly personal finance newsletter will give you the insight you need to save money and make smart spending decisions Sign up Terms & Conditions Privacy Policy Cookie Information Cookie Settings Community Standards Copyright", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://www.irishtimes.com/your-money/2025/04/14/investor-heartburn-blame-nvidia-and-the-magnificent-seven/", "source": "The Irish Times", "published_at": "2025-04-14T05:00:00"}, {"id": 94, "title": "Elon’s DOGE Is OK, But Mises Is Way Better", "content": "Elon’s DOGE Is OK, But Mises Is Way Better - LewRockwell Show Menu Archives Authors Blog Books & Resources Lew Rockwell Books Ron Paul Books Murray N. Rothbard Library & Resources Mises Institute LRC Bestselling Books Political Theatre Podcasts Store About Contact Donate Advertise Search for: LewRockwell .com ANTI-STATE • ANTI-WAR • PRO-MARKET Elon’s DOGE Is OK, But Mises Is Way Better By Jorge Besada Mises.org April 14, 2025 Donate Elon Musk—via his DOGE (Department of Government Efficiency)—exposing and attempting to cut government waste is wonderful. However, it’d be even better if Elon focused more on striking closer to the root of the problem: the public’s economic ignorance from which all the disastrous, coercive, competition-immune, monopolistic government central planning, spending, and also warmongering grows. This is precisely what Ludwig von Mises did, and I like to call it the “Misesian formula” for prosperity. Mises devoted parts of his majestic treatise Human Action (1949) to the formula. In a section aptly titled “Economics and the Citizen,” Mises writes : 5-Minute Core Exercise... Dzenitis, Tami Brehse Best Price: $3.81 Buy New $8.68 (as of 03:36 UTC - Details ) Economics must not be relegated to classrooms and statistical offices and must not be left to esoteric circles. It is the philosophy of human life and action and concerns everybody and everything. It is the pith of civilization and of man’s human existence…. All present-day political issues concern problems commonly called economic. All arguments advanced in contemporary discussion of social and public affairs deal with fundamental matters of…economics. Everybody’s mind is preoccupied with economic doctrines…. Everybody thinks of economics whether he is aware of it or not. In joining a political party and in casting his ballot, the citizen implicitly takes a stand upon essential economic theories…. As conditions are today, nothing can be more important to every intelligent man than economics. His own fate and that of his progeny is at stake…. …all reasonable men are called upon to familiarize themselves with the teachings of economics. This is, in our age, the primary civic duty. Whether we like it or not, it is a fact that economics cannot remain an esoteric branch of knowledge accessible only to small groups of scholars and specialists. Economics deals with society’s fundamental problems; it concerns everyone and belongs to all. It is the main and proper study of every citizen. Since it’s real freedom and capitalism that lead to prosperity, explaining this to people is, per Mises, “ the primary civic duty .” Riding the wave of economic education, Javier Milei had been spearheading on his way to electoral triumph in Argentina, on November 8, 2023 Elon tweeted a Hayek meme writing: “Best economist ever.” A week later, on December 4, he tweeted , “Great book by Hayek” while linking to Hayek’s classic book The Road To Serfdom , and another meme quoting Hayek : “nothing could contribute more to the cure of humanity’s ills than to give people a better understanding of economics .” Elon is thus increasingly aware of the need to educate, but still far from having a Misesian ethos-understanding. Mankind’s problems are overwhelmingly the result of the public’s economic ignorance which then, via democracy, manifests itself in the order-destroying bureaucracies. It is their ignorance—that of your neighbor, family members, and likely former self—that is near the root of the problem, not whatever homo sapiens people vote for. The very root of this economic ignorance, as significantly shown by founder of the “Austrian School of Economics,” Carl Menger, is the fact that money (and its vital emerging benefits like profit-loss calculation), trade, the division of labor, economic competition, etc. are—to borrow Adam Ferguson’s popular phrase —“indeed the result of human action, but not the execution of any human design.” Hardly anyone, and much less people of significant influence, likely including Elon, are aware of this. One of my favorite little-known Libertarian books is Walter Block’s I Chose Liberty: Autobiographies of Contemporary Libertarians , which contains over 80 autobiographical essays-interviews of leading libertarians/free marketeers like Walter himself, Ron Paul, Lew Rockwell, Peter Boettke, etc., describing how they became libertarians/free marketeers. It is easy to see how many of them went from being ignorant big government, socialist myth-believers to champions of freedom and emerging civilization, by stumbling upon sound economics. Mises (1881-1973) died long before the collapse of the Soviet Union (1991) and pro-capitalist reforms in China, thus he spent his lifetime fighting a losing intellectual battle, as socialist myths expanded their control of more countries. He writes : From time to time I entertained the hope that my writings would bear practical fruit and point policy in the right direction. I have always looked for evidence of a change in ideology. But I never actually deceived myself; my theories explain, but cannot slow the decline of a great civilization. I set out to be a reformer, but only became the historian of decline. After WWI, he carried the same determination in his Atlas-like intellectual-educational efforts: How one carries on in the face of unavoidable catastrophe is a matter of temperament…. Again and again I had met with situations from which rational deliberation found no means of escape; but then the unexpected intervened, and with it came salvation. I would not lose courage even now. I wanted to do everything an economist could do. I would not tire in saying what I knew to be true. Mises again , in Human Action : …in the field of social organization and economic policies. Here the best theories are useless if not supported by public opinion. They cannot work if not accepted by a majority of the people. Whatever the system of government may be, there cannot be any question of ruling a nation lastingly on the ground of doctrines at variance with public opinion. In the end the philosophy of the majority prevails. In the long run there cannot be any such thing as an unpopular system of government…. The supremacy of public opinion determines not only the singular role that economics occupies in the complex of thought and knowledge. It determines the whole process of human history…. …great men cannot succeed in adjusting social conditions to their plans if they do not convince public opinion. The flowering of human society depends on two factors: the intellectual power of outstanding men to conceive sound social and economic theories, and the ability of these or other men to make these ideologies palatable to the majority. Mises’s wisdom above predicts what is happening to Elon and his DOGE, and again highlights the need to “convince public opinion.” Although Elon has gained support from many, a large percentage of the economically-ignorant public is increasingly, fanatically against Elon’s efforts. Bolshevik-like, intellectually dangerous ideologues like Robert Reich have been constantly spewing anti-economics and violence-inducing class-warfare rhetoric. For example, on March 12, 2025, Reich wrote in Facebook: Elon Musk is trying to steal the federal government — slashing public services, firing civil servants, and handing power to billionaires like himself. I salute the brave public servants who are resisting this coup. This type of mindset by the economically ignorant masses have made Musk one of the most hated men in America, to be destroyed via lawfare and even physical violence. From January 29 to March 10, 2025, there have been 9 attacks on Tesla locations . On March 10, X/Twitter suffered a relatively massive outage which, at the time, Elon felt originated in Ukraine, showing the potential dangers of being against the interests of millions vested in neocon warfare. I would not be surprised if SpaceX and Tesla are already—or will eventually be—victims of internal sabotage. Statistically, as the anti-Elon dice keep getting rolled at an increasing rate, he will likely be brought down somehow. Besides, as Vincent Cook’s article “ Is DOGE a Dog When It Comes to Real Federal Spending? ” shows, there are too many legal obligations for DOGE to make significant cuts. Elon is attacking the symptoms of economic ignorance, not the root causes like Mises did. With a more Misesian intellectual background and educational strategy, Javier Milei—similar to Ron Paul—managed to educate enough people to win the presidency of Argentina. In an interview with Ben Shapiro, Milei explained how the intellectual revolution grew from economic education: The Next Civil War: Di... Marche, Stephen Best Price: $10.12 Buy New $13.64 (as of 10:51 UTC - Details ) This time young people were really educated. We would organize what we called the concerts. They were political rallies… At these rallies we had stands…with books. Minister Bullrich…said something brilliant, “you should pay more attention to what Milei is doing. It’s not normal for a politician to be talking to 20 or 30 thousand people about Hayek.” Young people started to evangelize at home with their parents and grandparents. Mises wrote : Liberalism is rationalistic. It maintains that it is possible to convince the immense majority… It has full confidence in man’s reason. It may be that this optimism is unfounded and that the liberals have erred. But then there is no hope left for mankind’s future. In other words, we must believe that we can educate “the immense majority,” and thus act accordingly, even if it proves to be futile, otherwise “there is no hope left for mankind’s future.” Mises concludes Human Action : The body of economic knowledge is an essential element in the structure of human civilization; it is the foundation upon which modern industrialism and all the moral, intellectual, technological, and therapeutical achievements of the last centuries have been built. It rests with men whether they will make the proper use of the rich treasure with which this knowledge provides them or whether they will leave it unused. But if they fail to take the best advantage of it and disregard its teachings and warnings, they will not annul economics; they will stamp out society and the human race. Note : The views expressed on Mises.org are not necessarily those of the Mises Institute. Tags: $post_author: WP_User Object ( [data] => stdClass Object ( [ID] => 5860 [user_login] => no_author [user_pass] => 6581364babeda3eebbeb65d5094e43d1 [user_nicename] => no_author [user_email] => [email protected] [user_url] => [user_registered] => 2013-07-08 16:44:09 [user_activation_key] => [user_status] => 0 [display_name] => No Author [type] => wpuser ) [ID] => 5860 [caps] => Array ( [author] => 1 ) [cap_key] => wp_capabilities [roles] => Array ( [0] => author ) [allcaps] => Array ( [upload_files] => 1 [edit_posts] => 1 [edit_published_posts] => 1 [publish_posts] => 1 [read] => 1 [level_2] => 1 [level_1] => 1 [level_0] => 1 [delete_posts] => 1 [delete_published_posts] => 1 [email_single_user] => 1 [email_multiple_users] => 1 [tablepress_edit_tables] => 1 [tablepress_delete_tables] => 1 [tablepress_list_tables] => 1 [tablepress_add_tables] => 1 [tablepress_copy_tables] => 1 [tablepress_import_tables] => 1 [tablepress_export_tables] => 1 [tablepress_access_options_screen] => 1 [tablepress_access_about_screen] => 1 [author] => 1 ) [filter] => [site_id:WP_User:private] => 1 ) get_the_author_meta: $bio: $bios: Array ( ) Jorge is a computer programmer from Miami, Florida. He can be reached at [email protected] , tweets at @hayekian and writes the “Hayekian” blog on Medium. Did Kiev Regime Plot To Kill Trump? We Are All Prodigal Sons and Daughters Political Theatre Ritual Rape in Israel Brief You Tube video with Ayn Rand on tariffs Brainwashing Our Children Who is the largest NGO recipient of USAID from 2013-2022? Graduated HS With Honors-Can’t Read Or Write 130 Jewish Georgetown members slam Trump for ‘weaponizing’ faith in Badar Khan Suri arrest Here’s how China could retaliate against US tariffs Public Health™ Criminals Convene For Wildly Delusional Circle-Jerk Trump Backs Conservative Author Who Confronted Joe Rogan to His Face FEC Investigating Rep. Jasmine Crockett on ActBlue Donations MORE LRC Blog Mike Benz: How USAID and NED Got Countries To Pass Censorship Laws and Judicial Edicts REAL ID = Real Tyranny! Brainwashing Our Children The Secret History of Western Education – The Scientific Destruction of Minds – Charlotte Iserbyt Why Are Healthy Men Exiting The Workforce? | Nick Eberstadt #274 | The Way I Heard It, with Mike Rowe America’s Untold Stories – Gabbard Drops Bomb: RFK, MLK Records Coming in Days Elon Musk Tweets Milton Friedman Explaining Leonard Read’s Famous Essay, “We’re Taking in $2 Billion a Day!” The Two Seminal Articles Which Predicted and Defined the Trump Phenomena Tucker Carlson and Alex Jones: Trump, Israel, Secret WW3 Plans, Dire Wolf Resurrection, Infowars Reporter Assassination MORE LRC Podcasts Archives Authors Blog Books & Resources Lew Rockwell Books Ron Paul Books Murray N. Rothbard Library & Resources Mises Institute LRC Bestselling Books Political Theatre Podcasts Store About Contact Donate Advertise Search for: Privacy Policy", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.lewrockwell.com/2025/04/no_author/elons-doge-is-ok-but-mises-is-way-better/", "source": "Lewrockwell.com", "published_at": "2025-04-14T04:01:00"}, {"id": 95, "title": "ASX lithium shares: How EVs in China are reshaping lithium demand", "content": "ASX lithium shares: How EVs in China are reshaping lithium demand Skip to content Image source: Getty Images You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources , and more. Learn More A year before global markets were upended by President Trump's tariffs, Tesla CEO Elon Musk warned shareholders of the rising threat of China's electric vehicle makers. In Tesla's Q4 earnings call on January 24, 2024, Mr Musk said: The Chinese car companies are the most competitive car companies in the world. I think they will have significant success outside of China depending on what kind of tariffs or trade barriers are established. Frankly, I think if there are not trade barriers established they will pretty much demolish most other car companies in the world. They are extremely good. I'm aware this story could go in many directions from here. But I'll focus on China's biggest EV maker, its rising dominance, and the implications for ASX lithium shares . Last week, I wrote a story that looked at whether or not the plunging lithium price had finally hit the bottom . A key factor that will determine where the price of lithium will go from here is demand, particularly Chinese demand. The latest Resources and Energy Quarterly report states that global lithium demand is forecast to grow by almost 13% a year to 2030. A closer look reveals forecasts of increased demand for lithium are largely based on expectations of increased uptake of electric vehicles and battery energy storage systems. And BYD , which has now overtaken Tesla to become the biggest supplier of EVs in the world, will play a significant part in fuelling that demand. In 2024, more than 90% of Australia's lithium exports were shipped to China, and the Middle Kingdom's appetite for lithium shows no sign of slowing down. Chinese demand for lithium is set to rise as the biggest player in the EV space continues to expand despite tariff implications. In 2024, BYD reported that it had delivered 4.24 million vehicles, up from around 3 million the previous year. Charging ahead BYD is now selling almost as many vehicles as Ford, an astonishing feat for a company that has been around for only 30 years. This year, the company is projecting that it will deliver about 5.5 million EVs. It's likely that President Trump's tariffs will do little to slow BYD's rising dominance in the electric vehicle market. BYD's biggest market is China, where rising adoption rates of electric vehicles contributed to global EV sales growth of 26% last year. Other key markets for BYD include Europe, South America, Southeast Asia, the Middle East, and Australia. And momentum is continuing into 2025 and beyond. Analysts at JPMorgan have raised their estimate for BYD's vehicle deliveries for 2026 to 6.5 million units. As BYD continues its astronomical growth path, it will have a material impact on global lithium demand. I'm not suggesting that all this means that the price of lithium has hit the floor. But it does seem clear that the signs do point to a more optimistic outlook for ASX-listed lithium players, including Pilbara Minerals Ltd ( ASX: PLS ), Minerals Resources Ltd ( ASX: MIN ), and Liontown Resources Ltd ( ASX: LTR ). Resources Shares Why this fund manager is buying the dip in BHP shares April 14, 2025 | Bernd Struben Let's take a look. Read more » Resources Shares 2 top ASX mining shares I'd buy in April 2025 April 14, 2025 | Tristan Harrison These ASX shares look like top buys to me. Read more » Resources Shares What does Macquarie think Fortescue shares are worth? April 11, 2025 | Zach Bristow Is the iron ore giant about to turn a corner? Read more » Resources Shares Which ASX lithium share should I buy? April 11, 2025 | Steve Holland The ASX is one of the best markets in the world to get exposure to the lithium space. Read more » Resources Shares $10,000 invested in Rio Tinto shares 5 years ago is now worth… April 11, 2025 | Bernd Struben If you’d listened to Warren Buffett’s advice and bought $10,000 of Rio Tinto shares five years ago, guess how much… Read more » Resources Shares Has the lithium price bottomed out? April 10, 2025 | Steve Holland The sinking lithium price has hit ASX lithium companies hard. But are we on the verge of a turnaround? Read more » Resources Shares Down 80% in a year, Macquarie tips Mineral Resources shares to outperform April 10, 2025 | Zach Bristow The broker likes MinRes' current valuations. Read more » Resources Shares Macquarie suggests 73% upside for Pilbara Minerals shares April 9, 2025 | Aaron Bell Why is Macquarie so bullish on this mining company? Read more » Follow The Motley Fool on Google News Get the latest from The Motley Fool Australia on Google News. Go to Google News, then click \"Follow\" button to add us. Browse Articles by Category How To Invest Dividend Investing Resources Shares Retail Shares Bank Shares Tech Shares Healthcare Shares Energy Shares Blue Chip Shares Small Caps ETFs 52 Week Highs Motley Fool's Take Stock Motley Fool In The Media Ask A Fund Manager How can the Fool help you? Sign Up for Take Stock Investment news, stock ideas, and more, straight to your inbox. Get Started Investing You can do it. Learn about investing with our Investing Education hub. Win at Retirement Our latest articles and strategies for the post-work life you want. Listen to Our Podcast Hear our experts take on shares, the market & how to invest. Join Our Premium Community Join our flagship membership service, Share Advisor . Follow The Fool! Satisfaction Guaranteed! The Motley Fool stands behind our products and our membership-fee-back guarantee. If for any reason you are not 100% satisfied with your premium subscription, simply notify us within the first 30 days and you won't pay a cent. Automatic Renewal By taking up this offer, you will also be enrolled in our auto-renewal program, which is our way of making your ongoing subscription easier by ensuring uninterrupted service. Don't worry, though – you're not locked in, and can cancel your auto-renewal at any time before each 'anniversary' date without question or penalty. × Notifications Wondering where you should invest $1,000 right now? Scott Phillips just released his 5 best stocks to buy right now and you could grab the names of these stocks instantly! Learn More ⌃", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.fool.com.au/2025/04/14/asx-lithium-shares-how-evs-in-china-are-reshaping-lithium-demand/", "source": "Motley Fool Australia", "published_at": "2025-04-14T03:16:15"}, {"id": 96, "title": "China Halts Export Of Rare Minerals, Magnet As Trade War With US Intensifies", "content": "China Halts Export Of Key Metals, Magnet As Trade War With US Intensifies arrow-down comments printer search bell top-nav right-arrow Advertisement China Halts Export Of Key Metals, Magnet As Trade War With US Intensifies The Chinese government is drafting a new regulatory system; till then, the shipments of the magnets, essential for the manufacturing of almost everything, ranging from cars to missiles, have been halted at many Chinese ports Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Beijing placed export restrictions on rare earth elements on Friday Washington: As the trade war between the US and China escalates, Beijing has suspended the export of several critical rare earth elements, metals and magnets, threatening to choke off supplies to the West of components central to weapons, electronics, automakers, aerospace manufacturers, semiconductor companies and a wide range of consumer goods. The Chinese government is drafting a new regulatory system for exports, and while the policies are being framed, the shipments of the magnets, essential for the manufacturing of almost everything ranging from cars to missiles, have been halted at many Chinese ports, according to a report by The New York Times. Per the report, once the new regulatory system is in place, it could permanently prevent supplies from reaching certain companies, including American military contractors. US Dependency On Chinese Imports The official crackdown on exports is part of Beijing's retaliation against US President Trump's punishing trade war. China produces around 90 per cent of the world's rare earths, a group of 17 elements used across the defense, electric vehicle, energy and electronics industries. Seven categories of medium and heavy rare earths, including samarium, gadolinium, terbium, dysprosium, lutetium, scandium and yttrium-related items, have been placed on the export control list. The United States has only one rare earths mine, and most of its supply comes from China. Beijing placed export restrictions on rare earth elements on April 2 as part of a broader package of tariffs and company restrictions in retaliation for Trump's decision to hike tariffs against most Chinese products to 54 per cent. The export curbs include not only mined minerals but permanent magnets and other finished products that will be difficult to replace, analysts said. The move, which Beijing had long hinted was possible, further ratchets up trade tensions between the world's two largest economies and leaves American manufacturers scrambling for fresh supplies of the critical minerals they have relied upon for decades. Now, metals and special magnets made with them can only be shipped out of China with special export licenses, the NYT report said. However, Beijing's system to issue these licenses is barely in place, which is causing consternation among industry executives that the process could drag on and that current supplies of minerals and products outside of China could run low. A Move To Exert Dominance The move, which affects exports to all countries, not just the US, is the latest demonstration of China's ability to weaponize its dominance over the mining and processing of the critical minerals. While the export controls stop short of an outright ban, Beijing can throttle shipments by restricting the number of export licenses it issues. Lockheed Martin, Tesla and Apple are among the US companies that use Chinese rare earths in their supply chains. The US government has stockpiles of some rare earths, but not enough to supply its defense contractors in perpetuity. Beijing has already imposed outright bans on the export of three metals to the US and slapped export controls on many others. The moves to restrict heavy rare earths are especially important because China has even tighter control over these elements, David Merriman at consultancy Project Blue, told Reuters. \"There is currently only one HREE (heavy rare earth element) focused operation outside of China, Myanmar and Laos,\" he said, adding that China has close involvement in supply chains from Myanmar and Laos. Why Rare Metals Are Important For The US The heavy rare earth metals put under export suspension by China are used in magnets-- essential for many kinds of electric motors used in the manufacturing of electric cars, drones, robots, missiles and spacecraft and gasoline-powered cars. These metals are required for the manufacturing of jet engines, lasers, car headlights and certain spark plugs and capacitors, which are electrical components of the computer chips that power artificial intelligence servers and smartphones. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: China US Trade Was , Rare Earth Elements , Chinese Exports Related News Chinese AI Developers Outsmart US Chip Restrictions With Overseas Computing: Report Case Filed In Noida Over Illegal Export Of Phone Chips To China, Hong Kong Scientists Find Rare Earth Elements Reserve In Andhra Pradesh: Report Trending News \"Such Language...\": Opposition Counters PM's 'Muslims Fix Punctures' Remark Harvard's $2.2 Billion Funding Frozen For Defying Trump's Campus Demands MS Dhoni's Run-Out Called ' Tukka '. Ex CSK Star Says \"I've Also Worn Gloves\" NASA's Indian-Origin Diversity Chief Sacked After Trump's Executive Order MS Dhoni Breaks All-Time IPL Record, Becomes First Player In History To... Advertisement Advertisement Advertisement Quick Links Latest News PNR Status Education News Business News Sports News MP Chhattisgarh News NDTV Profit Marathi News Board Exam Results 2025 Ambedkar Jayanti 2025 Mehul Choksi Karnataka Murder Trade War Vishu 2025 Advertisement Edition INDIA World Search for News, Photos and Videos Get App for Better Experience Get it on Google Play Download on the App Store Get App for Better Experience Install Now News Updates Live TV India Latest Video Profit Movies Cricket Cities Featured Elections Notifications Opinion Web Stories Trends Feature More Links Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Shopping Toolbox Follow Us On Facebook Twitter Instagram Linkedin Youtube Whatsapp Threads Snapchat arrow-down search search olympic crypto_icon arrow-rgt arrow-next arrow-up close reddit-fill facebook-fill whatsapp-fill cog left-arrow snapchat-fill astrology-icn", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.ndtv.com/world-news/china-halts-export-of-rare-minerals-magnet-as-trade-war-with-us-intensifies-8158767", "source": "NDTV News", "published_at": "2025-04-14T03:13:38"}, {"id": 97, "title": "A Tesla Patent Might Be The Answer To China’s Blanket Restrictions On The Export Of Rare Earth Metals", "content": "A Tesla Patent Might Be The Answer To China's Blanket Restrictions On The Export Of Rare Earth Metals EV Finance A Tesla Patent Might Be The Answer To China’s Blanket Restrictions On The Export Of Rare Earth Metals Rohail Saleem • Apr 13, 2025 at 11:03pm EDT Comments Comments This is not investment advice. The author has no position in any of the stocks mentioned. Wccftech.com has a disclosure and ethics policy. The US and China remain mired in a seemingly never-ending bout of one-upmanship, characterized by tit-for-tat trade levies and strategic export bans, which, in the case of the US, revolve around semiconductors, while China has now flexed its own muscles by restricting the export of rare earth metals. In this highly volatile situation, a Tesla patent from 2023 could be the answer to the conundrum of de-risking America's supply chains, at least where rare earth metals are concerned. China has suspended exports of certain rare earth minerals and magnets to the US and around the world. China is drafting a new regulatory approach to the minerals to prevent them reaching American companies pic.twitter.com/WX8Uh89gkO — unusual_whales (@unusual_whales) April 13, 2025 Related Story Wedbush’s Dan Ives Thinks Trump Has Taken “The Doomsday Scenario Off The Table” And Tech Stocks Will Rally Come Monday, But One Options Market Veteran Feels “It’s A Crowded Trade” As part of its repertoire of responses to Trump's punitive import tariffs, which currently stand at an effective rate of 104 percent (down from a blanket import levy of 145 percent) following the imposition of a reduced levy of just 20 percent on China-sourced semiconductors, smartphones, and electronic products, China has now suspended the export of rare earth metals to the US while it drafts a policy to choke off supplies to the American military and its affiliates. Not the ones that produce the rare earth metals and nowhere near the amount the modern world needs to sustain itself Having an industry that can support the refinement of rare earths requires a massive amount of centralized planning and state policy investment into creating the… — Yakubian Thought and Theory (@Mind_of_yakub) April 14, 2025 For the benefit of those who might not be aware, rare earth metals are used in an entire gamut of industries, including in the production of magnets for electric motors. In contrast to the commonly held view, the US can't just start refining its own copious rare earth resources at the flip of a switch, for such a feat requires an intricate interplay of massive funding, energy, infrastructure, and vertically integrated supply chain partners. While the US can certainly establish its own rare earth domain, it would likely require the better part of a decade. Slitted Magnet for Selective Coercivity: Tesla's Novel Approach to Rare Earth Metal Reduction @Tesla 's WO2024097176A1 patent introduces an innovative magnet manufacturing technique that transforms electric vehicle motor production through strategic cavity-based doping. By… pic.twitter.com/tZcaJ03OPG — SETI Park (@seti_park) December 4, 2024 So, what's the solution in the interim? Well, one idea centers around significantly reducing the use of rare earth metals in key industrial processes, and Tesla might offer one such avenue worth pursuing. To wit, in a patent filed back in 2023, bearing the international publication number WO2024097176A1 , Tesla describes a 'keyhole surgery-like process' to significantly reduce the need for rare earth metals in the manufacturing process of electric motors. The process involves the creation of \"controlled-depth cavities (0.2-1.5mm wide) in magnet structure,\" which then allow for the introduction of specific dopants. According to the patent, the process achieves desired magnetic properties while significantly reducing rare earth metal usage and manufacturing complexity. Of course, it remains unclear if Tesla is using this approach in its gigafactories, and to what extent. However, the approach does stand out for its simplicity and, therefore, could constitute a viable avenue for de-risking America's intertwined supply chains. Deal of the Day Further Reading UBS: Taiwan’s Surging Exports Imply A Data Center Revenue Of $42 Billion For NVIDIA’s April-Ending Quarter Tesla Shares Gain 4.8% – Morgan Stanley Insists Stock Is Still A Top Pick A Tesla Uber-Bull Analyst Cuts His Price Target For The Stock By ~50 Percent, While Declaring That “Darker Days Are Ahead” Tesla Stock Gutted By Another 5.6% As JPMorgan Stunned By Consumer Reaction & Brand Damage Please enable JavaScript to view the comments. Trending Stories Google Raises The Minimum Storage Requirements For Running Android 15 On Phones And Tablets, No Longer Can Devices Ship With 16GB Of Internal Memory 65 Active Readers Intel Engineer Reveals “Griffin Cove” Development Is Already Underway; Says Relying On Intel’s Nodes Alone “Got Them Into Trouble” In The Past 43 Active Readers AMD’s Zen 6-Based Ryzen “Medusa” CPUs Rumored To Feature Two IMCs, Changes DDR5 Memory Orientation 36 Active Readers AMD Confirms Next-Gen EPYC Venice “Zen 6” CPUs Are The First HPC Product Made Using TSMC’s 2nm “N2” Process, 5th Gen EPYC Validated At TSMC Arizona 28 Active Readers Cyberpunk 2077 Looks and Runs Much Better on Nintendo Switch 2 Than Steam Deck, New Footage Confirms 20 Active Readers Popular Discussions Intel Has Reportedly Started To Lose Its Ground In China’s CPU Markets; AMD Sees a Massive Rise In Domestic Market Share 2474 Comments NVIDIA RTX 50 GPUs Reportedly Available At Below MSRP in Walmart’s Return Section — If You’re Lucky Enough to Find One 1552 Comments NVIDIA’s “QC Checks” On The GeForce RTX 5090 Come Into Question as Redditor Reports Damaged Capacitor After Just One Month of Use 1137 Comments NVIDIA GeForce RTX 5070 Goes Below MSRP In Japan For The First Time: Palit RTX 5070 Infinity 3 Listed At $733 992 Comments Intel Engineer Reveals “Griffin Cove” Development Is Already Underway; Says Relying On Intel’s Nodes Alone “Got Them Into Trouble” In The Past 811 Comments", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://wccftech.com/a-tesla-patent-might-be-the-answer-to-chinas-blanket-restrictions-on-the-export-of-rare-earth-metals/", "source": "Wccftech", "published_at": "2025-04-14T03:03:46"}, {"id": 98, "title": "Some top tech leaders have embraced Trump, that's created a political divide in Silicon Valley", "content": "Some top tech leaders have embraced Trump, that's created a political divide in Silicon Valley - The Economic Times Benchmarks Nifty 22,828.55 429.4 FEATURED FUNDS ★★★ ★★ Canara Robeco ELSS Tax Saver Regular - Growth 5Y Return 21.85 % Invest Now FEATURED FUNDS ★★★ ★★ HSBC Large Cap Fund Direct-Growth 5Y Return 20.75 % Invest Now Enter search text: Business News › Tech › Tech & Internet › Some top tech leaders have embraced Trump, that's created a political divide in Silicon Valley The Economic Times daily newspaper is available online now. Read Today's Paper Powered by Some top tech leaders have embraced Trump, that's created a political divide in Silicon Valley SECTIONS Some top tech leaders have embraced Trump, that's created a political divide in Silicon Valley By AP Last Updated: Apr 14, 2025, 07:44:00 AM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis Political gap seen between tech leaders and their workforce The tech industry's political allegiances remain divided. But as some in the upper echelons of Silicon Valley began shifting to the right politically, many of the tech industry's everyday workers have remained liberal - but also increasingly nervous and disillusioned. AP Like many in the tech industry, Jeremy Lyons used to think of himself as a relatively apolitical guy. The only time he had participated in a demonstration before now was in the opening days of Donald Trump 's first presidential term, when he joined fellow Google workers walking out of the company's Silicon Valley campus to protest immigration restrictions. Google's co-founder and its chief executive officer joined them. Last weekend was Lyons' second, also against Trump, but it had a very different feel. The man directing thousands of marchers with a bullhorn in downtown San Jose on April 5 was another tech worker who would not give his full name for fear of being identified by Trump backers. Marchers were urged not to harass drivers of Tesla vehicles, which have gone from a symbol of Silicon Valley's environmental futurism to a pro-Trump icon. And no tech executives were anywhere to be seen, only months after several had joined Trump at his January inauguration. To Lyons, 54, the change says as much about what's happened to Silicon Valley over the past quarter-century as it does about the atmosphere of fear surrounding many Trump critics nowadays. Live Events \"One of the things I've seen over that time is a shift from a nerdy utopia to a money first, move fast and break things,\" Lyons said. Discover the stories of your interest Blockchain 5 Stories Cyber-safety 7 Stories Fintech 9 Stories E-comm 9 Stories ML 8 Stories Edtech 6 Stories Political gap seen between tech leaders and their workforce The tech industry's political allegiances remain divided. But as some in the upper echelons of Silicon Valley began shifting to the right politically, many of the tech industry's everyday workers have remained liberal - but also increasingly nervous and disillusioned. Their mood is in stark contrast to the prominent tech leaders who have embraced a conservative populist ideology. \"I think you're seeing a real gap between the leadership elite here in Silicon Valley and their workforce,\" said Ann Skeet, who helps run a center at Santa Clara University studying the ethics of the tech industry. \"The shift hasn't been for a lot of people,\" said Lenny Siegel, a former mayor of Mountain View and longtime liberal activist in the valley. \"It's a handful of people who've gotten the attention.\" The biggest example of that is Elon Musk, the world's richest person and CEO of the world's best-known electric car company who has taken on a prominent role slashing federal agencies in Trump's administration. Musk has been joined by several tech billionaires, including investor David Sacks, who helped fundraise for Trump's campaign and became the White House 's artificial intelligence and cryptocurrency czar, and venture capitalist Marc Andreesen. Google CEO Sundar Pichai and Meta CEO Mark Zuckerberg also attended Trump's inauguration in Washington. Zuckerberg began praising Trump after the then-candidate, angered over money Zuckerberg steered toward local election offices in some states in 2020 during the coronavirus pandemic, threatened last summer to imprison him. Zuckerberg also donated $1 million to the president's inauguration fund and co-hosted an inauguration reception for billionaire Republican donors. Trump has filled a number of his administration's posts with billionaires and his support from wealthy tech leaders led Democratic President Joe Biden to warn that the United States risked becoming an oligarchy ruled by elites. During Trump's first term, the valley and its leaders were a bulwark of resistance to the Republican, especially over immigration, given that the industry draws its workforce from around the globe. It's against that backdrop that thousands of people attended the recent rally at a downtown San Jose park to protest the actions of Trump and Musk . Even as tech industry has changed, Silicon Valley has leaned Democratic Santa Clara County, which comprises most of Silicon Valley, swung 8 percentage points toward Trump in November election against Democrat Kamala Harris, matching the shift across California. Even with that swing, the county voted 68% to 28% for the then-vice president and remains a Democratic stronghold. \"We're still in the belly of the beast,\" said Dave Johnson, the new executive director of the Santa Clara GOP, who said the party has gained some new members in the county but few from the tech industry. \"If the lake was frozen, there's a little glimmer on top. I would not say there are cracks in the ice.\" The valley has long leaned Democratic, but with an unusual political mix: a general dislike of getting too involved in Washington's business coupled with an at-times contradictory mix of libertarian individualism, Bay Area activism and belief in the ability of science to solve the world's problems. That has persisted even as the tech industry has changed. The tech boom was fueled by scrappy startups that catered to their workers' dreams of changing the world for the better. Google's motto was \"don't be evil,\" a phrase it removed from its code of conduct by 2018, when it and other companies such as Meta, which owns Facebook and Instagram, had grown into multinational behemoths. The companies have had layoffs in recent years, a shock to an industry that not long ago seemed poised for unlimited growth. Entrepreneurs once dreamed of building startups that would change the world, said Jan English-Lueck, a San Jose State University professor who has been studying Silicon Valley culture for more than 20 years. \"Now,\" she said, \"if you're part of a startup, you're hoping you'll be absorbed in a way that's profitable.\" Discontent among some in the tech industry about where it's headed Even before some prominent tech leaders shifted toward Trump, there was mounting discontent among some in the industry over its direction. IdaRose Sylvester runs a business promoting a Silicon Valley-style approach to entrepreneurs in other countries. \"I feel sick to my stomach now,\" she said. Sylvester was already disenchanted with the growing inequality in the valley and the environmental cost of all the energy needed to power crypto, AI and data centers. She took part in protests against Trump in 2017, but felt that energy fade once he lost the 2020 election to Biden. \"I saw a lot of people get out of politics once Biden won. There was a feeling it was all OK,\" Sylvester said. \"It was not all OK.\" It is worse now, she said. She helped organize one of several demonstrations across the valley last weekend during a national day of protests against the new administration. At first glance, the one in downtown San Jose could have been a typical anti-Trump protest anywhere. A large crowd of largely middle-age and older people carried signs against the president and Musk while chanting against oligarchs. But it was clearly a Silicon Valley crowd, one still reeling not only from Trump's challenges to the country's system of checks and balances but also from the actions of the valley's top executives. \"The money is all shifting to the wealthiest, and that terrifies me,\" said Dianne Wood, who works at a startup. \"Unfortunately, you've got the Zuckerbergs and Elon Musks of the world who are taking that over.\" \"Just coming here, everyone's saying turn off the facial recognition on your phone,\" Wood added. \"We're all scared.\" Kamal Ali, who works in AI, said he felt betrayed by that shift. \"The trust is broken. A lot of employees are very upset by what's going on,\" he said. \"It's going to be different forever.\" Read More News on trump silicon valley zuckerbergs white house trump and musk santa clara university Google Read More News on trump silicon valley zuckerbergs white house trump and musk santa clara university Google Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Asian Paints is trading at P/E lower than pandemic levels. Is it still a value buy? The work of art(ists) in the age of GenAI The 18th-century clergyman's math that powers today's AI revolution Why every large IT deal is going back to the drawing board AI Diffusion Rule is yet another headache coming soon from the US Probability favours them: 2 sectors, 7 stocks which might be higher by this time next year, just because of one habit 1 2 3 View all Stories Poll of the Day Will Trump 2.0 mean good news for Indian startups? Yes No Can't say Latest from ET Trump’s tariff twists give China a breather, but India still wins Tango with a twist: China cold to real India ties Zero-tariff US deal? There's zero chance! Tech Top Trending Terms Union Budget FDI Budget For Startups IT Budget News Live Budget 2025 For Startups Budget 2025 for Gig Workers Union Budget For AI Popular in Tech UPI hit by another outage, thousands of users report issues in payments UPI no more a technology, it's a population-scale habit: FIDE CEO Sujit Nair UPI outage disrupts digital payments nationwide, users vent online Bill Gates predicts AI will replace both blue-and white-collar jobs India's semiconductor demand to see 15% CAGR, hitting $108 billion by 2030: UBS report Enter search text: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Name Reason for reporting: Foul language Slanderous Inciting hatred against a certain community Others Your Reason has been Reported to the admin. X To post this comment you must Log In/Connect with: The Economic Times or Fill in your details: Will be displayed Will not be displayed Will be displayed Share this Comment: Post to Twitter Stories you might be interested in Subscribe to our ET Investment Opportunities SUBMIT", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://economictimes.indiatimes.com/tech/technology/some-top-tech-leaders-have-embraced-trump-thats-created-a-political-divide-in-silicon-valley/articleshow/120267083.cms", "source": "The Times of India", "published_at": "2025-04-14T02:09:10"}, {"id": 99, "title": "Cred’s valuation cut; BluSmart ends ride", "content": "Cred’s valuation cut; BluSmart ends ride Benchmarks Nifty 22,828.55 429.4 FEATURED FUNDS ★★★ ★★ Canara Robeco ELSS Tax Saver Regular - Growth 5Y Return 21.85 % Invest Now FEATURED FUNDS ★★★ ★★ HSBC Large Cap Fund Direct-Growth 5Y Return 20.75 % Invest Now Enter search text: Business News › Tech › Newsletters › Morning Dispatch › Cred’s valuation cut; BluSmart ends ride Prev Explore other editions Next Morning Dispatch Cred’s valuation cut; BluSmart ends ride Want this newsletter delivered to your inbox? SUBSCRIBE I agree to receive newsletters and marketing communications via e-mail Thank you for subscribing to Morning Dispatch We'll soon meet in your inbox. Happy Monday! Cred is in early talks to raise new funds at a reduced valuation. This and more scoops in a packed edition of ETtech Morning Dispatch. Also in the letter: ■ Bumrah’s latest delivery ■ India’s tariff advantage ■ K’taka’s gig welfare policy Scoop: Cred in talks to raise new funds as valuation slips by over 30% to $4 billion Credit card bill payments startup Cred has held discussions to pick up new funds at a lower valuation compared to its previous round, several people in the know said. Deal details: Existing backers, including Singaporean sovereign fund GIC, Peak XV Partners, Tiger Global, Ribbit Capital, QED, among others are in discussions to invest $100-$200 million in Cred’s latest financing, people in the know told us. The round could value Cred anywhere between $3.5-4 billion, a significant drop from its $6.4 billion valuation in 2022 . Valuation correction: If the round goes through, the Kunal Shah-led Cred may become one of the first major fintechs to raise venture funding at a markdown from its 2022 peak. Despite steady revenue growth and positive cash flow, sources said Cred’s decision to pursue a down round reflects broader market realities. Between 2021 and 2022, the startup’s valuation jumped from $3.4 billion to $6.4 billion in a year’s time. Global fintech reset: Silicon Valley-based payments giant Stripe slashed its valuation from a 2021 peak of $95 billion to $50 billion last year . Earlier this year, Stripe disclosed that investors purchased employee shares through a tender offer at a $91.5 billion valuation. Swedish fintech firm Klarna saw its valuation plunge from $46 billion to $6.7 billion. Having delayed its IPO, Klarna now aims for a valuation above $15 billion when it eventually lists . Pushing growth: The fresh capital would help Cred accelerate growth across its business lines spanning lending, insurance, ecommerce and digital payments. Part of the funding may also bolster its lending arm, Newtap Finance, which aims to play a larger role in Cred's expanding financial services portfolio. Also Read: Cred tweaks P2P lending platform Mint to abide by latest RBI norms Exclusive: BluSmart may end cab-hailing trip, hit reverse gear Anmol Singh Jaggi, CEO, BluSmart Electric ride-hailing startup BluSmart is preparing to shut down its own platform and transition into an Uber fleet partner, starting with 700–800 vehicles over the next few weeks. Funding woes: The company's monthly cash burn exceeds Rs 20 crore, prompting the decision to wind down its core operations. Earlier this year, a $50 million fundraising effort collapsed after existing investors refused to inject fresh capital. Financial troubles have deepened due to a debt crisis at Gensol Engineering, a firm backed by BluSmart founders Anmol Singh Jaggi and Puneet Singh Jaggi. This has further constrained access to funds for the ride-hailing business. What else: Once BluSmart’s vehicles are listed on Uber, the startup will receive a share of fare revenues while Uber retains its standard commission—just as it does with other fleet operators or individual driver partners. Leadership exodus: Several senior BluSmart executives have recently stepped down, including fleet CEO Anirudh Arun, chief technology officer Rishabh Sood, and chief business officer Tushar Garg, formerly of Uber India. Also Read: ETtech in-depth: Ride-hailing on a rollercoaster ride with sharp twists, turns Cricketer Jasprit Bumrah backs luggage startup Uppercase as an investor India’s ace fast bowler, Jasprit Bumrah, has made an equity investment in modern luggage startup Uppercase . Driving the news: Bumrah’s move reflects a broader trend of celebrities looking beyond traditional brand endorsements to make business investments. In recent years, cricketers such as Sachin Tendulkar, MS Dhoni, and Hardik Pandya have increasingly invested in businesses or launched their own ventures. Investment details: Sudip Ghose, founder of Uppercase, revealed that the company will collaborate with Bumrah to develop a new line of products, including luggage, backpacks, and gym bags, designed primarily for athletes. Bumrah will receive a share of the profits from these items. Other happenings: Last week, former Indian cricket captain Virat Kohli ended his Rs 110 crore endorsement deal with Puma after eight years. He has now joined and invested in Agilitas, a Bengaluru-based sportswear manufacturing and athleisure startup founded by ex-Puma India managing director Abhishek Ganguly. Other Top Stories By Our Reporters In times of tariff war, India to play key role in US supply chain: India is set to emerge as a leading source for American electronics and consumer-technology buyers. The tariff war will likely upend existing supply chain dynamics and quicken the need for a more diversified vendor base beyond Chinese fabs. Karnataka may levy differential fees on app-based services to fund gig worker welfare: The state government is drafting a differential fee structure for app-based aggregators to fund gig worker welfare, according to officials involved in the policy process. Under the proposed framework, higher-revenue platforms, such as cab-hailing services, are expected to face steeper fees. Global Picks We Are Reading ■ Bluesky can’t take a joke ( Wired ) ■ Tim Cook’s ‘long arc of time’ prepared Apple for the trade war ( WSJ ) ■ Tesla arrives in Saudi Arabia after Musk’s tumultuous history ( Rest of the World ) Prev Explore other editions Next Updated On Apr 14, 2025, 12:00 PM IST Want this newsletter delivered to your inbox? SUBSCRIBE I agree to receive newsletters and marketing communications via e-mail Thank you for subscribing to Morning Dispatch We'll soon meet in your inbox. Enter search text:", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://economictimes.indiatimes.com/tech/newsletters/morning-dispatch/creds-valuation-cut-blusmart-ends-ride/articleshow/120266617.cms", "source": "The Times of India", "published_at": "2025-04-14T01:33:37"}, {"id": 100, "title": "Trump’s Commerce Secretary: Electronics tariff exemptions are temporary, chip tariffs coming soon", "content": "Trump’s Commerce Secretary: Electronics tariff exemptions are temporary, chip tariffs coming soon - The Hindu BusinessLine /> For a better experience, Read this story in our App SENSEX 75,157.26 + 1,310.11 NIFTY 22,828.55 + 429.40 CRUDEOIL 5,310.00 + 141.00 GOLD 93,887.00 + 142.00 SILVER 94,300.00 + 14.00 SENSEX 75,157.26 + 1,310.11 NIFTY 22,828.55 + 429.40 NIFTY 22,828.55 + 429.40 CRUDEOIL 5,310.00 + 141.00 CRUDEOIL 5,310.00 + 141.00 GOLD 93,887.00 + 142.00 THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. Trump’s Commerce Secretary: Electronics tariff exemptions are temporary, chip tariffs coming soon The goods will soon fall under a new semiconductor-specific tariff policy, likely within two months By AP- PTI Updated - April 14, 2025 at 07:33 AM. | Nashville US Commerce Secretary Howard Lutnick. The ongoing ambiguity has rattled markets, especially Big Tech firms like Apple and Nvidia, with experts warning of severe disruption to supply chains and investor confidence. | Photo Credit: NATHAN HOWARD/Reuters Tariff exemptions announced Friday on electronics like smartphones and laptops are only a temporary reprieve until the Trump administration develops a new tariff approach specific to the semiconductor industry, US Commerce Secretary Howard Lutnick said Sunday. “They're exempt from the reciprocal tariffs but they're included in the semiconductor tariffs, which are coming in probably a month or two,” Lutnick told ABC's “This Week” on Sunday. President Donald Trump added to the confusion hours later, declaring on social media that there was no “exception” at all because the goods are “just moving to a different\" bucket and will still face a 20 per cent tariff as part of his administration's move to punish China for its role in fentanyl trafficking. Also read Apple India produces $22 billion of iPhones in shift from China The Trump administration late Friday had said it would exclude electronics from broader so-called reciprocal tariffs, a move that could help keep the prices down for popular consumer devices that aren't usually made in the US The move was expected to benefit big tech companies like Apple and Samsung and chip makers like Nvidia, though the uncertainty of future tariffs may rein in an expected tech stock rally on Monday. US Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won't be subject to most of the tariffs levied on China or the 10% baseline tariffs elsewhere. Also read Apple airlifts 600 tonnes of iPhones from India to beat Trump tariffs, sources say It's the latest tariff change by the Trump administration, which has made several U-turns in its massive plan to put tariffs in place on goods from most countries. Lutnick's comments Sunday made clear that more changes were on the way, including a policy specific to the computer chip industry. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. In his post Sunday on TruthSocial, he promised the White House was “taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Security Tariff Investigations.” Some had assumed the exemption filed Friday night reflected the president's realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the US any time soon, if ever. The administration has predicted that the trade war prod Apple to make iPhones in the US for the first time, but that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. Also read Semiconductors from China under US scrutiny as Trump warns of fresh tariffs What's more, it would take several years and cost billions of dollars to build new plants in the US, and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. The turmoil has battered the stocks of tech's “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the Magnificent Seven's combined market value had plunged by USD2.1 trillion, or 14 per cent, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. When Trump paused the tariffs outside of China on Wednesday, the lost value in those companies was pared to USD 644 billion, or a 4 per cent decline. An electronics exemption would fulfill the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech's hopes that Trump would be more accommodating than President Joe Biden's administration. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the US during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump's first term when the iPhone was exempted from China tariffs. The move removes “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. Ives amended that note after Lutnick's comments Sunday, saying the confusing news out of the White House “is dizzying for the industry and investors and creating massive uncertainty and chaos for companies trying to plan their supply chain, inventory, and demand.” Neither Apple nor Samsung responded to a request for comment over the weekend. Nvidia declined to comment. Comments Published on April 14, 2025 READ MORE THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. THIS AD SUPPORTS OUR JOURNALISM. SUBSCRIBE FOR MINIMAL ADS. Comments Comments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of TheHindu Businessline and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle. Sign into Unlock benefits! Access 10 free stories per month Access to comment on every story Sign up/Manage to our newsletters Get notified by email for early preview to new features, discounts & offers ✕ Looks like you are already logged in from more than 3 devices! To continue logging in, remove at least one device from the below list Log out di.payload), 'all')\">Log Out from all devices Terms & conditions | Institutional Subscriber", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.thehindubusinessline.com/news/world/trumps-commerce-secretary-electronics-tariff-exemptions-are-temporary-chip-tariffs-coming-soon/article69448111.ece", "source": "BusinessLine", "published_at": "2025-04-14T01:11:06"}, {"id": 101, "title": "Trump advisor Navarro looks to cool spat with Musk", "content": "Bangkok Post - Trump advisor Navarro looks to cool spat with Musk Trump advisor Navarro looks to cool spat with Musk Small Medium Large 2 World Trump advisor Navarro looks to cool spat with Musk PUBLISHED : 14 Apr 2025 at 07:45 WRITER: AFP Small Medium Large 6 2 Listen to this article Play Pause Navarro and Musk have clashed over US manufacturing WASHINGTON - Donald Trump's trade advisor Peter Navarro on Sunday insisted that \"everything's fine with Elon\" Musk, after the Tesla chief called him a \"moron.\" Musk, who as a fellow member of the American president's inner circle was charged with government cost-cutting, has clashed with Navarro over the tariffs broadside the president unleashed that reflects his antagonistic view of global trade. Navarro is \"truly a moron\" and \"dumber than a sack of bricks,\" Musk posted to his X social platform last week during a spat over the American parts content in Tesla vehicles. He later dubbed the Trump advisor \"Peter Retarrdo\" in a separate post. \"I've been called worse. Everything's fine with Elon,\" Navarro told broadcaster NBC on Sunday. \"Elon is doing a very good job with his team with waste, fraud and abuse. That's a tremendous contribution to America,\" he added of Musk's aggressive cost-cutting through his so-called Department of Government Efficiency (DOGE). Navarro had taken aim at Tesla after the billionaire Musk, who also owns SpaceX, proposed a free-trade zone between the US and Europe. The economist claimed Tesla mostly assembled components like batteries and motors shipped in from factories in Asia. Those are exactly the types of jobs Trump says his trade offensive is designed to bring back to America. Musk retorted with studies he said showed \"Tesla has the most American-made cars.\" \"Navarro should ask the fake expert he invented, Ron Vara,\" he added -- referring to a fictional pundit Navarro quoted in a series of books and a policy memo, using an anagram of his own name. White House spokeswoman Karoline Leavitt tried last week to play down the public feud, saying that \"boys will be boys and we will let their public sparring continue.\" Do you like the content of this article? COMMENT (2) RECOMMENDED Macron urges 'reform' of Palestinian Authority to run Gaza without Hamas Ecuador votes in razor-close presidential runoff Trump's tariff exemptions give markets relief, but tensions loom Trump downplays tariffs walk-back, says no country 'off the hook' Mayor of Ukraine's Sumy says over 20 dead from Russian missile strike TRENDING Try now", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.bangkokpost.com/world/3002726/trump-advisor-navarro-looks-to-cool-spat-with-musk", "source": "Bangkok Post", "published_at": "2025-04-14T00:45:00"}, {"id": 102, "title": "Stock Futures Rise as Traders Digest Brief Tech Tariff Reprieve", "content": "Stock Futures Rise as Traders Digest Brief Tech Tariff Reprieve Why did global banks lower China forecasts? What fueled the FTSE 100 rally? How did Trump’s tariffs boost auto stocks? Why is Ericsson’s network spending rising? What drives Japan’s population decline? Why is Bhutan eyeing Bitcoin mining? How did Publicis beat growth expectations? What sparked US chip import probes? How did tariff news impact tech stocks? Stock Futures Rise as Traders Digest Brief Tech Tariff Reprieve bloomberg.com/news/articles/2025-04-13/stock-futures-rise-as-traders-digest-brief-tech-tariff-reprieve This story appeared on bloomberg.com , 2025-04-13 23:00:47.662000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/1be717d6c3ad63bb", "source": "Biztoc.com", "published_at": "2025-04-13T23:49:30"}, {"id": 103, "title": "Stock Market Today: Dow, S&P 500 and Nasdaq Futures Open Higher — Live Updates", "content": "Stock Market Today: Dow, S&P 500 and Nasdaq Futures Open Higher — Live Updates Why did global banks lower China forecasts? What fueled the FTSE 100 rally? How did Trump’s tariffs boost auto stocks? Why is Ericsson’s network spending rising? What drives Japan’s population decline? Why is Bhutan eyeing Bitcoin mining? How did Publicis beat growth expectations? What sparked US chip import probes? How did tariff news impact tech stocks? Stock Market Today: Dow, S&P 500 and Nasdaq Futures Open Higher — Live Updates wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-14-25 This story appeared on wsj.com , 2025-04-13 23:49:26.409000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/62f9fb7ef26f4c8f", "source": "Biztoc.com", "published_at": "2025-04-13T23:49:26"}, {"id": 104, "title": "British CFOs Turned Risk-Averse Even Before US Tariffs", "content": "British CFOs Turned Risk-Averse Even Before US Tariffs Why did global banks lower China forecasts? What fueled the FTSE 100 rally? How did Trump’s tariffs boost auto stocks? Why is Ericsson’s network spending rising? What drives Japan’s population decline? Why is Bhutan eyeing Bitcoin mining? How did Publicis beat growth expectations? What sparked US chip import probes? How did tariff news impact tech stocks? British CFOs Turned Risk-Averse Even Before US Tariffs bloomberg.com/news/articles/2025-04-13/british-cfos-turned-risk-averse-even-before-us-tariffs This story appeared on bloomberg.com , 2025-04-13 23:01:00.004000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/31205850824ca9c3", "source": "Biztoc.com", "published_at": "2025-04-13T23:49:20"}, {"id": 105, "title": "Japan braces for talks on yen, BOJ in trade negotiatons with US", "content": "Japan braces for talks on yen, BOJ in trade negotiatons with US Why did global banks lower China forecasts? What fueled the FTSE 100 rally? How did Trump’s tariffs boost auto stocks? Why is Ericsson’s network spending rising? What drives Japan’s population decline? Why is Bhutan eyeing Bitcoin mining? How did Publicis beat growth expectations? What sparked US chip import probes? How did tariff news impact tech stocks? Japan braces for talks on yen, BOJ in trade negotiatons with US investing.com/news/economy-news/japan-braces-for-talks-on-yen-boj-in-trade-negotiatons-with-us-3982538 This story appeared on investing.com , 2025-04-13 23:15:39. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/267591e01f9ab76c", "source": "Biztoc.com", "published_at": "2025-04-13T23:38:14"}, {"id": 106, "title": "Trump Advisor Navarro Looks To Cool Spat With Musk", "content": "Trump Advisor Navarro Looks To Cool Spat With Musk | IBTimes World Navarro and Musk have clashed over US manufacturing AFP Donald Trump's trade advisor Peter Navarro on Sunday insisted that \"everything's fine with Elon\" Musk, after the Tesla chief called him a \"moron.\" Musk, who as a fellow member of the American president's inner circle was charged with government cost-cutting, has clashed with Navarro over the tariffs broadside the president unleashed that reflects his antagonistic view of global trade. Navarro is \"truly a moron\" and \"dumber than a sack of bricks,\" Musk posted to his X social platform last week during a spat over the American parts content in Tesla vehicles. He later dubbed the Trump advisor \"Peter Retarrdo\" in a separate post. \"I've been called worse. Everything's fine with Elon,\" Navarro told broadcaster NBC on Sunday. \"Elon is doing a very good job with his team with waste, fraud and abuse. That's a tremendous contribution to America,\" he added of Musk's aggressive cost-cutting through his so-called Department of Government Efficiency (DOGE). Navarro had taken aim at Tesla after the billionaire Musk, who also owns SpaceX, proposed a free-trade zone between the US and Europe. The economist claimed Tesla mostly assembled components like batteries and motors shipped in from factories in Asia. Those are exactly the types of jobs Trump says his trade offensive is designed to bring back to America. Musk retorted with studies he said showed \"Tesla has the most American-made cars.\" \"Navarro should ask the fake expert he invented, Ron Vara,\" he added -- referring to a fictional pundit Navarro quoted in a series of books and a policy memo, using an anagram of his own name. White House spokeswoman Karoline Leavitt tried last week to play down the public feud, saying that \"boys will be boys and we will let their public sparring continue.\" Elon musk President donald trump © Copyright AFP 2024. All rights reserved. IBT Fast Start - Let the best of International News come to you Sign up and stay up to date with our daily newsletter. You can unsubscribe at any time. By signing up you are agreeing to our Terms of Service and Privacy Policy . Join the Discussion MOST POPULAR IN World What Are China Rare Earth Minerals? What Are They Used For And Do The Chinese Have Monopoly? Trump Says Russian Attack That Killed Over 30 People In Ukraine Was a 'Mistake': 'This is Biden's War' US-China Trade War: Beijing Halts Rare Earth Exports, Affecting Global Tech, Auto, Defense Sectors Trump Carves Up World And International Order With It UK Lawmakers Begin Emergency Debate To Save British Steel Trump Spotlight Divides S.Africa's Afrikaners Bulgarian Border City Hails Schengen Tourism Boom Myanmar Marks New Year Festival Mourning Quake Losses UN Warns US Aid Cuts Threaten Millions Of Afghans With Famine North Korea Building Largest Warship In Its History, Satellite Images Reveal Bernie Sanders Fights Apathy On American Left Accord Reached 'In Principle' Over Tackling Future Pandemics: Negotiating Body Trump Downplays Tariffs Walk-back, Says No Country 'Off The Hook' Trump Advisor Navarro Looks To Cool Spat With Musk Members Of Hong Kong's Democratic Party Approve Plan To Disband Iran Says Talks With US To Focus Solely On Nuclear Issue, Lifting Sanctions Over 100 Feared Dead In Sudan Paramilitary Attacks In Darfur: UN Trump Blames Zelensky For 'Millions' Of Deaths In Russian Invasion Vargas Llosa, Last Of Latin America's Literary Golden Generation Zelensky Urges Trump To Visit Ukraine To See War Devastation: CBS Promoted in World 1 Amigos Internacionales' Medical Camp Gives New Hope to Ogul Village, Calls for $3.5M Funding for Continuous Support 2 To End The Migration Crisis, The US Needs Venezuela 3 The Philippines As A Hub For Call Centre Excellence: Emerging Trends And Growth Potential 4 Pilar Reynoso Redefines Canadian Immigration Through K-izen AI Immigration Academic 5 Ibtikar Fund's Transformational Impact On Palestinians And Their Diaspora MOST POPULAR IN World 1 What Are China Rare Earth Minerals? What Are They Used For And Do The Chinese Have Monopoly? 2 Trump Says Russian Attack That Killed Over 30 People In Ukraine Was a 'Mistake': 'This is Biden's War' 3 US-China Trade War: Beijing Halts Rare Earth Exports, Affecting Global Tech, Auto, Defense Sectors 4 Trump Carves Up World And International Order With It 5 UK Lawmakers Begin Emergency Debate To Save British Steel 6 Trump Spotlight Divides S.Africa's Afrikaners 7 Bulgarian Border City Hails Schengen Tourism Boom 8 Myanmar Marks New Year Festival Mourning Quake Losses 9 UN Warns US Aid Cuts Threaten Millions Of Afghans With Famine 10 North Korea Building Largest Warship In Its History, Satellite Images Reveal 11 Bernie Sanders Fights Apathy On American Left 12 Accord Reached 'In Principle' Over Tackling Future Pandemics: Negotiating Body 13 Trump Downplays Tariffs Walk-back, Says No Country 'Off The Hook' 14 Trump Advisor Navarro Looks To Cool Spat With Musk 15 Members Of Hong Kong's Democratic Party Approve Plan To Disband 16 Iran Says Talks With US To Focus Solely On Nuclear Issue, Lifting Sanctions 17 Over 100 Feared Dead In Sudan Paramilitary Attacks In Darfur: UN 18 Trump Blames Zelensky For 'Millions' Of Deaths In Russian Invasion 19 Vargas Llosa, Last Of Latin America's Literary Golden Generation 20 Zelensky Urges Trump To Visit Ukraine To See War Devastation: CBS Get up to Speed with IBT’s Fast Start Stay up to date with our daily newsletter Sign Up Now IBT VIDEO", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.ibtimes.com/trump-advisor-navarro-looks-cool-spat-musk-3769901", "source": "International Business Times", "published_at": "2025-04-13T23:33:47"}, {"id": 107, "title": "Tesla accused of using sneaky tactic to dodge car repairs", "content": "Tesla accused of using sneaky tactic to dodge car repairs Why did global banks lower China forecasts? What fueled the FTSE 100 rally? How did Trump’s tariffs boost auto stocks? Why is Ericsson’s network spending rising? What drives Japan’s population decline? Why is Bhutan eyeing Bitcoin mining? How did Publicis beat growth expectations? What sparked US chip import probes? How did tariff news impact tech stocks? Tesla accused of using sneaky tactic to dodge car repairs thestreet.com/automotive/tesla-accused-of-using-sneaky-tactic-to-dodge-car-repairs This story appeared on thestreet.com , 2025-04-13 23:27:36.591000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.6, "url": "https://biztoc.com/x/25515ed7fad8e803", "source": "Biztoc.com", "published_at": "2025-04-13T23:27:36"}, {"id": 108, "title": "Global Funds Hit Pause on Indonesia After Prabowo Policy Changes", "content": "Global Funds Hit Pause on Indonesia After Prabowo Policy Changes Why is Nvidia shifting AI chip production to US? What triggered US tariff exemptions on consumer electronics? How will high tariffs affect auto industry stocks? What caused Chinese toymaker Pop Mart’s share jump? Why are consumer prices rising amid tariff uncertainty? What impact will trade tensions have on global markets? Why did European bonds react strongly to trade news? How will US-South Korea trade talks reshape energy exports? What are the risks from escalating US-China trade disputes? Global Funds Hit Pause on Indonesia After Prabowo Policy Changes bloomberg.com/news/articles/2025-04-13/global-funds-hit-pause-on-indonesia-after-prabowo-policy-changes This story appeared on bloomberg.com , 2025-04-13 23:00:00.001000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/520eea0562229d50", "source": "Biztoc.com", "published_at": "2025-04-13T23:27:30"}, {"id": 109, "title": "Old-school Bay Area Italian restaurant closing after 42 years", "content": "Old-school Bay Area Italian restaurant closing after 42 years Why is Nvidia shifting AI chip production to US? What triggered US tariff exemptions on consumer electronics? How will high tariffs affect auto industry stocks? What caused Chinese toymaker Pop Mart’s share jump? Why are consumer prices rising amid tariff uncertainty? What impact will trade tensions have on global markets? Why did European bonds react strongly to trade news? How will US-South Korea trade talks reshape energy exports? What are the risks from escalating US-China trade disputes? Old-school Bay Area Italian restaurant closing after 42 years sfgate.com/food/article/old-school-bay-area-italian-restaurant-closing-20271682.php This story appeared on sfgate.com , 2025-04-13 23:27:16.387000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/2e221f6998fb9cb9", "source": "Biztoc.com", "published_at": "2025-04-13T23:27:16"}, {"id": 110, "title": "Nasdaq set to lead Dow, S&P 500 higher on tech tariff pause amid mixed signals", "content": "Nasdaq set to lead Dow, S&P 500 higher on tech tariff pause amid mixed signals Why is Nvidia shifting AI chip production to US? What triggered US tariff exemptions on consumer electronics? How will high tariffs affect auto industry stocks? What caused Chinese toymaker Pop Mart’s share jump? Why are consumer prices rising amid tariff uncertainty? What impact will trade tensions have on global markets? Why did European bonds react strongly to trade news? How will US-South Korea trade talks reshape energy exports? What are the risks from escalating US-China trade disputes? Nasdaq set to lead Dow, S&P 500 higher on tech tariff pause amid mixed signals marketwatch.com/story/nasdaq-set-to-lead-dow-s-p-500-higher-on-tech-tariff-pause-amid-mixed-signals-42354020?g=25fc32e2-ee4d-46d4-ab79-2b44b58f1497 This story appeared on marketwatch.com , 2025-04-13 23:19:03. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/e09fabacbd38720d", "source": "Biztoc.com", "published_at": "2025-04-13T23:27:15"}, {"id": 111, "title": "New Yorkers revolt against ‘toxic’ new neighborhood battery storage facilities as backlash grows to green energy law", "content": "New Yorkers revolt against ‘toxic’ new neighborhood battery storage facilities as backlash grows to green energy law Free Republic Browse · Search News/Activism Topics · Post Article Skip to comments. New Yorkers revolt against ‘toxic’ new neighborhood battery storage facilities as backlash grows to green energy law NY Post ^ | April 13, 2025, 5:22 p.m. ET | y Dorian Geiger, Hannah Fierick and Carl Campanile Posted on 04/13/2025 4:25:43 PM PDT by BenLurkin New Yorkers are lining up in opposition to dozens of new lithium-ion battery storage facilities planned across the Big Apple and beyond, over fears they could spark toxic infernos in residential neighborhoods. Queens Councilman Robert Holden said he doesn’t want his neighborhood to turn into a potential “mini-Chernobyl” The site, which is now vacant at 64-30 69th Place, stands next to a daycare and preschool (Books & Rattles, Inc.), the Juniper Valley Animal Hospital and also lies across the street from PS 128. NineDot Energy spokesperson Karen Alter, when contacted by The Post, said the Brooklyn-based firm had not made a “final decision on moving forward.” In a copy of emails with community officials obtained by The Post, NineDot rep Sam Brill defended the safety of such battery sites, including a NineDot battery facility in the Bronx, that for years has “safely operated” 40 feet from a public school. “FDNY wouldn’t let us build these if they weren’t safe,” Brill said. (Excerpt) Read more at nypost.com ... TOPICS: Business/Economy ; Front Page News ; Government ; Politics/Elections ; US: New York KEYWORDS: fire ; lithiumionbattery ; newyork ; toxic Click here: to donate by Credit Card Or here: to donate by PayPal Or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794 Thank you very much and God bless you. 1 posted on 04/13/2025 4:25:43 PM PDT by BenLurkin [ Post Reply | Private Reply | View Replies ] To: BenLurkin Everything that DemocRATz do is toxic. 2 posted on 04/13/2025 4:27:11 PM PDT by Da Coyote [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin It’s bad enough when a Tesla spontaneously ignites and the fire department is afraid to put it out. This thing will burn with the heat of a thousand Tesla batteries. 3 posted on 04/13/2025 4:28:46 PM PDT by E. Pluribus Unum (Democrats are the Party of anger, hate and violence.) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin MAYBE DOGE could find out all who receives KICKBACKS. 4 posted on 04/13/2025 4:30:03 PM PDT by Mark (DONATE ONCE every 3 months-is that a big deal?) [ Post Reply | Private Reply | To 1 | View Replies ] To: Mark Only the NY elite cry NIMBY and then they feel better. 5 posted on 04/13/2025 4:38:15 PM PDT by EQAndyBuzz (Proud Member of the Anti-Fancy party since March 2025) [ Post Reply | Private Reply | To 4 | View Replies ] To: BenLurkin Sorry, NYers, but you get what you vote for. 6 posted on 04/13/2025 4:44:06 PM PDT by Robwin ( ) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin Silly irrational people! Everybody knows that they are perfectly safe!! Moss Landing, CA Escondido, CA Aricell Hwaseong, South Korea 7 posted on 04/13/2025 4:49:23 PM PDT by ProtectOurFreedom (All we want is the same deportation policy that Martha's Vineyard has. That's it.) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin Cast stupid votes, win stupid prizes. 8 posted on 04/13/2025 4:52:00 PM PDT by N. Theknow (Kennedys-Can't drive, can't ski, can't fly, can't skipper a boat-But they know what's best for you.) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin; All Life is risk. They only time you can avoid all risk is when you are dead. The demonstrators are of the stupid cult which believes risk can be eliminated. 9 posted on 04/13/2025 5:08:34 PM PDT by marktwain [ Post Reply | Private Reply | To 1 | View Replies ] To: EQAndyBuzz Same gutless New Yorkers who let that filthy little puke Bloomberg push them around like little kids. 10 posted on 04/13/2025 5:15:25 PM PDT by Bonemaker (invictus maneo) [ Post Reply | Private Reply | To 5 | View Replies ] To: BenLurkin Oh, come on. We have to save the planet. If your property becomes worthless in the process, well, you took one for the team😊 11 posted on 04/13/2025 6:55:04 PM PDT by technically right [ Post Reply | Private Reply | To 1 | View Replies ] To: E. Pluribus Unum Yes, they all didn’t pay attention in Chemistry class. Lithium is right up their with nickel and potassium as a group 1 alkali metal. group 1 metals combust pretty easily. the group two lighter earth metals beryllium, magnesium and calcium burn pretty good once ignited. All need special ( and pretty nasty) chemical extinguishers to smother the flame. 12 posted on 04/13/2025 7:14:08 PM PDT by Waverunner [ Post Reply | Private Reply | To 3 | View Replies ] To: BenLurkin over fears they could spark toxic infernos in residential neighborhoods Whatever do you mean? it’s all “clean” energy. 13 posted on 04/13/2025 8:11:55 PM PDT by FoxInSocks (\"Hope is not a course of action.\" — M. O'Neal, USMC) [ Post Reply | Private Reply | To 1 | View Replies ] To: marktwain If fully discharged they represent represent little danger. But why in the hell are they there . They should be in recycling center or safely buried ⁰ 14 posted on 04/13/2025 9:00:42 PM PDT by cpdiii (cane cutter, deckhand, oilfield roughneck, drilling fluid tech, geologist, pilot, pharmacist ,MAGA) [ Post Reply | Private Reply | To 9 | View Replies ] To: BenLurkin They would feel much belter if it were in a suburb and fight to keep it there regardless of the people living there, because this is who they are, “not in my community” 15 posted on 04/14/2025 2:59:59 AM PDT by ronnie raygun [ Post Reply | Private Reply | To 1 | View Replies ] To: All “Odd”. NY(C) elite doesn’t want the ‘safe’ battery banks built right under their feet to ‘walk the (green) walk’ they talk about SOOooo much. 16 posted on 04/14/2025 5:05:20 AM PDT by i_robot73 (One could not count the number of *solutions*, if only govt followed\\enforced the Constitution.) [ Post Reply | Private Reply | To 1 | View Replies ] To: BenLurkin The leftist want green energy till it comes to their neighborhood. I would force it on them since they voted for it... 17 posted on 04/14/2025 12:57:11 PM PDT by packrat35 (Pureblood! No clot shot for me!) [ Post Reply | Private Reply | To 1 | View Replies ] Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management. All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works. Free Republic Browse · Search News/Activism Topics · Post Article FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794 FreeRepublic.com is powered by software copyright 2000-2008 John Robinson", "sentiment": "NEGATIVE", "sentiment_score": -0.8, "url": "https://freerepublic.com/focus/f-news/4310827/posts", "source": "Freerepublic.com", "published_at": "2025-04-13T23:25:43"}, {"id": 79, "title": "White House Ignores Preferred Pronouns and the Journalists Who Use Them", "content": "White House Ignores Preferred Pronouns and the Journalists Who Use Them | Vanity Fair Skip to main content Politics Business Hollywood Style Culture Royals Celebrity Video Podcasts Archive VF Shop What Is Cinema? Archive Magazine Save this story Save Save this story Save The wealthiest man in the world, Elon Musk , celebrated on his social media site X late Friday, writing that the “pronoun bs is finally going away.” “That was silly,” Musk, who heads up the Department of Government Efficiency and has been slashing crucial federal funding for months, wrote after reposting a pronoun knock-knock joke. “Thank god Trump won,” a user named TheDogeGlory replied below Musk’s post, to which he responded with a bullseye emoji. Musk’s post comes days after White House Press Secretary Karoline Leavitt said that administration officials would refrain from responding to inquiries from journalists who include their preferred pronouns in email signatures or bios. “As a matter of policy,” Leavitt wrote in an email from a reporter asking about the closure of a research observatory , “we do not respond to reporters with pronouns in their bios.” SpaceX and Tesla founder Elon Musk arrives on stage at an America PAC town hall on October 26, 2024 in Lancaster, Pennsylvania. Samuel Corum/Getty Images President Donald Trump ’s administration, in January, instructed federal employees to remove any reference to their identifying pronouns from their email signatures and other forms as a part of the broad effort to roll back any and all evidence of diversity, equity, and inclusion. Or, as a Texas state employee found out , get fired. Leavitt’s admission this week confirms that the press office is following suit. “Any reporter who chooses to put their preferred pronouns in their bio clearly does not care about biological reality or truth and therefore cannot be trusted to write an honest story,” the press secretary, who in just a few short months since Trump has taken office has gained a reputation as combative toward both individual journalists and legacy media in general, said in a separate statement to other news outlets. Axios also confirmed on Wednesday that officials will continue to skirt these reporters, asking Trump spokesperson Harrison Fields if that was now their official policy. “FACTS!” he replied. As The New York Times reported this week, “On at least three recent occasions, senior Trump press aides have refused to engage with reporters’ questions because the journalists listed identifying pronouns in their email signatures.” A spokesperson for the Times said, “Evading tough questions certainly runs counter to transparent engagement with free and independent press reporting.” “But,” they continued, “refusing to answer a straightforward request to explain the administration’s policies because of the formatting of an email signature is both a concerning and baffling choice, especially from the highest press office in the U.S. government.” White House Press Secretary Karoline Leavitt speaks during the daily briefing in the Brady Briefing Room of the White House in Washington, DC, on February 25, 2025. JIM WATSON/Getty Images In one instance, Matt Berg , a reporter at Crooked Media, the network that runs the “Pod Save America” family of podcasts, decided to experiment with the new administration’s handling of journalists who include their pronouns. Berg doesn’t usually include pronouns in his email signature. But, when he included “he/him” in an email to Katie Miller , a senior adviser at DOGE, he too was met with a response claiming that the use of pronouns is detrimental to science, that it was her policy to refuse to respond to journalists with listed pronouns, and that he was ignoring facts. “I find it baffling that they care more about pronouns than giving journalists accurate information, but here we are,” Berg said in an email to the Times . The press office has previously been harsh on reporters who do not use the language they prefer. In February, Leavitt and the administration blocked The Associated Press from covering multiple White House events because it refused to change its editorial style from “Gulf of Mexico” to “Gulf of America.” The AP sued Leavitt and two other White House officials on First Amendment grounds and won—though the White House said it would be appealing. Dozens of protesters gather in Times Square near a military recruitment center to show their anger at President Donald Trump's decision to reinstate a ban on transgender individuals from serving in the military on July 26, 2017 in New York City. Spencer Platt/Getty Images The White House’s handling of pronouns aligns with the president’s coordinated rollback of protections for transgender and nonbinary Americans and those who support them. Trump has signed several executive orders targeting transgender people. In his first moments in office, the president signed an order declaring that the United States would only recognize two sexes, “male” and “female,” as defined at conception—a move that required government agencies to use an outdated and scientifically inaccurate gender binary on documents like passports, visas, and employee records. He also signed others aimed at barring transgender student athletes from playing on girls’ sports teams, restricting funding for gender-affirming care for people under 19, and removing transgender service members from the military. Multiple of Trump’s orders against transgender people are being challenged in the courts. For Musk, this isn’t the first time he’s discussed preferred pronouns on X, formerly Twitter. In 2022, he wrote , “My pronouns are Prosecute/Fauci.” And in June of 2023, on the first day of Pride Month, Musk said he would allow users to intentionally misgender someone without consequence. He also claimed that he personally would use the pronouns that someone prefers for manners’ sake—something he has repeatedly chosen not to do with his own daughter . More Great Stories From Vanity Fair Karen Read ’s Second Murder Trial Is Already a Spectacle Usha Vance ’s “Very Lonely, Lonely World” The Watch That Links the Kennedys to Kim Kardashian—and a Real Housewife Dying for Sex : The True Story of a Cancer Patient Turned Sexual Explorer Tom Hanks Is Supportive of His Daughter’s Revealing Memoir About Her Troubled Childhood As Twin Peaks Turns 35, the Mystery Is Still the Message Did Biden’s Aides Cover Up His Mental State—or Was It Group Delusion? Gwyneth Paltrow on Fame, Raw Milk, and Why Sex Doesn’t Always Sell Meet Elon Musk’s 14 Children and Their Mothers (Whom We Know of) From the Archive: Grace Kelly's Forever Look Katie Herchenroeder Katie Herchenroeder is a contributing writer for Vanity Fair ’s the Hive. Her reporting focuses on gender inequality, violence against women, and politics. She previously worked at Mother Jones and The New Republic. Born in Indiana and raised in Arizona, Katie is now based in Brooklyn. ... Read more Politics Jessica Reed Kraus, RFK Jr. Fanblogger, Claims to Be “Official” Press. The White House Differs. The Associated Press is out, House Inhabit is in—but only sort of, a Trump administration official tells Vanity Fair . By Kase Wickman Politics Donald Trump, Mahmoud Khalil, and Free Speech Under Siege: “We’re in an Alarming Period” By using the government to crack down on immigrants, protesters, and political adversaries, the president is laying waste to the First Amendment—and he’s only just getting started. By Cristian Farias Politics What Leak? Team Trump Spins Signal Fiasco Into a “Fake-News” Hoax Mike Waltz and Pete Hegseth continue to gaslight the American public about their enormous security lapse because they know they'll never face accountability. By Eric Lutz Politics Trump Guts Voice Of America News Agency, Musk Says “Nobody Listens To Them Anymore.” Created in 1942 to counter Nazi propaganda, VOA and their sister networks reach 420 million people in 63 languages and more than 100 countries each week. By Katie Herchenroeder Politics The Education—and Anointment—of Barron Trump The towering New York University freshman has become a Manhattan curiosity and a national symbol while hardly uttering a public word. By Dan Adler Politics A Tufts Student Criticized Israel. Then the Trump Administration Disappeared Her Plainclothes agents snatched off the street a PhD student here on a legal visa—all, it seems, for co-authoring a school paper op-ed in support of Palestinians. There’s a word for governments that do that. By Eric Lutz Politics Donald Trump Is Itching for a Legal Showdown Over Deportations The administration has now twice carried out deportations in open defiance of court orders, setting up a fight between the branches of government that could have vast implications. By Eric Lutz Politics The White House’s Security Fails Just Keep Piling Up Signalgate, meet Venmogate. By Issie Lapowsky Politics The Courts Aren’t Bending to Donald Trump Just Yet The president was hit with a string of unfavorable legal rulings—and a rare rebuke from Chief Justice John Roberts—as his administration feverishly worked to challenge the judiciary’s checks on his power. By Eric Lutz Politics The Trump Administration's Big, Stupid Security Breach Cabinet members accidentally leaked highly sensitive war plans to the Atlantic's editor in chief. It would be funny if it weren't so scary. By Eric Lutz Politics Signalgate Is Not as Complicated as Team Trump Wants Us to Think We don’t need the “best technical minds” to figure this one out. By Issie Lapowsky Politics Trump Says He'd \"Love\" to Deport US Citizens to El Salvador Gulags if It's Legal But what does legal even mean to Trump? By Issie Lapowsky", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.vanityfair.com/news/story/white-house-ignores-journalists-who-use-pronouns", "source": "Vanity Fair", "published_at": "2025-04-12T18:11:53"}, {"id": 80, "title": "When Elon Musk flies on private jets, these are the things that are an absolute must for flight attendants; here’s an interesting glimpse into the preferences of the world’s richest man", "content": "NetJets cyberattack: When Elon Musk flies on private jets, these are the things that are an absolute must for flight attendants; here’s an interesting glimpse into the preferences of the world’s richest man - The Economic Times Benchmarks Nifty 22,828.55 429.4 FEATURED FUNDS ★★★ ★★ Canara Robeco ELSS Tax Saver Regular - Growth 5Y Return 21.85 % Invest Now FEATURED FUNDS ★★★ ★★ HSBC Large Cap Fund Direct-Growth 5Y Return 20.75 % Invest Now Enter search text: Business News › News › International › US News › When Elon Musk flies on private jets, these are the things that are an absolute must for flight attendants; here’s an interesting glimpse into the preferences of the world’s richest man The Economic Times daily newspaper is available online now. Read Today's Paper When Elon Musk flies on private jets, these are the things that are an absolute must for flight attendants; here’s an interesting glimpse into the preferences of the world’s richest man SECTIONS When Elon Musk flies on private jets, these are the things that are an absolute must for flight attendants; here’s an interesting glimpse into the preferences of the world’s richest man Global Desk Last Updated: Apr 12, 2025, 11:35:00 PM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis A cyberattack on NetJets, the private aviation firm owned by Berkshire Hathaway, has resulted in the leak of confidential documents revealing Elon Musk’s highly customized in-flight preferences. Agencies Confidential internal documents leaked following a cyberattack on NetJets, the private aviation firm owned by Berkshire Hathaway. They have reportedly exposed a detailed in-flight service guide tailored exclusively for Elon Musk on private jets, offering rare insight into the billionaire’s airborne lifestyle, as per a report by Bloomberg. The document, first reported by Bloomberg, provides flight attendants with precise instructions on how to cater to the personal and professional preferences of the Tesla and SpaceX CEO, reflecting the meticulous attention given to his comfort and routine while in transit. Speed, Silence and Solitude: Inside the Jet Cabin According to the hacked manual, Elon Musk prefers direct and rapid routes regardless of fuel efficiency, a somewhat paradoxical position for the head of an electric vehicle empire known for sustainability. “Mr. Musk isn’t interested in conserving fuel,” the memo states, noting that his priority is to “fly as quickly and as direct as possible.” Live Events Onboard, the environment is kept controlled to Musk’s liking: a cool cabin temperature of 65 degrees Fahrenheit, dimmed lighting, and passenger vents turned off due to his aversion to background noise. Unexpected Wi-Fi dropouts are to be avoided at all costs, and staff are advised not to offer unsolicited help with technology, as Musk considers himself “self-sufficient.” Gaming in the Sky: Musk’s Late-Night Livestreams Beyond the logistics of luxury travel, Musk has been using his time in the air to test Starlink’s airborne connectivity, streaming video games from his private jet to millions of viewers. In a recent livestream that attracted over 16 million views, Musk played for 44 minutes, occasionally commenting on topics ranging from turbulence and artificial intelligence to the upcoming season of \"Diablo IV.\" Speaking into the camera in the early hours of April 10, he reflected on personal challenges. “It’s been kind of a stressful week, frankly. But today was a good day,” Musk said, moments before resuming gameplay. These livestreams, often broadcast under his alias @cyb3rgam3r420, have become a regular feature of his travel routine, even showing glimpses of his son or spontaneous thoughts about Roman military history or Tesla’s future tech ventures. Gaming Under Scrutiny Despite the casual tone of these videos, Musk has faced criticism within the gaming community. A previous exchange with a YouTuber, NikoWrex, suggested Musk may have considered \"account boosting\" — a controversial practice where gamers pay others to improve their rankings. The allegation drew ire from gamers and even prompted snark from official game accounts. Musk, while never officially commenting on the claims, did amplify the video in question. However, critics argue that his recent “hardcore mode” failures during livestreams — including multiple in-game deaths and connection issues — cast doubt on his self-professed gaming prowess. FAQs What was leaked in the NetJets cyberattack? Internal documents from NetJets, a private aviation company owned by Berkshire Hathaway, were leaked following a cyberattack. These include a confidential service guide specifically tailored for Elon Musk, offering detailed insight into his travel preferences and routines aboard private jets. What does the guide reveal about Elon Musk’s travel preferences? Musk prefers fast, direct flights regardless of fuel efficiency. He also requires a cabin temperature of 65°F, dim lighting, and no use of passenger air vents to reduce background noise. Flight attendants are instructed not to offer tech assistance unless asked. (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on NetJets cyberattack Elon Musk private jet preferences Berkshire Hathaway aviation Starlink gaming livestream Elon Musk travel lifestyle (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on NetJets cyberattack Elon Musk private jet preferences Berkshire Hathaway aviation Starlink gaming livestream Elon Musk travel lifestyle (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Dawn of a golden age for Indian aviation? Maybe for airlines. Not really for flyers. No past precedence: Why stock valuation needs a new rulebook in the times of Trump flip-flops Delhi’s draft EV policy: End of the road for CNG autos; a green mobility script for India How February sales figures created a credibility crisis for Ola Electric Bollywood’s creative crisis: Why Hindi cinema is losing the shared experience economy battle Turning Trump tariffs into an opportunity for India 1 2 3 View all Stories Videos Trump hopeful of US-Iran talks Trump spares electronics from China tariffs SpaceX launches 21 Starlink satellites PM Modi to inaugurate Hisar’s Maharaja Agrasen Int’l Airport Trump excludes chips, phones from reciprocal tariffs 'CIA op Timber Sycamore created Syrian crisis' N Nagendran apointed as Tamil Nadu BJP Chief Massive fire at aluminum unit in Nagpur’s Umred MIDC Tahawwur Rana in 18 day NIA custody after extradition Murshidabad protest turns violent, forces deployed 1 2 3 Latest from ET From sachets to stock-ups: Small-town India changes the retail game Trump calls time-out, Apple gets a breather 60% jump: Apple India produces $22 bn of iPhones Trending US News Dow Jones futures good april fools jokes Easter 2025 date Time social security changes Crypto market today March 5 Ash Wednesday Popular in International Trump’s tariff buffer: Phones, PCs, chips spared from 'reciprocal' tariffs Pentagon to terminate $5.1 billion in IT contracts with Accenture, Deloitte, others The Chosen Season 5: When will it release online? Here’s all about release on Prime Video, The Chosen’s official app and website Mark Cuban urges Americans to hoard essentials before tariff shockwave hits; here’s what to stockpile while you still can Big cause for concern: Donald Trump's approval rating is now falling not just among Americans, but even within his own Republican Party Enter search text: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Name Reason for reporting: Foul language Slanderous Inciting hatred against a certain community Others Your Reason has been Reported to the admin. X To post this comment you must Log In/Connect with: The Economic Times or Fill in your details: Will be displayed Will not be displayed Will be displayed Share this Comment: Post to Twitter Stories you might be interested in Subscribe to our ET Investment Opportunities SUBMIT", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://economictimes.indiatimes.com/news/international/us/when-elon-musk-flies-on-private-jets-these-are-the-things-that-are-an-absolute-must-for-flight-attendants-heres-an-interesting-glimpse-into-the-preferences-of-the-worlds-richest-man/articleshow/120238862.cms", "source": "The Times of India", "published_at": "2025-04-12T18:05:17"}, {"id": 61, "title": "AI Vision Versus EV Weakness – Goldman Balances Long-Term Hopes with Near-Term Risks", "content": "AI Vision Versus EV Weakness – Goldman Balances Long-Term Hopes with Near-Term Risks Why are tariffs challenging online sellers? What sparked Elon Musk's DOGE controversy? How did tariff reversals boost US stocks? Why did a CryptoPunk whale hide profits? What worries Ray Dalio about the economy? Why are tech tariff exemptions temporary? How will trade shifts affect global suppliers? What drives Meta's antitrust trial threat? Why did British Steel seek government help? AI Vision Versus EV Weakness – Goldman Balances Long-Term Hopes with Near-Term Risks finance.yahoo.com/news/tesla-inc-tsla-ai-vision-171822988.html We recently published a list of 14 AI Stocks Catching Wall Street’s Attention. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other AI stocks catching Wall Street’s attention. In the latest development in the feud between OpenAI and Elon… This story appeared on finance.yahoo.com , 2025-04-12 17:18:22. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/5f3d8619df14d1b4", "source": "Biztoc.com", "published_at": "2025-04-12T17:31:51"}, {"id": 1, "title": "Tesla, Inc. (TSLA): AI Vision Versus EV Weakness – Goldman Balances Long-Term Hopes with Near-Term Risks", "content": "Tesla, Inc. (TSLA): AI Vision Versus EV Weakness – Goldman Balances Long-Term Hopes with Near-Term Risks Oops, something went wrong Unlock stock picks and a broker-level newsfeed that powers Wall Street. Upgrade Now Tesla, Inc. (TSLA): AI Vision Versus EV Weakness – Goldman Balances Long-Term Hopes with Near-Term Risks Ghazal Ahmed Sat, Apr 12, 2025, 10:18 AM 4 min read In This Article: TSLA -0.06% We recently published a list of 14 AI Stocks Catching Wall Street’s Attention . In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other AI stocks catching Wall Street’s attention. In the latest development in the feud between OpenAI and Elon Musk, the ChatGPT maker has countersued billionaire Musk, citing a pattern of harassment. The company also asked a federal judge to stop Musk from any “further unlawful and unfair action” against OpenAI in a court case over the company’s future structure that has fueled the AI revolution. OpenAI claims that Musk has tried “nonstop” to slow down its business for his benefit, accusing him of using “bad-faith tactics” against it to help him control AI technology. Musk has been actively seeking to stop OpenAI from transitioning to a “for-profit” company, claiming that the transition will be a bad idea, which prioritizes commercial interests and compromises its mission of benefiting humanity. OpenAI, however, denies these allegations. The company must complete its transition by the end of the year if it seeks to secure the entire $40 billion of its current fundraising round. If the transition fails to complete by year-end, the funding will likely be reduced to US$20 billion. READ NOW: 10 AI Stocks to Watch Now and 9 Trending AI Stocks Making Headlines Today “Through press attacks, malicious campaigns broadcast to Musk’s more than 200 million followers on the social media platform he controls, a pretextual demand for corporate records, harassing legal claims, and a sham bid for OpenAI’s assets, Musk has tried every tool available to harm OpenAI,” In response, Musk’s legal team has referred to a $97.4 billion unsolicited takeover bid from a Musk-led consortium. This bid was rejected by OpenAI. “Had OpenAI’s Board genuinely considered the bid as they were obligated to do they would have seen how serious it was. It’s telling that having to pay fair market value for OpenAI’s assets allegedly ‘interferes’ with their business plans.” For this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024. Story Continues Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points ( see more details here ). Tesla, Inc. (TSLA): AI Vision Versus EV Weakness - Goldman Balances Long-Term Hopes with Near-Term Risks Tesla, Inc. (NASDAQ: TSLA ) Number of Hedge Fund Holders: 126 Tesla, Inc. (NASDAQ:TSLA) is an automotive and clean energy company that leverages advanced artificial intelligence in its autonomous driving technology and robotics initiatives. On April 10, Goldman Sachs reiterated the stock as “Neutral” and cut its price target on the stock to $260 per share from $275. “For Tesla , we believe that weaker auto demand/consumer sentiment, tariff costs (including in Energy), and US EV policy risk are offset by longer-term potential from its AI related efforts;” Overall, TSLA ranks 8th on our list of AI stocks catching Wall Street’s attention. While we acknowledge the potential of TSLA as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than TSLA but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock . READ NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires . Disclosure: None. This article is originally published at Insider Monkey . View Comments Terms and Privacy Policy Your Privacy Choices CA Privacy Notice More Info US Europe Asia Rates Commodities Currencies Cryptocurrencies S&P 500 5,363.36 +95.31 (+1.81%) Dow 30 40,212.71 +619.01 (+1.56%) Nasdaq 16,724.46 +337.15 (+2.06%) Russell 2000 1,860.20 +28.81 (+1.57%) Crude Oil 61.48 +1.41 (+2.35%) Gold 3,254.90 +77.40 (+2.44%) My portfolios Sign in to access your portfolio Sign in RXRX Recursion Pharmaceuticals, Inc. 5.76 +1.25 (+27.72%) CERT Certara, Inc. 12.91 +2.40 (+22.84%) ZLAB Zai Lab Limited 29.54 +5.22 (+21.46%) SMMT Summit Therapeutics Inc. 23.24 +3.09 (+15.33%) CRSP CRISPR Therapeutics AG 39.30 +5.04 (+14.71%) MLGO MicroAlgo Inc. 14.01 -1.90 (-11.94%) OPCH Option Care Health, Inc. 31.55 -2.14 (-6.35%) SAIA Saia, Inc. 330.37 -21.08 (-6.00%) LITE Lumentum Holdings Inc. 51.27 -3.20 (-5.87%) TXN Texas Instruments Incorporated 147.60 -9.00 (-5.75%) NVDA NVIDIA Corporation 110.93 +3.36 (+3.12%) LCID Lucid Group, Inc. 2.5000 -0.0200 (-0.79%) F Ford Motor Company 9.33 +0.19 (+2.08%) TSLA Tesla, Inc. 252.24 -0.16 (-0.06%) INTC Intel Corporation 19.74 -0.14 (-0.70%) HUT Hut 8 Corp. 12.16 +0.43 (+3.67%) NFLX Netflix, Inc. 918.29 -2.88 (-0.31%) TTD The Trade Desk, Inc. 49.78 +0.51 (+1.04%) BTC=F Bitcoin Futures,Apr-2025 84,055.00 +4,360.00 (+5.47%) ^N225 Nikkei 225 33,585.58 -1,023.42 (-2.96%) Terms and Privacy Policy Your Privacy Choices CA Privacy Notice Ad Terms Feedback More Info", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://finance.yahoo.com/news/tesla-inc-tsla-ai-vision-171822988.html", "source": "Yahoo Entertainment", "published_at": "2025-04-12T17:18:22"}, {"id": 2, "title": "Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns", "content": "Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Home Breaking News Hacking Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Pierluigi Paganini April 12, 2025 Fortinet warns attackers can keep read-only access to FortiGate devices even after the original vulnerability is patched. Fortinet warns that threat actors can retain read-only access to FortiGate devices even after the original vulnerability used for the breach has been patched. The cybersecurity firm revealed that attackers exploited known FortiGate flaws like CVE-2022-42475 , CVE-2023-27997 , and CVE-2024-21762 to gain persistent read-only access via a symlink in SSL-VPN language folders. “A threat actor used a known vulnerability to implement read-only access to vulnerable FortiGate devices. This was achieved via creating a symbolic link connecting the user filesystem and the root filesystem in a folder used to serve language files for the SSL-VPN. This modification took place in the user filesystem and avoided detection.” reads the advisory published by Fortinet. “Therefore, even if the customer device was updated with FortiOS versions that addressed the original vulnerabilities, this symbolic link may have been left behind, allowing the threat actor to maintain read-only access to files on the device’s file system, which may include configurations.” Fortinet pointed out that only devices with SSL-VPN enabled are impacted. The company added that scans show the attacks weren’t limited to any specific region or industry. Fortinet mitigated the attack by deploying AV/IPS signatures, updating releases to block the symbolic link, and urging customers to patch devices while maintaining transparency. The company did not link the attacks to a certain threat actor, however, the investigation is still ongoing. Below are the FortiOS mitigations released by the company: FortiOS 7.6.2, 7.4.7, 7.2.11 & 7.0.17, 6.4.16: The SSL-VPN UI has been modified to prevent the serving of such malicious symbolic links. FortiOS 7.4, 7.2, 7.0, 6.4: The symbolic link was flagged as malicious by the AV/IPS engine so that it would be automatically removed if the engine was licensed and enabled. FortiOS 7.6.2, 7.4.7, 7.2.11 & 7.0.17, 6.4.16: Upgrading to this release will remove the malicious symbolic link. The cybersecurity vendor notified impacted customers and provided the following mitigations: Treat all configuration as potentially compromised and follow the recommended steps below to recover: Upgrade all devices to 7.6.2, 7.4.7, 7.2.11 & 7.0.17 or 6.4.16. Review the configuration of all devices. Follow me on Twitter: @securityaffairs and Facebook and Mastodon Pierluigi Paganini ( SecurityAffairs – hacking, FortiOS) facebook linkedin twitter Fortinet FortiOS Hacking hacking news information security news IT Information Security Pierluigi Paganini Security Affairs Security News you might also like Pierluigi Paganini April 13, 2025 SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41 Read more Pierluigi Paganini April 13, 2025 Security Affairs newsletter Round 519 by Pierluigi Paganini – INTERNATIONAL EDITION Read more leave a comment newsletter Subscribe to my email list and stay up-to-date! recent articles SECURITY AFFAIRS MALWARE NEWSLETTER ROUND 41 Malware / April 13, 2025 Security Affairs newsletter Round 519 by Pierluigi Paganini – INTERNATIONAL EDITION Breaking News / April 13, 2025 China admitted its role in Volt Typhoon cyberattacks on U.S. infrastructure APT / April 13, 2025 Symbolic Link trick lets attackers bypass FortiGate patches, Fortinet warns Hacking / April 12, 2025 Attackers are exploiting recently disclosed OttoKit WordPress plugin flaw Security / April 12, 2025 We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT", "sentiment": "NEGATIVE", "sentiment_score": -0.8, "url": "https://securityaffairs.com/176473/hacking/symbolic-link-trick-lets-attackers-bypass-fortigate-patches-fortinet-warns.html", "source": "Securityaffairs.com", "published_at": "2025-04-12T17:17:30"}, {"id": 3, "title": "Trump administration says it will exclude some electronics from reciprocal tariffs", "content": "Trump's commerce secretary says new electronics tariff exemptions are temporary, chip tariffs coming Close Business Mae Anderson Associated Press Published: April 12, 2025 at 9:38 AM Updated: April 13, 2025 at 1:03 PM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS FILE - A police vehicle flashes its lights in Philadelphia, Monday, Jan. 17, 2022. (AP Photo/Matt Rourke, File) 2 hours ago Man arrested, accused of running female over with vehicle, San Antonio police say Read full article: Man arrested, accused of running female over with vehicle, San Antonio police say A pedestrian was hit and killed while walking on Loop 410, according to San Antonio police. 3 hours ago Pedestrian hit, killed while walking on Loop 410, SAPD says Read full article: Pedestrian hit, killed while walking on Loop 410, SAPD says Three people were hospitalized after a shooting on the Southwest Side, according to San Antonio police. 3 hours ago 3 hospitalized after shooting on Southwest Side, SAPD says Read full article: 3 hospitalized after shooting on Southwest Side, SAPD says As April’s full moon rose on Saturday night, several KSAT viewers shared photos of a “mysterious ring” and a “flying object” in the sky. 1 hour ago KSAT viewers share sightings of ‘mysterious ring’ illuminating sky during the pink moon Read full article: KSAT viewers share sightings of ‘mysterious ring’ illuminating sky during the pink moon KSAT DEALS Jump for joy - deals are here! SA Live deals this week: Stack up the savings Read full article: SA Live deals this week: Stack up the savings Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Business Trump's commerce secretary says new electronics tariff exemptions are temporary, chip tariffs coming Mae Anderson Associated Press Published: April 12, 2025 at 9:38 AM Updated: April 13, 2025 at 1:03 PM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Tariff exemptions announced Friday on electronics like smartphones and laptops are only a temporary reprieve until the Trump administration develops a new tariff approach specific to the semiconductor industry, U.S. Commerce Secretary Howard Lutnick said Sunday. “They’re exempt from the reciprocal tariffs but they’re included in the semiconductor tariffs, which are coming in probably a month or two,” Lutnick told ABC's “This Week” on Sunday. Recommended Videos The Trump administration late Friday said it would exclude electronics from reciprocal tariffs , a move that could help keep the prices down for popular consumer devices that aren’t usually made in the U.S. The move was expected to benefit big tech companies like Apple and Samsung and chip makers like Nvidia, though the uncertainty of future tariffs may rein in an expected tech stock rally on Monday. U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in its massive plan to put tariffs in place on goods from most countries. Lutnick's comments Sunday made clear that more changes were on the way, including a policy specific to the computer chip industry. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, it would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broadly. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. When Trump paused the tariffs outside of China on Wednesday, the lost value in those companies was pared to $644 billion, or a 4% decline. The electronics exemption is the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move removes “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. Ives amended that note after Lutnick's comments Sunday, saying the confusing news out of the White House “is dizzying for the industry and investors and creating massive uncertainty and chaos for companies trying to plan their supply chain, inventory, and demand.” In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. She said the administration has secured U.S. investments from tech companies — including Apple, TSMC and Nvidia — who are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment over the weekend. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Loading... Recommended Videos KSAT DEALS Jump for joy - deals are here! SA Live deals this week: Stack up the savings Read full article: SA Live deals this week: Stack up the savings Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.ksat.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "KSAT San Antonio", "published_at": "2025-04-12T17:15:39"}, {"id": 4, "title": "Trump’s New Tariff Exclusions Will Benefit Tesla. Here’s How", "content": "Trump’s New Tariff Exclusions Will Benefit Tesla. Here’s How Why are tariffs challenging online sellers? What sparked Elon Musk's DOGE controversy? How did tariff reversals boost US stocks? Why did a CryptoPunk whale hide profits? What worries Ray Dalio about the economy? Why are tech tariff exemptions temporary? How will trade shifts affect global suppliers? What drives Meta's antitrust trial threat? Why did British Steel seek government help? Trump’s New Tariff Exclusions Will Benefit Tesla. Here’s How barrons.com/articles/tesla-tariff-exclusions-exemptions-trump-e95f05c1 This story appeared on barrons.com , 2025-04-12 17:01:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/cc36bc763496d6a8", "source": "Biztoc.com", "published_at": "2025-04-12T17:09:13"}, {"id": 5, "title": "Trump administration says it will exclude some electronics from reciprocal tariffs", "content": "Trump's commerce secretary says new electronics tariff exemptions are temporary, chip tariffs coming Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS The \"worm\" logo is on the left, the classic \"meatball\" logo is on the right. 1 hour ago Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge Read full article: Jacksonville University only school with 2 finalist teams in NASA’s 2025 Human Lander Challenge JSO generic night 4 hours ago Teenage motorcyclist killed in crash on Gate Parkway Read full article: Teenage motorcyclist killed in crash on Gate Parkway . 6 hours ago A cool start, leading into a gorgeous day! Read full article: A cool start, leading into a gorgeous day! News4Jax shines at Florida News Awards 14 hours ago News4JAX shines at Florida News Awards Read full article: News4JAX shines at Florida News Awards DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Business Trump's commerce secretary says new electronics tariff exemptions are temporary, chip tariffs coming Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Tariff exemptions announced Friday on electronics like smartphones and laptops are only a temporary reprieve until the Trump administration develops a new tariff approach specific to the semiconductor industry, U.S. Commerce Secretary Howard Lutnick said Sunday. “They’re exempt from the reciprocal tariffs but they’re included in the semiconductor tariffs, which are coming in probably a month or two,” Lutnick told ABC's “This Week” on Sunday. Recommended Videos The Trump administration late Friday said it would exclude electronics from reciprocal tariffs , a move that could help keep the prices down for popular consumer devices that aren’t usually made in the U.S. The move was expected to benefit big tech companies like Apple and Samsung and chip makers like Nvidia, though the uncertainty of future tariffs may rein in an expected tech stock rally on Monday. U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in its massive plan to put tariffs in place on goods from most countries. Lutnick's comments Sunday made clear that more changes were on the way, including a policy specific to the computer chip industry. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, it would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broadly. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. When Trump paused the tariffs outside of China on Wednesday, the lost value in those companies was pared to $644 billion, or a 4% decline. The electronics exemption is the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move removes “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. Ives amended that note after Lutnick's comments Sunday, saying the confusing news out of the White House “is dizzying for the industry and investors and creating massive uncertainty and chaos for companies trying to plan their supply chain, inventory, and demand.” In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. She said the administration has secured U.S. investments from tech companies — including Apple, TSMC and Nvidia — who are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment over the weekend. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos DEALS 4 JAX Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.news4jax.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WJXT News4JAX", "published_at": "2025-04-12T17:00:42"}, {"id": 6, "title": "Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded", "content": "Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded - The Economic Times Benchmarks Nifty 22,828.55 429.4 FEATURED FUNDS ★★★ ★★ Canara Robeco ELSS Tax Saver Regular - Growth 5Y Return 21.85 % Invest Now FEATURED FUNDS ★★★ ★★ HSBC Large Cap Fund Direct-Growth 5Y Return 20.75 % Invest Now Enter search text: Business News › News › International › US News › Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded The Economic Times daily newspaper is available online now. Read Today's Paper Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded SECTIONS Poll shocker for Elon Musk: Nate Silver's popularity tracker shows his approval rating plummets by 14 points; here's how the Tesla CEO responded Global Desk Last Updated: Apr 12, 2025, 10:06:00 PM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis Nate Silver is back with his latest tracker which has claimed that billionaire adviser to US President Donald Trump, Elon Musk, has not so favourable view from Americans. Elon Musk. Elon Musk has been steadily losing popularity among Americans, according to claims made by pollster Nate Silver in his latest tracker. However, Silver's assessment has drawn sharp retort from Tesla CEO Musk who blasted the ratings as \"political propaganda war\". \"We just launched an Elon Musk popularity tracker to accompany our Trump approval tracker. Currently, he's at a −14 as compared with Trump's −5,\" Silver posted on Musk-owned X (formerly Twitter). Replying to Silver's tweet, Musk wrote, \"The inevitable outcome of having a political propaganda war waged against me while I have almost no countervailing campaign and, at times, digging my own grave way better than my enemies do.\" Silver \"Do Americans have a favorable or unfavorable view of Elon Musk\" tracker shows statistics from January 1, 2024 till April 1, 2025. The timeline comprises Musk's endorsement for then Republican Presidential nominee Donald Trump, US President elections, and Donald Trump's inauguration and subsequent decisions that Trump administration has taken. Earlier on Thursday, two U.S. House of Representatives lawmakers on Thursday asked the Transportation Department's top ethics official to detail how the agency is addressing Elon Musk's potential conflicts of interest given ongoing investigations of SpaceX and Tesla, companies run by the close ally of President Donald Trump. Live Events Meanwhile, Ireland's data privacy watchdog said on Friday it's investigating Elon Musk's social media platform X over its use of personal data to train his artificial intelligence chatbot Grok. The Data Protection Commission said it has opened an inquiry into \"the processing of personal data comprised in publicly-accessible posts\" that European users posted on X. FAQs Q1. Who is Tesla CEO? A1. Tesla CEO is Elon Musk. Q2. Who is President of USA? A2. President of USA is Donald Trump. (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Elon Musk Elon Musk news Elon Musk latest news Tesla Tesla news (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on Elon Musk Elon Musk news Elon Musk latest news Tesla Tesla news (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Amtek’s Arvind Dham goes hospital hopping but ED gives a hot chase Delhivery-Ecom Express deal: A Big win for Delhivery but could Ecom Express have a longer runway? Why every large IT deal is going back to the drawing board Model Context Protocol: The secret handshake changing how businesses talk to AI The party’s over; what next? Why investors must keep in mind Marks’ ‘Pendulum Psychology’ of markets 1 2 3 View all Stories Videos N Nagendran apointed as Tamil Nadu BJP Chief Massive fire at aluminum unit in Nagpur’s Umred MIDC Tahawwur Rana in 18 day NIA custody after extradition Murshidabad protest turns violent, forces deployed President Trump optimistic about China trade talks Columbia student Mahmoud Khalil can be deported, US judge rules Trump says physical examination ‘went well' Gurugram storm horror: Pole falls on moving car Explosion near Hellenic train HQ in Athens, no injuries Trump discusses tariffs, Iran & health on Air Force One 1 2 3 Latest from ET Tariffs can boost manufacturing, but are India's factories ready? Trump spares phones, PCs, chips from reciprocal tariffs IPL | Sunrisers Hyderabad vs Punjab Kings Trending US News Dow Jones futures good april fools jokes Easter 2025 date Time social security changes Crypto market today March 5 Ash Wednesday Enter search text: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Name Reason for reporting: Foul language Slanderous Inciting hatred against a certain community Others Your Reason has been Reported to the admin. X To post this comment you must Log In/Connect with: The Economic Times or Fill in your details: Will be displayed Will not be displayed Will be displayed Share this Comment: Post to Twitter Stories you might be interested in Subscribe to our ET Investment Opportunities SUBMIT", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://economictimes.indiatimes.com/news/international/us/poll-shocker-for-elon-musk-nate-silvers-popularity-tracker-shows-his-approval-rating-plummets-by-14-points-heres-how-the-tesla-ceo-responded/articleshow/120237669.cms", "source": "The Times of India", "published_at": "2025-04-12T16:36:42"}, {"id": 7, "title": "Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect", "content": "tesla stock crash warning: Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect - The Economic Times Benchmarks Nifty 22,828.55 429.4 FEATURED FUNDS ★★★ ★★ Canara Robeco ELSS Tax Saver Regular - Growth 5Y Return 21.85 % Invest Now FEATURED FUNDS ★★★ ★★ HSBC Large Cap Fund Direct-Growth 5Y Return 20.75 % Invest Now Enter search text: Business News › News › International › US News › Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect The Economic Times daily newspaper is available online now. Read Today's Paper Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect SECTIONS Swedish hedge fund billionaire Christer Gardell issues stark Tesla warning, predicts massive valuation crash could hit sooner than investors expect Global Desk Last Updated: Apr 12, 2025, 10:06:00 PM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis Tesla stock crash warning is making headlines after Swedish billionaire Christer Gardell predicted a shocking 95% drop could hit the company. In a bold interview with EFN, Gardell called Tesla’s valuation “incomprehensible” and pointed to slowing sales, Elon Musk’s political drama, and Cybertruck struggles as red flags. While Tesla leads in EV innovation, Gardell warns the bubble could soon burst. Swedish billionaire Christer Gardell warns Tesla stock may crash 95%. He says the valuation is unrealistic and linked to Elon Musk’s controversies, falling sales, and Cybertruck struggles Swedish billionaire and hedge fund manager Christer Gardell has issued a stark warning that’s now catching the attention of Tesla investors worldwide. According to Gardell, Tesla’s market valuation is “incomprehensible” and could plummet by up to 95% — and possibly sooner than many might expect. In a recent interview with Swedish finance channel EFN, Gardell didn’t hold back. He pointed to a mix of slowing sales, rising controversy around CEO Elon Musk, and what he sees as wildly overinflated stock value. Why is Christer Gardell calling Tesla’s valuation a ticking time bomb? Tesla's current market value sits in the hundreds of billions of dollars. But Gardell, who runs activist hedge fund Cevian Capital, says that figure doesn’t align with Tesla’s core business. “Tesla, especially now with the whole Musk circus going on everywhere, is probably the most expensive stock on the global stock exchanges right now,” Gardell said in the EFN interview, as reported by Teslarati . “It could go down 95% – and maybe it should go down 95%.” He clarified that it’s hard to predict an exact timeline — “It could happen in a month, six months, a year, three years, or five years,” he said. But in his eyes, a drop is coming. And when it hits, it could be steep. Live Events What’s driving fears of a Tesla stock crash? Tesla has moved beyond just being an electric carmaker. The company now deals in robotics and AI, which are both major growth areas. But Gardell emphasized that, at its core, Tesla is still an automaker — and compared to its peers, its stock is way out of proportion. According to Companies Market Cap , Tesla’s valuation is more than triple that of major auto giants like Toyota and Volkswagen. Yet, Tesla’s recent sales trends are not keeping up. Sales have dipped in key markets, and the controversial public presence of Elon Musk hasn’t helped. As political tensions around Musk grow — especially in the U.S. — some analysts worry that Tesla’s reputation could be taking a long-term hit. That’s not just bad PR; it could mean real consequences for investor confidence. On top of that, Tesla’s highly anticipated Cybertruck is underperforming. While Musk once projected annual sales of 500,000 units, current figures suggest it’s not even hitting 10% of that. To move the product, Tesla has been forced to adjust financing options and offer more attractive interest rates to buyers. Could a Tesla crash ripple through the EV market? Despite Tesla's struggles, the broader EV market continues to thrive. In fact, Q4 2024 saw a new record for EV sales in the U.S., according to Cox Automotive . People are still switching to electric vehicles in large numbers, attracted by long-term savings and environmental benefits. But here’s the concern: If Tesla's valuation tanks, will it scare investors away from other EV companies too? It's a real risk. Gardell's worry is that an overvalued company like Tesla might damage broader investor trust in green tech if it falls too hard and too fast. Still, it's not all bad news for EV buyers. As Tesla trims prices and tweaks financing to maintain demand, competitors may follow suit. That could lead to better deals for consumers, not just from Tesla but across the EV landscape. Should investors start looking beyond U.S. tech stocks? Gardell believes the stock market imbalance between the U.S. and Europe is reaching historic levels. “The difference between American stocks and European stocks has never been greater,” he told EFN. For cautious investors, this may be a moment to reconsider their strategy. European equities, in his view, are offering more realistic valuations. And with companies in Europe also expanding into the EV and clean energy space, there may be opportunities to invest in future-forward industries without the same bubble risk. FAQs: Why did Christer Gardell warn about a Tesla stock crash ? He said Tesla’s value is too high and could drop by 95%. How could Tesla’s stock affect the electric vehicle market? A crash could shake investor trust in EV companies. (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on tesla stock crash warning christer gardell tesla prediction tesla valuation too high elon musk stock impact tesla cybertruck low sales tesla ev market risk tesla stock investor alert Tesla stock crash Christer Gardell EV sales trends (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less (You can now subscribe to our Economic Times WhatsApp channel ) Read More News on tesla stock crash warning christer gardell tesla prediction tesla valuation too high elon musk stock impact tesla cybertruck low sales tesla ev market risk tesla stock investor alert Tesla stock crash Christer Gardell EV sales trends (Catch all the US News , UK News , Canada News , International Breaking News Events, and Latest News Updates on The Economic Times.) Download The Economic Times News App to get Daily International News Updates. ... more less Prime Exclusives Investment Ideas Stock Report Plus ePaper Wealth Edition Amtek’s Arvind Dham goes hospital hopping but ED gives a hot chase Delhivery-Ecom Express deal: A Big win for Delhivery but could Ecom Express have a longer runway? Why every large IT deal is going back to the drawing board Model Context Protocol: The secret handshake changing how businesses talk to AI The party’s over; what next? Why investors must keep in mind Marks’ ‘Pendulum Psychology’ of markets 1 2 3 View all Stories Videos N Nagendran apointed as Tamil Nadu BJP Chief Massive fire at aluminum unit in Nagpur’s Umred MIDC Tahawwur Rana in 18 day NIA custody after extradition Murshidabad protest turns violent, forces deployed President Trump optimistic about China trade talks Columbia student Mahmoud Khalil can be deported, US judge rules Trump says physical examination ‘went well' Gurugram storm horror: Pole falls on moving car Explosion near Hellenic train HQ in Athens, no injuries Trump discusses tariffs, Iran & health on Air Force One 1 2 3 Latest from ET Tariffs can boost manufacturing, but are India's factories ready? Trump spares phones, PCs, chips from reciprocal tariffs IPL | Sunrisers Hyderabad vs Punjab Kings Trending US News Dow Jones futures good april fools jokes Easter 2025 date Time social security changes Crypto market today March 5 Ash Wednesday Popular in International Pentagon to terminate $5.1 billion in IT contracts with Accenture, Deloitte, others The Chosen Season 5: When will it release online? Here’s all about release on Prime Video, The Chosen’s official app and website Trump’s tariff buffer: Phones, PCs, chips spared from 'reciprocal' tariffs Mark Cuban urges Americans to hoard essentials before tariff shockwave hits; here’s what to stockpile while you still can Who was Agustín Escobar, the Siemens CEO who died in the Hudson River helicopter crash? Enter search text: Find this comment offensive? Choose your reason below and click on the Report button. This will alert our moderators to take action Name Reason for reporting: Foul language Slanderous Inciting hatred against a certain community Others Your Reason has been Reported to the admin. X To post this comment you must Log In/Connect with: The Economic Times or Fill in your details: Will be displayed Will not be displayed Will be displayed Share this Comment: Post to Twitter Stories you might be interested in Subscribe to our ET Investment Opportunities SUBMIT", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://economictimes.indiatimes.com/news/international/us/swedish-hedge-fund-billionaire-christer-gardell-issues-stark-tesla-warning-predicts-massive-valuation-crash-could-hit-sooner-than-investors-expect/articleshow/120236968.cms", "source": "The Times of India", "published_at": "2025-04-12T16:36:00"}, {"id": 8, "title": "These Georgia billionaires are some of the richest people in the world, according to Forbes", "content": "These Georgia billionaires are some of the richest people in the world, according to Forbes – WSB-TV Channel 2 - Atlanta Local These Georgia billionaires are some of the richest people in the world, according to Forbes By WSBTV.com News Staff April 12, 2025 at 12:29 pm EDT Expand Arthur Blank (L) and Dan Cathy (R) By WSBTV.com News Staff April 12, 2025 at 12:29 pm EDT ATLANTA — From sports teams to fast food to hardware, the Peach State is home to some folks with pretty deep pockets. And while many of us might not quite be billionaires just yet, a handful of Georgians already are. Forbes released its annual list of the world’s richest people earlier this week, with a total net worth between them all of $16.1 trillion. The richest man in the world saw his worth skyrocket in the last year. Tesla and SpaceX founder Elon Musk currently has a net worth of $342 billion, according to Forbes. Last year, he had a total of $195 billion, their data lists. [DOWNLOAD: Free WSB-TV News app for alerts as news breaks ] But the richest Georgians are the children of Atlanta-based Chick-fil-A founder Truett Cathy, who died in 2014. Bubba and Dan Cathy now run the fast food powerhouse together. The brothers and their sister, Trudy Cathy White, each have a net worth of $11.4 billion, which is slightly higher than last year’s $11.2 billion. Metro Atlanta-based Home Depot co-founder Arthur Blank has a current net worth of $9 billion, according to Forbes. Blank also owns the Atlanta Falcons and opened Children’s Healthcare of Atlanta - Arthur M. Blank Hospital in September . His fellow Home Depot co-founder, Bernie Marcus, passed away in November . TRENDING STORIES: Shooting suspect arrested after being hit by car outside Magic City 14-year-old boy shot, killed while standing outside his GA home Victims, suspect identified in Walmart employee shootings that left 2 dead, 1 injured Next on the list is Gary Rollins and his family, with an estimated worth of $6.9 billion. He ran Georgia-based pest control company Rollins, Inc. with his brother, Randall, who died in 2020. Rollins, Inc. is the biggest pest control company by revenue in North America, according to Forbes. Jim Kennedy is the chairman emeritus of media and automotive company Cox Enterprises. He inherited his stake in the Cox Family-owned business based in Atlanta from his mother when she died in 2007. Kennedy’s current net worth is $6.6 billion. [SIGN UP: WSB-TV Daily Headlines Newsletter ] Ben Chestnut founded the company that would become Mailchimp in Atlanta in 2001 as a side project. The Augusta native has a net worth of $5 billion. The final Georgian billionaire is the founder of Spanx, Sara Blakely. The Atlanta-based shapewear company has led Blakely to a $1.1 billion net worth. ©2025 Cox Media Group 0 View Comments Most Read Walton County deputy dies in off-duty traffic accident 2-year-old dies after being shot in the head in southeast Atlanta neighborhood, police say Cherokee Co. man sentenced to years in prison for molesting 8-year-old girl over several months 73-year-old GA woman wanted for identity fraud Family tries to report 19-year-old missing, finds him shot to death in abandoned apartment", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.wsbtv.com/news/local/these-georgia-billionaires-are-some-richest-people-world-according-forbes/6MN3C4NX75DDZE65NFG5FYO3RA/", "source": "WSB Atlanta", "published_at": "2025-04-12T16:35:44"}, {"id": 9, "title": "Everything we know about Elon Musk’s Tesla Roadster travelling through space at 16,000 mph", "content": "Everything we know about Elon Musk's Tesla Roadster travelling through space at 11,000 mph - Science - LADbible To make sure you never miss out on your favourite NEW stories , we're happy to send you some reminders Click ' OK ' then ' Allow ' to enable notifications Not now OK Featured Image Credit: Tesla Topics: Elon Musk , SpaceX , Space James Moorhouse James is a NCTJ Gold Standard journalist covering a wide range of topics and news stories for LADbible. After two years in football writing, James switched to covering news with Newsquest in Cumbria, before joining the LAD team in 2025. In his spare time, James is a long-suffering Rochdale fan and loves reading, running and music. Contact him via [email protected] X @ JimmyMoorhouse Advert Advert Advert Love him or hate him, Elon Musk has been part of some pretty wild projects over the years. Having one of his own cars up in space is perhaps one of the most random. While the Space X founder has lost plenty on Tesla stock in recent months, with Donald Trump 's tariffs only leaving more holes in his pocket , he remains the world's richest man and probably doesn't blink twice when a couple of million evaporates from his bank account. The businessman has taken on more of a political role since Trump's return to the Oval Office. This has hardly done much for the 53-year-old's controversial image, and it seems as though the South African's best work has been beyond Earth's orbit, given the success of various space projects over the years. Running a space company and a car business simultaneously, if you've got a mind like Musk, it's likely you'd put two and two together and send a Tesla up to the stars - and that's exactly what he did in 2018. Advert The Tesla Roadster was ejected into space as a dummy payload for a Falcon Heavy test flight. It's fitted with a mannequin in a space suit called Starman - a tongue-in-cheek nod to the David Bowie classic. The Bowie song Space Oddity was also set up to play on repeat through the vehicle's sound system. The SpaceX team also chucked a Hot Wheels car and a copy of The Hitchhiker's Guide to the Galaxy inside for good measure. Elon Musk (Graeme Sloan for The Washington Post via Getty Images) Musk previously revealed exactly why he sent the Tesla Roadster skyward, saying that he hoped that humanity would end up living on other planets and that his 'descendants will be able to drag it [the car] back to a museum'. The chances of that may seem pretty low, but the more kids Musk has, the more those chances improve. Musk has also said that he wanted to put the 'silliest' thing he and his SpaceX team could think of out of Earth's orbit, and apparently they settled on a car. Gosh, Elon, your imagination knows no bounds! Anyway, after seven years in space travelling at speeds well above 10,000 mph, you might think that it's tricky to keep track of the Roadster, but fortunately, like nearly everything these days, there's a website for that. Advert The ‘Where is Roadster?’ site keeps track of the Tesla as it zooms through space. At the time of writing, it is currently 228,647,460 miles from Earth. However, it's travelling back towards its home planet at the lightning-fast speed of 16,106 mph. A real space oddity... (SpaceX via Getty Images) That means that its speed has increased by 5,000 mph in the last week alone. Maybe it's homesick and wants to get back in time for Christmas, learning an important lesson from the NASA astronauts who end up spending far too long away from Earth. So what happens when the space car does finally come back home? Well, Musk could land himself in real trouble if the Tesla does crash land back to Earth. As long as it steers clear of any humans or man-made objects and doesn't cause any damage, it seems as if the billionaire will get away with it. Hopefully it avoids the likes of Mount Kilimanjaro and Niagara Falls, too. Elon Musk says it'll soon be 'possible' to travel from London to New York in just 30 minutes at mind-blowing speeds Elon Musk hit back at hacking group Anonymous after they issued warning about his plans for Twitter Reason why humans haven't orbited poles of Earth before as SpaceX crew make history NASA astronaut makes comment to Elon Musk and Donald Trump in first interview since returning from space Choose your content: 20 mins ago an hour ago 2 hours ago 20 mins ago Elon Musk mocked after people spot ‘top secret’ message written on his notepad in Trump cabinet meeting The Tesla tycoon seemed to be on the wind up News an hour ago Body language experts analysed how Donald Trump ‘really felt’ about Vladimir Putin in first ever meeting The leaders first met in Germany in 2017 News 2 hours ago Long-term health impacts of taking ketamine after two women left with serious bladder problems Experts warn ketamine can cause 'irreversible psychological impairment' as well as horrific effects on your physical health News 2 hours ago Man killed in major explosion which destroyed house A major incident was declared in Worksop last night News breaking", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.ladbible.com/news/science/elon-musk-space-science-tesla-latest-roadster-942872-20250411", "source": "LADbible", "published_at": "2025-04-12T16:34:53"}, {"id": 10, "title": "Today's news and jokes", "content": "Super Punch: Today's news and jokes Saturday, April 12, 2025 Today's news and jokes throwback to 6th grade https://t.co/fjwRETFt5q pic.twitter.com/5e2bPwe13n — Sam Alberti (@sam_alberti) March 8, 2025 Mass Games Womp-womp, they DOGE'd the tariffs. www.cnbc.com/2025/04/11/c... [image or embed] — David Dayen ( @ddayen.bsky.social ) April 11, 2025 at 10:52 AM Hours ago, @politico.com revealed that DOGE is working with DHS on automating mass deportation efforts — likely explaining why many US citizens, green card holders, and even a Canadian (in Canada) got threatening emails last night terminating “your parole” and telling them to leave the US in 7 days. [image or embed] — Aaron Reichlin-Melnick ( @reichlinmelnick.bsky.social ) April 11, 2025 at 7:53 PM The U.S. military shifted a Patriot battalion from the Indo-Pacific to the Middle East, requiring at least 73 flights, according to one commander. https://t.co/iS1dTzRptt — Axios (@axios) April 11, 2025 An unexamined side effect of encouraging every single American to be a hustle grindset small business owner is that a lot more Americans have now interacted with Chinese factories and know they're responsive and easy to work with. [image or embed] — Chris Person ( @papapishu.bsky.social ) April 11, 2025 at 9:56 AM Funniest trade war outcome would be Trump negotiates zero tariff free trade agreement with China and we’re flooded with BYD and Xiaomi EVs — Deva Hazarika (@devahaz) April 11, 2025 Soboroff bows out as L.A. fire recovery czar, with some parting shots - Los Angeles Times https://t.co/aNJJz6jLtO — Hector Becerra (@hbecerraLATimes) April 12, 2025 (\"He said he doesn’t know why he was shut out of city recovery planning, though it was 'possible' that the mayor’s office found him 'too aggressive.'\") This is startling: About 34% of applicants to California's Community College system were likely fake in the last calendar year, and have been scamming millions of dollars in state and federal financial aid. https://t.co/8BsiOeXtb9 — Emily Hoeven (@emily_hoeven) April 8, 2025 (\" A spokesperson from the Chancellor’s Office said that its fraud detection and prevention has caught more suspected scammers than ever during the application process and stopped them there. However, even with that getting better, financial aid fraud is getting worse\") https://t.co/qrLlNMyg4k — The Information (@theinformation) April 10, 2025 (Sites that game Google to try to grab traffic are in trouble because Google is trying to eliminate the need to click through search results) (But also this, \"OpenAI CEO Sam Altman has said the company could eventually take a cut of sales ChatGPT helps facilitate\") Gonna take this opportunity to say that I can personally deliver no script for as little as 7 million, and I know some other writers who can do it for as little as five million. [image or embed] — Paul Tobin ( @paultobin.bsky.social ) April 10, 2025 at 2:20 PM (\" Prime Video signed up [the creator] to a megabucks exclusivity deal in 2019 worth $20 million a year, but since then it has produced no shows or films from [her]\") Nearly 200 cows disappeared. The case remains cold. @jspetzlerphoto https://t.co/S7KknPepxN pic.twitter.com/vMp0t0TeHT — Washington Post Photo (@WashPostPhoto) April 10, 2025 (Long article about how the business works and why the investigation into presumed cattle rustling has struggled. \" Out in Montrose County , [the Montrose County Sheriff’s Office's administrative sergeant] is hoping the sheriff might let him purchase a horse to use for exploring the plateau once the snow melts. Any tire tracks will most likely be lost to moisture, any carcasses to predators or bugs. But Searcy figures he might come across a makeshift corral or some other sign. And maybe someone will talk.\") About as many people watched KRAVEN THE HUNTER on Netflix than THE ELECTRIC STATE on the same platform during their \"debut streaming\" week. [image or embed] — Peter Labuza ( @labuzamovies.com ) April 11, 2025 at 4:37 PM (And since it was a Sony movie, it wasn't even available on the ad tier) The number of private jets at Augusta Airport for the Masters is absurd. 🤯 (📹: Instagram/ bnatower) pic.twitter.com/KnTfdFb5dm — Golf Digest (@GolfDigest) April 10, 2025 Some stars on the PGA Tour are reminding members of the media that they won’t do anything they don’t want to do—including talking. @MMcCarthyREV has more ⬇️ — Front Office Sports (@FOS) April 10, 2025 ESPN's coverage of Thursday's first round of The Masters Tournament averaged 2.3 million viewers. That's a 28% drop from 3.2 million for last year's first round--when ratings magnet Tiger Woods was in the field. — Michael McCarthy (@MMcCarthyREV) April 11, 2025 Watching FP2 now, Fernando Alonso had a steering wheel issue and it came off while he was on track [image or embed] — CJ Fogler ( @cjzero.bsky.social ) April 11, 2025 at 12:21 PM Bill Kennedy has to interrupt his review explanation to shoo away Julius Randle who videobombs him anyway 😂😂 [image or embed] — CJ Fogler ( @cjzero.bsky.social ) April 11, 2025 at 7:53 PM Getty's went back into their archives and pulled more photos from this dance event! Can we match these dancers to the original photo? www.gettyimages.co.uk/detail/news-... www.gettyimages.co.uk/detail/news-... www.gettyimages.co.uk/detail/news-... [image or embed] — Aric Toler ( @aric.bsky.social ) April 10, 2025 at 7:33 AM (Tracing the group photo from Kubrick's The Shining) Garlic Octopus Roll in the Italian 2nd division at SSC Bari 💷 £4.50 pic.twitter.com/t38NHZjv6H — Sports Scran (@SportScran) March 7, 2025 The template pic.twitter.com/BJZdbokktZ — Neil Renic (@NC_Renic) March 5, 2025 I grew up off Coldwater Canyon, but among LA's storied canyon roads, Laurel, Topanga & Benedict are far more associated with literary, music, true-crime & pop-culture history. Thus I was thrilled to see \"Coldwater Canyon\" ominously cited in the film noir \"Too Late for Tears\"! pic.twitter.com/lJnAgfR7wR — L.A. Dork (@la_dorkout) March 8, 2025 “Cultural Inbreeding” is the term I like to use the most. There comes a point where the outsider perception of Dinosaurs post-1993 has become so Jurassic-Coded that the franchise has effectively become ill by the original's own success, Jurassic Park is a product of its time. https://t.co/67n30ZQSfC pic.twitter.com/TwbEMb3Hhu — Omar García (@GMaster1984) March 8, 2025 To me, scenes like this are what make animation believable. The real life observation of trying to get your dog to take it’s medicine, translated onto a fantastical dragon, creates a bridge between reality and fantasy that lets one accept all of the other fantasy as real. 🧵 https://t.co/g7YzVXZdWz — Kabir Kukathas 🐘 🍉 (@kubbabeer) March 7, 2025 @suzanspartan Elon’s Plan To Deport #tesla #elonmusk #mexican #selfdriving #plan #cybertruck #mexico #donttrustanyone ♬ TESLA - Clave Especial @atlarchiethecorgi besties forever 💘 #comfortdog #dogsoftiktok #momsoftiktok #cute #love #corgi #babyboy #11monthsold #corgisoftiktok #corgipuppy #boymom #dogmom ♬ original sound - ౨ৎ * More funny posts . Labels: funny Newer Post Older Post Home Contact me at jstruan at gmail.com. Sign up for the newsletter As an Amazon Associate I earn from qualifying purchases. Please support Super Punch by following the affiliate links and buying from Amazon and eBay . This site also uses tracking cookies. Logo by Adam Koford . Download the Super Punch Chimera paper toy. Search This Blog Blog Archive ▼ 2025 (423) ▼ April (62) Today's news and jokes A good line from Arkady's Martine's short story \"T... Lego LSTR Replika from Signalis (with instructions) The Marathon reveal cinematic short is super cool Bloomberg's weekly news trivia game is fun Humble Bundle featuring Hellboy Universe comics Today's news and jokes Training on Cirque du Soleil's shifting stage Patch for a mission to put an x-ray machine in space New Humble Bundle featuring the Train Sim World vi... Tom Bloom (Kill Six Billion Demons) made his vario... Today's news and jokes This typography is hitting the spot while I wait f... Here's Toy Nacelle's optimistic statement about ta... \"The Lost Years Casey Jones\" and a bunch of other ... New Humble Bundle features Wheel of Time novels Marvel Legends Hulk with new type torso to allow g... Today's news and jokes Fan-commissioned poster for Coppolla's Bram Stoker... Season two of Interview with the Vampire is stream... Truly demented new Star Wars character maquette by... New Humble Bundle for \"all cyberpunks, adrenaline ... Today's news and jokes Photos from the Harryhausen exhibit Evil Lego Starfish perhaps Today's news and jokes Griffith Observatory Minecraft map This is what was in the Marathon gift box sent out... Apple's Murderbot series includes scenes from The ... Today's news and jokes Tauntaun popcorn bucket Marathon art and fan art Images from yesterday's Severance event Links to some of the 2025 Hugo Award nominees New Humble Bundle features Vampire Hunter D comics Today's news and jokes Custom toy of Richard Scarry's mice in cheese car \"Private Equity: A Memoir by Carrie Sun\" is $1.99 Trinity's heart hair; watch some USWNT players esc... They spent a year trying to figure out where the o... Today's news and jokes Joan of Arc sweater New Humble Bundle featuring video games by Armor G... Love this Marathon runner fan art Today's news and jokes Floating ethereal curtain Neal Stephenson's most recent novel Polostan is $1... Good henna Grendel Prime and other action figures canceled wi... The new G.I. Joe figures by Super 7 are up for pre... Emo Symbiote Tobey Maguire Marvel Legends figure u... Today's news and jokes Free access to the Vatican Library’s digitized col... New Humble Bundle features \"In Other Waters\" and o... Clearance sale on deluxe NBA figures and accessori... Entertainment Earth has some damaged box G.I. Joe ... Today's news and jokes Hot chocolate topped with a chocolate Mayan temple A Val Kilmer movie available on Prime I haven't se... The Humble monthly bundle features Aliens Dark Des... Today's news and jokes Some impressive Lego monsters ► March (127) ► February (112) ► January (122) ► 2024 (2071) ► December (134) ► November (146) ► October (163) ► September (182) ► August (165) ► July (184) ► June (164) ► May (162) ► April (162) ► March (216) ► February (208) ► January (185) ► 2023 (2328) ► December (183) ► November (199) ► October (185) ► September (158) ► August (187) ► July (204) ► June (192) ► May (230) ► April (201) ► March (237) ► February (167) ► January (185) ► 2022 (1919) ► December (177) ► November (173) ► October (149) ► September (149) ► August (172) ► July (139) ► June (123) ► May (168) ► April (164) ► March (170) ► February (162) ► January (173) ► 2021 (2004) ► December (159) ► November (144) ► October (163) ► September (168) ► August (172) ► July (179) ► June (182) ► May (180) ► April (172) ► March (157) ► February (152) ► January (176) ► 2020 (2170) ► December (198) ► November (206) ► October (189) ► September (172) ► August (177) ► July (200) ► June (155) ► May (173) ► April (173) ► March (193) ► February (169) ► January (165) ► 2019 (1895) ► December (100) ► November (121) ► October (135) ► September (177) ► August (213) ► July (149) ► June (138) ► May (167) ► April (211) ► March (198) ► February (153) ► January (133) ► 2018 (2072) ► December (191) ► November (186) ► October (180) ► September (152) ► August (200) ► July (204) ► June (106) ► May (157) ► April (220) ► March (129) ► February (150) ► January (197) ► 2017 (1844) ► December (144) ► November (181) ► October (196) ► September (173) ► August (192) ► July (213) ► June (168) ► May (138) ► April (131) ► March (94) ► February (112) ► January (102) ► 2016 (1251) ► December (116) ► November (135) ► October (101) ► September (131) ► August (142) ► July (112) ► June (129) ► May (72) ► April (53) ► March (90) ► February (84) ► January (86) ► 2015 (1009) ► December (75) ► November (70) ► October (81) ► September (60) ► August (74) ► July (93) ► June (95) ► May (92) ► April (81) ► March (75) ► February (95) ► January (118) ► 2014 (921) ► December (63) ► November (82) ► October (90) ► September (66) ► August (66) ► July (48) ► June (71) ► May (84) ► April (72) ► March (94) ► February (83) ► January (102) ► 2013 (546) ► December (86) ► November (51) ► October (63) ► September (33) ► August (37) ► July (35) ► June (44) ► May (34) ► April (33) ► March (37) ► February (40) ► January (53) ► 2012 (632) ► December (42) ► November (53) ► October (58) ► September (57) ► August (70) ► July (59) ► June (72) ► May (52) ► April (39) ► March (28) ► February (63) ► January (39) ► 2011 (317) ► December (17) ► November (17) ► October (18) ► September (12) ► August (17) ► July (14) ► June (27) ► May (34) ► April (50) ► March (24) ► February (47) ► January (40) ► 2010 (430) ► December (41) ► November (28) ► October (24) ► September (49) ► August (60) ► July (47) ► June (46) ► May (37) ► April (45) ► March (16) ► February (11) ► January (26) ► 2009 (341) ► December (13) ► November (34) ► October (39) ► September (22) ► August (32) ► July (21) ► June (20) ► May (18) ► April (17) ► March (50) ► February (43) ► January (32) ► 2008 (266) ► December (40) ► November (14) ► October (14) ► September (17) ► August (17) ► July (47) ► June (26) ► May (16) ► April (12) ► March (12) ► February (23) ► January (28) ► 2007 (144) ► December (14) ► November (17) ► October (10) ► September (18) ► August (26) ► July (19) ► June (15) ► May (10) ► April (12) ► March (3)", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://www.superpunch.net/2025/04/todays-news-and-jokes_0229904203.html", "source": "Superpunch.net", "published_at": "2025-04-12T16:00:00"}, {"id": 11, "title": "Tesla accused of using sneaky tactic to dodge car repairs", "content": "Tesla accused of using sneaky tactic to dodge car repairs Why are tariffs challenging online sellers? What sparked Elon Musk's DOGE controversy? How did tariff reversals boost US stocks? Why did a CryptoPunk whale hide profits? What worries Ray Dalio about the economy? Why are tech tariff exemptions temporary? How will trade shifts affect global suppliers? What drives Meta's antitrust trial threat? Why did British Steel seek government help? Tesla accused of using sneaky tactic to dodge car repairs thestreet.com/automotive/tesla-accused-of-using-sneaky-tactic-to-dodge-car-repairs has been embroiled in controversy over the past few months. Since Tesla CEO Elon Musk joined the Trump administration in January, heading the Department of Government Efficiency (DOGE), many consumers have turned against the automaker due to Musk’s recent efforts to shrink the… This story appeared on thestreet.com , 2025-04-12 15:47:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/9cb27d4d716328d4", "source": "Biztoc.com", "published_at": "2025-04-12T15:52:08"}, {"id": 12, "title": "Trump administration says it will exclude some electronics from 'reciprocal' tariffs", "content": "Trump's commerce secretary says new electronics tariff exemptions are temporary, chip tariffs coming Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news LATEST NEWS Maritime, STEM, and more careers represented at expo 1 hour ago Youth explore water-linked career paths at Detroit River expo Read full article: Youth explore water-linked career paths at Detroit River expo Nakia Anderson 1 hour ago Detroit police searching for missing 15-year-old girl Read full article: Detroit police searching for missing 15-year-old girl A foot chase through rush hour traffic by a phone theft suspect ended in an arrest in West Bloomfield. 6 hours ago West Bloomfield foot chase through rush hour traffic ends in arrest of phone theft suspect Read full article: West Bloomfield foot chase through rush hour traffic ends in arrest of phone theft suspect Once inside, what Detroit Pit Crew rescuers found was heartbreaking 7 hours ago ‘Repulsive, unacceptable’: Realtor shocked to find emaciated dog in Detroit basement Read full article: ‘Repulsive, unacceptable’: Realtor shocked to find emaciated dog in Detroit basement CLICK ON DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Sign up for our Events Newsletter! Sign Up Business Trump's commerce secretary says new electronics tariff exemptions are temporary, chip tariffs coming Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news Full Screen 1 / 4 Previous photo Next photo FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Chinese people visit an Apple Store, inside a shopping mall, in Beijing, Thursday, April 10, 2025. (AP Photo/Andy Wong) A person carrying an umbrella walks past the Apple Store on the 5th Avenue, Monday, April 7, 2025, in New York. (AP Photo/Yuki Iwamura) Sales staffs work at an Apple shop in Hanoi, Vietnam Thursday, April 10, 2025. (AP Photo/Hau Dinh) FILE - The iPhone 14, iPhone 14 Pro and iPhone 14 Pro Max are displayed at the Apple Fifth Avenue store, Friday, Sept. 16, 2022, in New York. (AP Photo/Yuki Iwamura, File) Tariff exemptions announced Friday on electronics like smartphones and laptops are only a temporary reprieve until the Trump administration develops a new tariff approach specific to the semiconductor industry, U.S. Commerce Secretary Howard Lutnick said Sunday. “They’re exempt from the reciprocal tariffs but they’re included in the semiconductor tariffs, which are coming in probably a month or two,” Lutnick told ABC's “This Week” on Sunday. Recommended Videos The Trump administration late Friday said it would exclude electronics from reciprocal tariffs , a move that could help keep the prices down for popular consumer devices that aren’t usually made in the U.S. The move was expected to benefit big tech companies like Apple and Samsung and chip makers like Nvidia, though the uncertainty of future tariffs may rein in an expected tech stock rally on Monday. U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in its massive plan to put tariffs in place on goods from most countries. Lutnick's comments Sunday made clear that more changes were on the way, including a policy specific to the computer chip industry. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, it would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broadly. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. When Trump paused the tariffs outside of China on Wednesday, the lost value in those companies was pared to $644 billion, or a 4% decline. The electronics exemption is the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move removes “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. Ives amended that note after Lutnick's comments Sunday, saying the confusing news out of the White House “is dizzying for the industry and investors and creating massive uncertainty and chaos for companies trying to plan their supply chain, inventory, and demand.” In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. She said the administration has secured U.S. investments from tech companies — including Apple, TSMC and Nvidia — who are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment over the weekend. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos CLICK ON DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.clickondetroit.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WDIV ClickOnDetroit", "published_at": "2025-04-12T15:26:29"}, {"id": 13, "title": "Elon Musk's Cybertruck Is Controversial, But Kids Love It", "content": "Elon Musk's Cybertruck Is Controversial, But Kids Love It Why are tariffs challenging online sellers? What sparked Elon Musk's DOGE controversy? How did tariff reversals boost US stocks? Why did a CryptoPunk whale hide profits? What worries Ray Dalio about the economy? Why are tech tariff exemptions temporary? How will trade shifts affect global suppliers? What drives Meta's antitrust trial threat? Why did British Steel seek government help? Elon Musk's Cybertruck Is Controversial, But Kids Love It benzinga.com/tech/25/04/44778243/elon-musks-cybertruck-is-controversial-but-kids-love-it The Tesla Cybertruck may be polarizing among adults, but it is a hit among children. What Happened: Children are enamored with the Cybertruck, the brainchild of Elon Musk and his company Tesla Inc. (NASDAQ:TSLA). The vehicle has been at the center of public opinion, with some owners… This story appeared on benzinga.com , 2025-04-12 15:01:06. The Entire Business World on a Single Page. Free to Use →", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://biztoc.com/x/d851771db419bfe9", "source": "Biztoc.com", "published_at": "2025-04-12T15:18:43"}, {"id": 14, "title": "Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs", "content": "Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news Sign up for our Newsletters Sign Up LATEST NEWS FILE CDC 1 hour ago Cruise season comes with ‘Ferrari of viruses’ Read full article: Cruise season comes with ‘Ferrari of viruses’ No description available 4 hours ago Measles risk increases as more families travel during spring break Read full article: Measles risk increases as more families travel during spring break No description available 19 hours ago Shark bite victim airlifted from Everglades National Park Read full article: Shark bite victim airlifted from Everglades National Park Fantasy 5 23 hours ago Winning Fantasy 5 ticket sold at Miami-Dade food store Read full article: Winning Fantasy 5 ticket sold at Miami-Dade food store Business Trump administration says it will exclude some electronics from ‘reciprocal’ tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news The website for the nonprofit GiveDirectly is displayed on a laptop on Nov. 26, 2024 in New York. (AP Photo/Peter Morgan) (Peter Morgan, Copyright 2024 The Associated Press. All rights reserved) Tariff exemptions announced Friday on electronics like smartphones and laptops are only a temporary reprieve until the Trump administration develops a new tariff approach specific to the semiconductor industry, U.S. Commerce Secretary Howard Lutnick said Sunday. “They’re exempt from the reciprocal tariffs but they’re included in the semiconductor tariffs, which are coming in probably a month or two,” Lutnick told ABC's “This Week” on Sunday. Recommended Videos The Trump administration late Friday said it would exclude electronics from reciprocal tariffs , a move that could help keep the prices down for popular consumer devices that aren’t usually made in the U.S. The move was expected to benefit big tech companies like Apple and Samsung and chip makers like Nvidia, though the uncertainty of future tariffs may rein in an expected tech stock rally on Monday. U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in its massive plan to put tariffs in place on goods from most countries. Lutnick's comments Sunday made clear that more changes were on the way, including a policy specific to the computer chip industry. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, it would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broadly. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. When Trump paused the tariffs outside of China on Wednesday, the lost value in those companies was pared to $644 billion, or a 4% decline. The electronics exemption is the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move removes “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. Ives amended that note after Lutnick's comments Sunday, saying the confusing news out of the White House “is dizzying for the industry and investors and creating massive uncertainty and chaos for companies trying to plan their supply chain, inventory, and demand.” In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. She said the administration has secured U.S. investments from tech companies — including Apple, TSMC and Nvidia — who are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment over the weekend. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Loading... Recommended Videos", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.local10.com/business/2025/04/12/trump-administration-says-it-will-exclude-some-electronics-from-reciprocal-tariffs/", "source": "WPLG Local 10", "published_at": "2025-04-12T15:08:20"}, {"id": 15, "title": "Smartphones, laptops to be exempt from Trump administration’s ‘reciprocal’ tariffs", "content": "Smartphones, laptops to be exempt from Trump administration’s ‘reciprocal’ tariffs Close Business Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news , Politics , Donald Trump , Tariffs , Economy , Consumer , Government LATEST NEWS Alexander Lefort, 30 2 minutes ago ‘You’ve been warned:’ Florida man shoots himself in scheme to win over coworker, police say Read full article: ‘You’ve been warned:’ Florida man shoots himself in scheme to win over coworker, police say \"Health is Wealth\" event in Ocoee 2 hours ago ‘Health is Wealth’ event blends wellness and community service in Ocoee Read full article: ‘Health is Wealth’ event blends wellness and community service in Ocoee As Whispering Winds clears debris, residents face delays and frustration 14 hours ago Debris gone, frustration remains: Longwood’s recovery crawl Read full article: Debris gone, frustration remains: Longwood’s recovery crawl Incident happened at 2271 North Semoran Blvd. 15 hours ago Victims found safe after being kidnapped at Orange County Walmart, deputies say Read full article: Victims found safe after being kidnapped at Orange County Walmart, deputies say SHOP DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last Sign up for our events newsletter: Sign Up Business Smartphones, laptops to be exempt from Trump administration’s ‘reciprocal’ tariffs Mae Anderson Associated Press Published: April 12, 2025 at 10:38 AM Updated: April 13, 2025 at 2:03 PM Tags: Business , Technology , U.S. news , Politics , Donald Trump , Tariffs , Economy , Consumer , Government Smartphones at a store. (Provided by Consumer Reports) Tariff exemptions announced Friday on electronics like smartphones and laptops are only a temporary reprieve until the Trump administration develops a new tariff approach specific to the semiconductor industry, U.S. Commerce Secretary Howard Lutnick said Sunday. “They’re exempt from the reciprocal tariffs but they’re included in the semiconductor tariffs, which are coming in probably a month or two,” Lutnick told ABC's “This Week” on Sunday. Recommended Videos The Trump administration late Friday said it would exclude electronics from reciprocal tariffs , a move that could help keep the prices down for popular consumer devices that aren’t usually made in the U.S. The move was expected to benefit big tech companies like Apple and Samsung and chip makers like Nvidia, though the uncertainty of future tariffs may rein in an expected tech stock rally on Monday. U.S. Customs and Border Protection said items like smartphones, laptops, hard drives, flat-panel monitors and some chips would qualify for the exemption. Machines used to make semiconductors are excluded too. That means they won’t be subject to the current 145% tariffs levied on China or the 10% baseline tariffs elsewhere . It's the latest tariff change by the Trump administration, which has made several U-turns in its massive plan to put tariffs in place on goods from most countries. Lutnick's comments Sunday made clear that more changes were on the way, including a policy specific to the computer chip industry. On Air Force One Saturday night, President Donald Trump told reporters he would get into more specifics on exemptions on Monday. “We’ve been making a lot of money,” he said. \"It’s been the other way around. Other countries, in particular China was making a lot of money.” The exemption filed Friday night seemed to reflect the president’s realization that his China tariffs are unlikely to shift more manufacturing of smartphones, computers and other gadgets to the U.S. any time soon, if ever, despite the administration’s predictions that the trade war prod Apple to make iPhones in the U.S. for the first time. But that was an unlikely scenario after Apple spent decades building up a finely calibrated supply chain in China. What’s more, it would take several years and cost billions of dollars to build new plants in the U.S., and then confront Apple with economic forces that could triple the price of an iPhone, threatening to torpedo sales of its marquee product. Trump’s decision to exempt the iPhone and other popular electronics made in China mirrors the similar relief that he gave those products during the trade war of his first term in the White House. But Trump began his second term seemingly determined to impose the tariffs more broadly. The turmoil battered the stocks of tech’s “Magnificent Seven” -- Apple, Microsoft, Nvidia, Amazon, Tesla, Google parent Alphabet and Facebook parent Meta Platforms. At one point, the Magnificent Seven’s combined market value had plunged by $2.1 trillion, or 14%, from April 2 when Trump unveiled sweeping tariffs on a wide range of countries. When Trump paused the tariffs outside of China on Wednesday, the lost value in those companies was pared to $644 billion, or a 4% decline. The electronics exemption is the kind of friendly treatment that industry was envisioning when Apple CEO Tim Cook, Tesla CEO Elon Musk, Google CEO Sundar Pichai, Facebook founder Mark Zuckerberg and Amazon founder Jeff Bezos assembled behind the president during his Jan. 20 inauguration. That united display of fealty reflected Big Tech’s hopes that Trump would be more accommodating than President Joe Biden’s administration. Apple won praise from Trump in late February when the Cupertino, California, company committed to invest $500 billion and add 20,000 jobs in the U.S. during the next four years. The pledge was an echo of a $350 billion investment commitment in the U.S. that Apple made during Trump’s first term when the iPhone was exempted from China tariffs. The move removes “a huge black cloud overhang for now over the tech sector and the pressure facing U.S. Big Tech,” said Wedbush analyst Dan Ives in a research note. Ives amended that note after Lutnick's comments Sunday, saying the confusing news out of the White House “is dizzying for the industry and investors and creating massive uncertainty and chaos for companies trying to plan their supply chain, inventory, and demand.” In a statement issued Saturday, White House Press Secretary Karoline Leavitt did not address the exemptions specifically but indicated the administration still plans to push for tech companies to move manufacturing to the U.S. She said the administration has secured U.S. investments from tech companies — including Apple, TSMC and Nvidia — who are \"hustling to onshore their manufacturing in the United States as soon as possible.” Neither Apple nor Samsung responded to a request for comment over the weekend. Nvidia declined to comment. ___ Liedtke contributed from Berkeley, California. AP White House correspondent Darlene Superville in West Palm Beach, Florida, contributed to this report. Copyright 2025 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission. Loading... Recommended Videos SHOP DEALS Proscenic P12 Handheld Cordless Vacuum Cleaner This cordless vacuum shows you hidden dust — but for way less Read full article: This cordless vacuum shows you hidden dust — but for way less Microsoft Office Professional 2021 for Windows: Lifetime License Get Microsoft Office apps for less while codes last Read full article: Get Microsoft Office apps for less while codes last", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://www.clickorlando.com/business/2025/04/12/smartphones-laptops-to-be-exempt-from-trump-administrations-reciprocal-tariffs/", "source": "WKMG News 6 & ClickOrlando", "published_at": "2025-04-12T15:02:12"}, {"id": 16, "title": "Is Tesla Stock a Buy Now?", "content": "Is Tesla Stock a Buy Now? Why are tariffs challenging online sellers? What sparked Elon Musk's DOGE controversy? How did tariff reversals boost US stocks? Why did a CryptoPunk whale hide profits? What worries Ray Dalio about the economy? Why are tech tariff exemptions temporary? How will trade shifts affect global suppliers? What drives Meta's antitrust trial threat? Why did British Steel seek government help? Is Tesla Stock a Buy Now? finance.yahoo.com/news/tesla-stock-buy-now-141500486.html In This Article: It's been a chaotic week for investors. The Dow Jones, the S&P 500, and the Nasdaq Composite all saw one of the worst multi-day stretches in years. This comes as a trade war escalated between the U.S. and its major trade partners, with China and the E.U. responding in… This story appeared on finance.yahoo.com , 2025-04-12 14:15:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/b94b4a1c7ee8a3ab", "source": "Biztoc.com", "published_at": "2025-04-12T14:35:15"}, {"id": 17, "title": "Elon Musk faces accusations from major tech rival", "content": "Elon Musk faces accusations from major tech rival Why did Trump launch a chip imports probe? How will Meta's antitrust case affect its empire? Why is ExxonMobil stock undervalued? How will Argentina's IMF loan reshape policies? What causes tech tariff exemptions to be temporary? Why are investors wary amid policy zigzags? How will U.S.-Saudi nuclear deal impact energy? What fuels the record SOL-to-ETH ratio? Why did British Steel seek external help? Elon Musk faces accusations from major tech rival thestreet.com/technology/elon-musk-faces-accusations-from-major-tech-rival Things haven’t been going well for Elon Musk lately, and this week hasn’t been an exception. After a highly volatile trading week, Tesla stock is still struggling against difficult market conditions. Even its lack of direct exposure to the recently imposed auto industry tariffs hasn’t… This story appeared on thestreet.com , 2025-04-12 14:07:00. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEGATIVE", "sentiment_score": -0.7, "url": "https://biztoc.com/x/81f439ad1b48d33c", "source": "Biztoc.com", "published_at": "2025-04-12T14:23:35"}, {"id": 18, "title": "The xAI–X merger is a good deal — if you’re betting on Musk’s empire | TechCrunch", "content": "The xAI–X merger is a good deal — if you’re betting on Musk’s empire | TechCrunch The xAI–X merger is a good deal — if you’re betting on Musk’s empire | TechCrunch Image Credits: Getty Images AI The xAI–X merger is a good deal — if you’re betting on Musk’s empire Rebecca Bellan 7:00 AM PDT · April 12, 2025 When Elon Musk announced that his AI startup, xAI, had acquired his social media company, X (formerly known as Twitter), in an all-stock deal , it raised some eyebrows. But in many ways, the deal made sense. xAI’s chatbot, Grok, was already deeply integrated with X, X was floundering financially , and Musk needed a way to make his $44 billion Twitter acquisition look less like an impulsive takeover and more like a strategic play for AGI dominance. It also pointed to something deeper about how Musk’s empire works: investing in any one of his companies isn’t about a quick return on investment. It’s about buying into the mysticism around Musk and swallowing whole a narrative of success that outpaces the actual numbers. Some call it a grift , pointing to Musk’s history of overpromising and underdelivering . But the market is increasingly more tolerant – welcoming, even – of narrative-led investments, particularly when the thread that ties the tale together is one of the president’s right-hand men. “All of Elon’s companies today are basically one company,” Yoni Rechtman, a principal at Slow Ventures, told TechCrunch. “It’s all already Elon, Inc. There are people who work across multiple companies simultaneously. They share a web of capital connections. They do business with one another, and he treats them all effectively as one company. So [the xAI-X merger] just ends some of the fiction that the two businesses were separate.” The thinking among Musk bulls like Ron Baron, the founder of investment management firm Baron Capital, is that “every single thing [Musk] does is helping everything else he does,” as Baron phrased it . Other businesses under Musk’s control include Tesla, SpaceX, The Boring Company, and Neuralink – some of which reportedly share resources . “When [Musk] bought Twitter, did he have in his mind that there’s an opportunity to have this data, a tremendous value for licensing? When he decided he wanted to go to Mars with SpaceX, did he really think initially that there’s a real opportunity here for the internet around the world, and there’s gonna be hundreds of billions of dollars of revenue opportunity? When he started off with EVs for Tesla, did he really think that this is gonna merge into self-driving, where you can make hundreds of billions of dollars a year of extra profits, and Grok […] and you’re gonna have connected cars all around the world? […] All these businesses link up. It’s the ecosystem. It’s the Elon ecosystem, and I think it’s really interesting when you look at it that way.” Baron Capital has invested across Musk’s ecosystem, an example of the investor crossover between the billionaire’s various companies. Firms like 8VC, Andreessen Horowitz, DFJ Growth, Fidelity Investments, Manhattan Venture Partners, Saudi Arabia’s PIF, Sequoia Capital, Vy Capital, and others also hold positions throughout Musk’s corporate web. That brings us back to the xAI-X deal. Pundits questioned how the acquisition could value X at $33 billion, more than triple its valuation just a few months ago, and how it could value xAI at $80 billion considering the AI company reportedly has little in the way of revenue. But valuations aren’t always based on what exists today. Rather, they take into account what investors are hoping for – and that’s particularly true when it comes to Musk’s ventures. Just look at Tesla. The electric vehicle maker has been treated like a tech stock for years despite the fact that it has automaker margins , based largely on the belief that Tesla will one day unlock groundbreaking autonomy in the form of self-driving cars and humanoid robots. “The reason why [Tesla’s] stock trades at 80 times earnings and the comp group trades at 25 times earnings is that people are making a bet on the long term, and it’s not about what happens to numbers this year,” Gene Munster, managing partner at Deepwater Asset Management, told TechCrunch. “That’s one of Elon’s superpowers, this ability to keep investors engaged for the long term.” Munster’s firm has invested in X, xAI, and Tesla. It’s exactly the type of all-in Musk backer that stands to benefit the most from a deal like xAI buying X, assuming Musk can indeed deliver on his pledge of marrying X’s real-time data trove and distribution platform with xAI’s infrastructure and AI expertise. Of course, consolidated value also comes with increased risk. Dan Wang, a professor at Columbia Business School whose research lies at the intersection of business and society, told TechCrunch that the biggest immediate risk factor for investors is the ongoing lawsuit that X is facing from the Securities and Exchange Commission (SEC). The suit accuses Musk of misleading investors by delaying the disclosure of his previous investments in Twitter. The SEC has argued that this allowed Musk to buy more Twitter shares at artificially low prices. Wang listed a few other risk considerations, such as anticompetition and user privacy concerns, particularly regarding how X quietly opted all users into data collection for AI model training. The opt-in change has already raised the ire of one regulator, Ireland’s DPC , which recently began investigating it as a potential breach of Europe’s GDPR law. “Another kind of risk here is that there isn’t a consensus framework for how the AI market is going to be regulated, but you’re already seeing traces of this in Europe and, up until recently, in California,” Wang said. “A lot of these frameworks have to do with how AI models are deployed in terms of distributing information […] They ascribe responsibility to the companies that are creating AI models, as well as providing access to those models.” Musk might also simply lose interest in a project, Rechtman said. “I think that is what a lot of Tesla shareholders are feeling right now,” he said, “where for the last several months, Elon’s number one company has been the Trump campaign, and his other projects have languished.” When asked about some of these risk factors, Munster appeared nonplussed. He suggested they’re inconsequential given the enormity of, for example, xAI’s value proposition and potential to become a dominant player in AI. “We’re betting the firm on the belief that AI is going to be more transformative than what people think,” he said. “What is the value […] of one of the four brains that the world is going to run on?” Rechtman said that Musk bulls aren’t blindly loyal, per se, but simply trust in Musk’s superpower to “bend capital markets to his will” in a way that allows him to do things and build businesses that nobody else can. “The people who are in these businesses have just gone long Elon, and they will continue to go long Elon,” Rechtman said. “So it’s not surprising to me that they will just continue to tell you that the emperor is wearing clothes.” Not for nothing, buying into Musk’s more speculative bets, like X, is one way to potentially unlock more investment opportunities in the Muskverse, Rechtman said. “SpaceX is a real thing, and it will never go public,” he said. “So the only way to invest in SpaceX is to get access to the tenders. And the only way to get access to the tenders is to be in Elon’s good graces.” Topics AI , Elon Musk , Grok , Social , X , xAI Rebecca Bellan Senior Reporter Rebecca Bellan is a senior reporter at TechCrunch, where she covers Tesla and Elon Musk’s broader empire, autonomy, AI, electrification, gig work platforms, Big Tech regulatory scrutiny, and more. She’s one of the co-hosts of the Equity podcast and writes the TechCrunch Daily morning newsletter. Previously, she covered social media for Forbes.com, and her work has appeared in Bloomberg CityLab, The Atlantic, The Daily Beast, Mother Jones, i-D (Vice) and more. Rebecca has invested in Ethereum. View Bio View Comments Most Popular Jack Dorsey and Elon Musk would like to ‘delete all IP law’ Anthony Ha OpenAI co-founder Ilya Sutskever’s Safe Superintelligence reportedly valued at $32B Anthony Ha Trump exempts smartphones, laptops, and semiconductors from new tariffs Anthony Ha Week in Review: Jeff Bezos’ secret EV startup Karyne Levy Hacked documents reveal guide to serving Elon Musk on private jets Rebecca Bellan OpenAI will soon phase out GPT-4 from ChatGPT Kyle Wiggers Fintech founder charged with fraud after ‘AI’ shopping app found to be powered by humans in the Philippines Charles Rollet Loading the next article Error loading the next article", "sentiment": "POSITIVE", "sentiment_score": 0.7, "url": "https://techcrunch.com/2025/04/12/the-xai-x-merger-is-a-good-deal-if-youre-betting-on-musks-empire/", "source": "TechCrunch", "published_at": "2025-04-12T14:02:48"}, {"id": 19, "title": "The Trump administration excludes smartphones along with selected computers and laptops from reciprocal tariffs", "content": "The Trump administration excludes smartphones along with selected computers and laptops from reciprocal tariffs Why did Trump launch a chip imports probe? How will Meta's antitrust case affect its empire? Why is ExxonMobil stock undervalued? How will Argentina's IMF loan reshape policies? What causes tech tariff exemptions to be temporary? Why are investors wary amid policy zigzags? How will U.S.-Saudi nuclear deal impact energy? What fuels the record SOL-to-ETH ratio? Why did British Steel seek external help? The Trump administration excludes smartphones along with selected computers and laptops from reciprocal tariffs t.co/OtgbMJ4QLC This story appeared on t.co , 2025-04-12 13:39:43.381000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/6c26ba1cc5531ece", "source": "Biztoc.com", "published_at": "2025-04-12T13:39:43"}, {"id": 20, "title": "Blaze Triggers Alarm Over Rapid Growth of Big Batteries", "content": "Blaze Triggers Alarm Over Rapid Growth of Big Batteries Why did Trump launch a chip imports probe? How will Meta's antitrust case affect its empire? Why is ExxonMobil stock undervalued? How will Argentina's IMF loan reshape policies? What causes tech tariff exemptions to be temporary? Why are investors wary amid policy zigzags? How will U.S.-Saudi nuclear deal impact energy? What fuels the record SOL-to-ETH ratio? Why did British Steel seek external help? Blaze Triggers Alarm Over Rapid Growth of Big Batteries bloomberg.com/news/articles/2025-04-12/blaze-triggers-alarm-over-rapid-growth-of-big-batteries This story appeared on bloomberg.com , 2025-04-12 13:30:03.034000. The Entire Business World on a Single Page. Free to Use →", "sentiment": "NEUTRAL", "sentiment_score": 0.0, "url": "https://biztoc.com/x/75753d83f1e0bbea", "source": "Biztoc.com", "published_at": "2025-04-12T13:39:20"}], "timeline": [{"date": "2025-04-12T14:02:48", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T14:23:35", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T14:35:15", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T15:18:43", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T15:52:08", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:00:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:36:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T16:36:42", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T17:09:13", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-12T17:17:30", "score": -0.8, "sentiment": "NEGATIVE"}, {"date": "2025-04-12T18:11:53", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-13T23:25:43", "score": -0.8, "sentiment": "NEGATIVE"}, {"date": "2025-04-13T23:27:16", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-13T23:27:36", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-13T23:49:30", "score": 0.7, "sentiment": "POSITIVE"}, {"date": "2025-04-14T00:45:00", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-14T01:33:37", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-14T03:13:38", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-14T05:00:00", "score": -0.6, "sentiment": "NEGATIVE"}, {"date": "2025-04-14T05:27:25", "score": -0.8, "sentiment": "NEGATIVE"}, {"date": "2025-04-14T05:36:27", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-14T05:41:22", "score": -0.7, "sentiment": "NEGATIVE"}, {"date": "2025-04-14T05:57:29", "score": 0.8, "sentiment": "POSITIVE"}, {"date": "2025-04-14T06:00:00", "score": -0.7, "sentiment": "NEGATIVE"}]}